nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/*
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * o Redistributions of source code must retain the above copyright notice, this list
 * of conditions and the following disclaimer.
 * o Redistributions in binary form must reproduce the above copyright notice, this
 * list of conditions and the following disclaimer in the documentation and/or
 * other materials provided with the distribution.
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 * contributors may be used to endorse or promote products derived from this
 * software without specific prior written permission.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 'AS IS' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * @file     S32K118.h
 * @brief    CMSIS HeaderFile
 * @version  1.6
 * @date     18. August 2020
 * @note     Generated by SVDConv V3.3.35 on Tuesday, 18.08.2020 14:24:11
 *           from File 'S32K118.svd',
 *           last modified on Thursday, 16.01.2020 17:09:20
 */

/*
 * Copyright (c) 2014 - 2016, Freescale Semiconductor, Inc.
 * Copyright (c) 2016 - 2018, NXP.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY NXP "AS IS" AND ANY EXPRESSED OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 * IN NO EVENT SHALL NXP OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
 * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
 * THE POSSIBILITY OF SUCH DAMAGE.
 */


/** @addtogroup NXP
  * @{
  */


/** @addtogroup S32K118
  * @{
  */


#ifndef S32K118_H
#define S32K118_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M0+ Specific Interrupt Numbers  ======================================= */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* ==========================================  S32K118 Specific Interrupt Numbers  =========================================== */
  DMA0_IRQn                 =   0,              /*!< 0  DMA0                                                                   */
  DMA1_IRQn                 =   1,              /*!< 1  DMA1                                                                   */
  DMA2_IRQn                 =   2,              /*!< 2  DMA2                                                                   */
  DMA3_IRQn                 =   3,              /*!< 3  DMA3                                                                   */
  DMA_Error_IRQn            =   4,              /*!< 4  DMA_Error                                                              */
  ERM_fault_IRQn            =   5,              /*!< 5  ERM_fault                                                              */
  RTC_IRQn                  =   6,              /*!< 6  RTC                                                                    */
  RTC_Seconds_IRQn          =   7,              /*!< 7  RTC_Seconds                                                            */
  LPTMR0_IRQn               =   8,              /*!< 8  LPTMR0                                                                 */
  PORT_IRQn                 =   9,              /*!< 9  PORT                                                                   */
  CAN0_ORed_Err_Wakeup_IRQn =  10,              /*!< 10 CAN0_ORed_Err_Wakeup                                                   */
  CAN0_ORed_0_31_MB_IRQn    =  11,              /*!< 11 CAN0_ORed_0_31_MB                                                      */
  FTM0_Ch0_7_IRQn           =  12,              /*!< 12 FTM0_Ch0_7                                                             */
  FTM0_Fault_IRQn           =  13,              /*!< 13 FTM0_Fault                                                             */
  FTM0_Ovf_Reload_IRQn      =  14,              /*!< 14 FTM0_Ovf_Reload                                                        */
  FTM1_Ch0_7_IRQn           =  15,              /*!< 15 FTM1_Ch0_7                                                             */
  FTM1_Fault_IRQn           =  16,              /*!< 16 FTM1_Fault                                                             */
  FTM1_Ovf_Reload_IRQn      =  17,              /*!< 17 FTM1_Ovf_Reload                                                        */
  FTFC_IRQn                 =  18,              /*!< 18 FTFC                                                                   */
  PDB0_IRQn                 =  19,              /*!< 19 PDB0                                                                   */
  LPIT0_IRQn                =  20,              /*!< 20 LPIT0                                                                  */
  SCG_CMU_LVD_LVWSCG_IRQn   =  21,              /*!< 21 SCG_CMU_LVD_LVWSCG                                                     */
  WDOG_IRQn                 =  22,              /*!< 22 WDOG                                                                   */
  RCM_IRQn                  =  23,              /*!< 23 RCM                                                                    */
  LPI2C0_Master_Slave_IRQn  =  24,              /*!< 24 LPI2C0_Master_Slave                                                    */
  FLEXIO_IRQn               =  25,              /*!< 25 FLEXIO                                                                 */
  LPSPI0_IRQn               =  26,              /*!< 26 LPSPI0                                                                 */
  LPSPI1_IRQn               =  27,              /*!< 27 LPSPI1                                                                 */
  ADC0_IRQn                 =  28,              /*!< 28 ADC0                                                                   */
  CMP0_IRQn                 =  29,              /*!< 29 CMP0                                                                   */
  LPUART1_RxTx_IRQn         =  30,              /*!< 30 LPUART1_RxTx                                                           */
  LPUART0_RxTx_IRQn         =  31               /*!< 31 LPUART0_RxTx                                                           */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

