nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM4LL_CSE_PRAM;/*!< (@ 0x00000010) CSE PRAM4LL register.                               */

        struct {
          __IOM uint8_t RAM_LL  : 8;            /*!< [7..0] RAM_LL stores the first 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM4LL_CSE_PRAM_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM4LU;  /*!< (@ 0x00000011) CSE PRAM4LU register.                                      */

        struct {
          __IOM uint8_t RAM_LU  : 8;            /*!< [7..0] RAM_LU stores the second 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM4LU_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM4HL;  /*!< (@ 0x00000012) CSE PRAM4HL register.                                      */

        struct {
          __IOM uint8_t RAM_HL  : 8;            /*!< [7..0] RAM_HL stores the third 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM4HL_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM4HU;  /*!< (@ 0x00000013) CSE PRAM4HU register.                                      */

        struct {
          __IOM uint8_t RAM_HU  : 8;            /*!< [7..0] RAM_HU stores the fourth 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM4HU_b;
      } ;
    };
  };

  union {
    union {
      __IOM uint32_t CSE_PRAM_EmbeddedRAM5_CSE_PRAM;/*!< (@ 0x00000014) CSE PRAM 5 Register                                    */

      struct {
        __IOM uint32_t BYTE_3   : 8;            /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
        __IOM uint32_t BYTE_2   : 8;            /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
        __IOM uint32_t BYTE_1   : 8;            /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
        __IOM uint32_t BYTE_0   : 8;            /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
      } CSE_PRAM_EmbeddedRAM5_CSE_PRAM_b;
    } ;

    struct {
      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM5LL_CSE_PRAM;/*!< (@ 0x00000014) CSE PRAM5LL register.                               */

        struct {
          __IOM uint8_t RAM_LL  : 8;            /*!< [7..0] RAM_LL stores the first 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM5LL_CSE_PRAM_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM5LU;  /*!< (@ 0x00000015) CSE PRAM5LU register.                                      */

        struct {
          __IOM uint8_t RAM_LU  : 8;            /*!< [7..0] RAM_LU stores the second 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM5LU_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM5HL;  /*!< (@ 0x00000016) CSE PRAM5HL register.                                      */

        struct {
          __IOM uint8_t RAM_HL  : 8;            /*!< [7..0] RAM_HL stores the third 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM5HL_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM5HU;  /*!< (@ 0x00000017) CSE PRAM5HU register.                                      */

        struct {
          __IOM uint8_t RAM_HU  : 8;            /*!< [7..0] RAM_HU stores the fourth 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM5HU_b;
      } ;
    };
  };

  union {
    union {
      __IOM uint32_t CSE_PRAM_EmbeddedRAM6_CSE_PRAM;/*!< (@ 0x00000018) CSE PRAM 6 Register                                    */

      struct {
        __IOM uint32_t BYTE_3   : 8;            /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
        __IOM uint32_t BYTE_2   : 8;            /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
        __IOM uint32_t BYTE_1   : 8;            /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
        __IOM uint32_t BYTE_0   : 8;            /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
      } CSE_PRAM_EmbeddedRAM6_CSE_PRAM_b;
    } ;

    struct {
      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM6LL_CSE_PRAM;/*!< (@ 0x00000018) CSE PRAM6LL register.                               */

        struct {
          __IOM uint8_t RAM_LL  : 8;            /*!< [7..0] RAM_LL stores the first 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM6LL_CSE_PRAM_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM6LU;  /*!< (@ 0x00000019) CSE PRAM6LU register.                                      */

        struct {
          __IOM uint8_t RAM_LU  : 8;            /*!< [7..0] RAM_LU stores the second 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM6LU_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM6HL;  /*!< (@ 0x0000001A) CSE PRAM6HL register.                                      */

        struct {
          __IOM uint8_t RAM_HL  : 8;            /*!< [7..0] RAM_HL stores the third 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM6HL_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM6HU;  /*!< (@ 0x0000001B) CSE PRAM6HU register.                                      */

        struct {
          __IOM uint8_t RAM_HU  : 8;            /*!< [7..0] RAM_HU stores the fourth 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM6HU_b;
      } ;
    };
  };

  union {
    union {
      __IOM uint32_t CSE_PRAM_EmbeddedRAM7_CSE_PRAM;/*!< (@ 0x0000001C) CSE PRAM 7 Register                                    */

      struct {
        __IOM uint32_t BYTE_3   : 8;            /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
        __IOM uint32_t BYTE_2   : 8;            /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
        __IOM uint32_t BYTE_1   : 8;            /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
        __IOM uint32_t BYTE_0   : 8;            /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
      } CSE_PRAM_EmbeddedRAM7_CSE_PRAM_b;
    } ;

