nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM16LL_CSE_PRAM;/*!< (@ 0x00000040) CSE PRAM16LL register.                             */

        struct {
          __IOM uint8_t RAM_LL  : 8;            /*!< [7..0] RAM_LL stores the first 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM16LL_CSE_PRAM_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM16LU; /*!< (@ 0x00000041) CSE PRAM16LU register.                                     */

        struct {
          __IOM uint8_t RAM_LU  : 8;            /*!< [7..0] RAM_LU stores the second 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM16LU_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM16HL; /*!< (@ 0x00000042) CSE PRAM16HL register.                                     */

        struct {
          __IOM uint8_t RAM_HL  : 8;            /*!< [7..0] RAM_HL stores the third 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM16HL_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM16HU; /*!< (@ 0x00000043) CSE PRAM16HU register.                                     */

        struct {
          __IOM uint8_t RAM_HU  : 8;            /*!< [7..0] RAM_HU stores the fourth 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM16HU_b;
      } ;
    };
  };

  union {
    union {
      __IOM uint32_t CSE_PRAM_EmbeddedRAM17_CSE_PRAM;/*!< (@ 0x00000044) CSE PRAM 17 Register                                  */

      struct {
        __IOM uint32_t BYTE_3   : 8;            /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
        __IOM uint32_t BYTE_2   : 8;            /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
        __IOM uint32_t BYTE_1   : 8;            /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
        __IOM uint32_t BYTE_0   : 8;            /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
      } CSE_PRAM_EmbeddedRAM17_CSE_PRAM_b;
    } ;

    struct {
      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM17LL_CSE_PRAM;/*!< (@ 0x00000044) CSE PRAM17LL register.                             */

        struct {
          __IOM uint8_t RAM_LL  : 8;            /*!< [7..0] RAM_LL stores the first 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM17LL_CSE_PRAM_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM17LU; /*!< (@ 0x00000045) CSE PRAM17LU register.                                     */

        struct {
          __IOM uint8_t RAM_LU  : 8;            /*!< [7..0] RAM_LU stores the second 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM17LU_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM17HL; /*!< (@ 0x00000046) CSE PRAM17HL register.                                     */

        struct {
          __IOM uint8_t RAM_HL  : 8;            /*!< [7..0] RAM_HL stores the third 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM17HL_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM17HU; /*!< (@ 0x00000047) CSE PRAM17HU register.                                     */

        struct {
          __IOM uint8_t RAM_HU  : 8;            /*!< [7..0] RAM_HU stores the fourth 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM17HU_b;
      } ;
    };
  };

  union {
    union {
      __IOM uint32_t CSE_PRAM_EmbeddedRAM18_CSE_PRAM;/*!< (@ 0x00000048) CSE PRAM 18 Register                                  */

      struct {
        __IOM uint32_t BYTE_3   : 8;            /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
        __IOM uint32_t BYTE_2   : 8;            /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
        __IOM uint32_t BYTE_1   : 8;            /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
        __IOM uint32_t BYTE_0   : 8;            /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
      } CSE_PRAM_EmbeddedRAM18_CSE_PRAM_b;
    } ;

    struct {
      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM18LL_CSE_PRAM;/*!< (@ 0x00000048) CSE PRAM18LL register.                             */

        struct {
          __IOM uint8_t RAM_LL  : 8;            /*!< [7..0] RAM_LL stores the first 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM18LL_CSE_PRAM_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM18LU; /*!< (@ 0x00000049) CSE PRAM18LU register.                                     */

        struct {
          __IOM uint8_t RAM_LU  : 8;            /*!< [7..0] RAM_LU stores the second 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM18LU_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM18HL; /*!< (@ 0x0000004A) CSE PRAM18HL register.                                     */

        struct {
          __IOM uint8_t RAM_HL  : 8;            /*!< [7..0] RAM_HL stores the third 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM18HL_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM18HU; /*!< (@ 0x0000004B) CSE PRAM18HU register.                                     */

        struct {
          __IOM uint8_t RAM_HU  : 8;            /*!< [7..0] RAM_HU stores the fourth 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM18HU_b;
      } ;
    };
  };

  union {
    union {
      __IOM uint32_t CSE_PRAM_EmbeddedRAM19_CSE_PRAM;/*!< (@ 0x0000004C) CSE PRAM 19 Register                                  */

      struct {
        __IOM uint32_t BYTE_3   : 8;            /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
        __IOM uint32_t BYTE_2   : 8;            /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
        __IOM uint32_t BYTE_1   : 8;            /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
        __IOM uint32_t BYTE_0   : 8;            /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
      } CSE_PRAM_EmbeddedRAM19_CSE_PRAM_b;
    } ;

