nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM22LL_CSE_PRAM;/*!< (@ 0x00000058) CSE PRAM22LL register.                             */

        struct {
          __IOM uint8_t RAM_LL  : 8;            /*!< [7..0] RAM_LL stores the first 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM22LL_CSE_PRAM_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM22LU; /*!< (@ 0x00000059) CSE PRAM22LU register.                                     */

        struct {
          __IOM uint8_t RAM_LU  : 8;            /*!< [7..0] RAM_LU stores the second 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM22LU_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM22HL; /*!< (@ 0x0000005A) CSE PRAM22HL register.                                     */

        struct {
          __IOM uint8_t RAM_HL  : 8;            /*!< [7..0] RAM_HL stores the third 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM22HL_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM22HU; /*!< (@ 0x0000005B) CSE PRAM22HU register.                                     */

        struct {
          __IOM uint8_t RAM_HU  : 8;            /*!< [7..0] RAM_HU stores the fourth 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM22HU_b;
      } ;
    };
  };

  union {
    union {
      __IOM uint32_t CSE_PRAM_EmbeddedRAM23_CSE_PRAM;/*!< (@ 0x0000005C) CSE PRAM 23 Register                                  */

      struct {
        __IOM uint32_t BYTE_3   : 8;            /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
        __IOM uint32_t BYTE_2   : 8;            /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
        __IOM uint32_t BYTE_1   : 8;            /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
        __IOM uint32_t BYTE_0   : 8;            /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
      } CSE_PRAM_EmbeddedRAM23_CSE_PRAM_b;
    } ;

    struct {
      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM23LL_CSE_PRAM;/*!< (@ 0x0000005C) CSE PRAM23LL register.                             */

        struct {
          __IOM uint8_t RAM_LL  : 8;            /*!< [7..0] RAM_LL stores the first 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM23LL_CSE_PRAM_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM23LU; /*!< (@ 0x0000005D) CSE PRAM23LU register.                                     */

        struct {
          __IOM uint8_t RAM_LU  : 8;            /*!< [7..0] RAM_LU stores the second 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM23LU_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM23HL; /*!< (@ 0x0000005E) CSE PRAM23HL register.                                     */

        struct {
          __IOM uint8_t RAM_HL  : 8;            /*!< [7..0] RAM_HL stores the third 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM23HL_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM23HU; /*!< (@ 0x0000005F) CSE PRAM23HU register.                                     */

        struct {
          __IOM uint8_t RAM_HU  : 8;            /*!< [7..0] RAM_HU stores the fourth 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM23HU_b;
      } ;
    };
  };

  union {
    union {
      __IOM uint32_t CSE_PRAM_EmbeddedRAM24_CSE_PRAM;/*!< (@ 0x00000060) CSE PRAM 24 Register                                  */

      struct {
        __IOM uint32_t BYTE_3   : 8;            /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
        __IOM uint32_t BYTE_2   : 8;            /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
        __IOM uint32_t BYTE_1   : 8;            /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
        __IOM uint32_t BYTE_0   : 8;            /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
      } CSE_PRAM_EmbeddedRAM24_CSE_PRAM_b;
    } ;

    struct {
      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM24LL_CSE_PRAM;/*!< (@ 0x00000060) CSE PRAM24LL register.                             */

        struct {
          __IOM uint8_t RAM_LL  : 8;            /*!< [7..0] RAM_LL stores the first 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM24LL_CSE_PRAM_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM24LU; /*!< (@ 0x00000061) CSE PRAM24LU register.                                     */

        struct {
          __IOM uint8_t RAM_LU  : 8;            /*!< [7..0] RAM_LU stores the second 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM24LU_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM24HL; /*!< (@ 0x00000062) CSE PRAM24HL register.                                     */

        struct {
          __IOM uint8_t RAM_HL  : 8;            /*!< [7..0] RAM_HL stores the third 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM24HL_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM24HU; /*!< (@ 0x00000063) CSE PRAM24HU register.                                     */

        struct {
          __IOM uint8_t RAM_HU  : 8;            /*!< [7..0] RAM_HU stores the fourth 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM24HU_b;
      } ;
    };
  };

  union {
    union {
      __IOM uint32_t CSE_PRAM_EmbeddedRAM25_CSE_PRAM;/*!< (@ 0x00000064) CSE PRAM 25 Register                                  */

      struct {
        __IOM uint32_t BYTE_3   : 8;            /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
        __IOM uint32_t BYTE_2   : 8;            /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
        __IOM uint32_t BYTE_1   : 8;            /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
        __IOM uint32_t BYTE_0   : 8;            /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
      } CSE_PRAM_EmbeddedRAM25_CSE_PRAM_b;
    } ;

