nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM31LL_CSE_PRAM;/*!< (@ 0x0000007C) CSE PRAM31LL register.                             */

        struct {
          __IOM uint8_t RAM_LL  : 8;            /*!< [7..0] RAM_LL stores the first 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM31LL_CSE_PRAM_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM31LU; /*!< (@ 0x0000007D) CSE PRAM31LU register.                                     */

        struct {
          __IOM uint8_t RAM_LU  : 8;            /*!< [7..0] RAM_LU stores the second 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM31LU_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM31HL; /*!< (@ 0x0000007E) CSE PRAM31HL register.                                     */

        struct {
          __IOM uint8_t RAM_HL  : 8;            /*!< [7..0] RAM_HL stores the third 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM31HL_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM31HU; /*!< (@ 0x0000007F) CSE PRAM31HU register.                                     */

        struct {
          __IOM uint8_t RAM_HU  : 8;            /*!< [7..0] RAM_HU stores the fourth 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM31HU_b;
      } ;
    };
  };
} CSE_PRAM_Type;                                /*!< Size = 128 (0x80)                                                         */



/* =========================================================================================================================== */
/* ================                                           AIPS                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief AIPS-Lite Bridge (AIPS)
  */

typedef struct {                                /*!< (@ 0x40000000) AIPS Structure                                             */

  union {
    __IOM uint32_t AIPS_MPRA;                   /*!< (@ 0x00000000) Master Privilege Register A                                */

    struct {
            uint32_t            : 20;
      __IOM uint32_t MPL2       : 1;            /*!< [20..20] Master 2 Privilege Level                                         */
      __IOM uint32_t MTW2       : 1;            /*!< [21..21] Master 2 Trusted For Writes                                      */
      __IOM uint32_t MTR2       : 1;            /*!< [22..22] Master 2 Trusted For Read                                        */
            uint32_t            : 1;
      __IOM uint32_t MPL1       : 1;            /*!< [24..24] Master 1 Privilege Level                                         */
      __IOM uint32_t MTW1       : 1;            /*!< [25..25] Master 1 Trusted for Writes                                      */
      __IOM uint32_t MTR1       : 1;            /*!< [26..26] Master 1 Trusted for Read                                        */
            uint32_t            : 1;
      __IOM uint32_t MPL0       : 1;            /*!< [28..28] Master 0 Privilege Level                                         */
      __IOM uint32_t MTW0       : 1;            /*!< [29..29] Master 0 Trusted For Writes                                      */
      __IOM uint32_t MTR0       : 1;            /*!< [30..30] Master 0 Trusted For Read                                        */
            uint32_t            : 1;
    } AIPS_MPRA_b;
  } ;
  __IM  uint32_t  RESERVED[7];

  union {
    __IOM uint32_t AIPS_PACRA;                  /*!< (@ 0x00000020) Peripheral Access Control Register                         */

    struct {
            uint32_t            : 24;
      __IOM uint32_t TP1        : 1;            /*!< [24..24] Trusted Protect                                                  */
      __IOM uint32_t WP1        : 1;            /*!< [25..25] Write Protect                                                    */
      __IOM uint32_t SP1        : 1;            /*!< [26..26] Supervisor Protect                                               */
            uint32_t            : 1;
      __IOM uint32_t TP0        : 1;            /*!< [28..28] Trusted Protect                                                  */
      __IOM uint32_t WP0        : 1;            /*!< [29..29] Write Protect                                                    */
      __IOM uint32_t SP0        : 1;            /*!< [30..30] Supervisor Protect                                               */
            uint32_t            : 1;
    } AIPS_PACRA_b;
  } ;

  union {
    __IOM uint32_t AIPS_PACRB;                  /*!< (@ 0x00000024) Peripheral Access Control Register                         */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TP5        : 1;            /*!< [8..8] Trusted Protect                                                    */
      __IOM uint32_t WP5        : 1;            /*!< [9..9] Write Protect                                                      */
      __IOM uint32_t SP5        : 1;            /*!< [10..10] Supervisor Protect                                               */
            uint32_t            : 13;
      __IOM uint32_t TP1        : 1;            /*!< [24..24] Trusted Protect                                                  */
      __IOM uint32_t WP1        : 1;            /*!< [25..25] Write Protect                                                    */
      __IOM uint32_t SP1        : 1;            /*!< [26..26] Supervisor Protect                                               */
            uint32_t            : 1;
      __IOM uint32_t TP0        : 1;            /*!< [28..28] Trusted Protect                                                  */
      __IOM uint32_t WP0        : 1;            /*!< [29..29] Write Protect                                                    */
      __IOM uint32_t SP0        : 1;            /*!< [30..30] Supervisor Protect                                               */
            uint32_t            : 1;
    } AIPS_PACRB_b;
  } ;
  __IM  uint32_t  AIPS_PACRC;                   /*!< (@ 0x00000028) Peripheral Access Control Register                         */

  union {
    __IOM uint32_t AIPS_PACRD;                  /*!< (@ 0x0000002C) Peripheral Access Control Register                         */

