nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
            uint32_t            : 20;
      __IOM uint32_t TP2        : 1;            /*!< [20..20] Trusted Protect                                                  */
      __IOM uint32_t WP2        : 1;            /*!< [21..21] Write Protect                                                    */
      __IOM uint32_t SP2        : 1;            /*!< [22..22] Supervisor Protect                                               */
            uint32_t            : 9;
    } AIPS_OPACRG_b;
  } ;

  union {
    __IOM uint32_t AIPS_OPACRH;                 /*!< (@ 0x0000005C) Off-Platform Peripheral Access Control Register            */

    struct {
            uint32_t            : 20;
      __IOM uint32_t TP2        : 1;            /*!< [20..20] Trusted Protect                                                  */
      __IOM uint32_t WP2        : 1;            /*!< [21..21] Write Protect                                                    */
      __IOM uint32_t SP2        : 1;            /*!< [22..22] Supervisor Protect                                               */
            uint32_t            : 9;
    } AIPS_OPACRH_b;
  } ;

  union {
    __IOM uint32_t AIPS_OPACRI;                 /*!< (@ 0x00000060) Off-Platform Peripheral Access Control Register            */

    struct {
            uint32_t            : 4;
      __IOM uint32_t TP6        : 1;            /*!< [4..4] Trusted Protect                                                    */
      __IOM uint32_t WP6        : 1;            /*!< [5..5] Write Protect                                                      */
      __IOM uint32_t SP6        : 1;            /*!< [6..6] Supervisor Protect                                                 */
            uint32_t            : 1;
      __IOM uint32_t TP5        : 1;            /*!< [8..8] Trusted Protect                                                    */
      __IOM uint32_t WP5        : 1;            /*!< [9..9] Write Protect                                                      */
      __IOM uint32_t SP5        : 1;            /*!< [10..10] Supervisor Protect                                               */
            uint32_t            : 1;
      __IOM uint32_t TP4        : 1;            /*!< [12..12] Trusted Protect                                                  */
      __IOM uint32_t WP4        : 1;            /*!< [13..13] Write Protect                                                    */
      __IOM uint32_t SP4        : 1;            /*!< [14..14] Supervisor Protect                                               */
            uint32_t            : 1;
      __IOM uint32_t TP3        : 1;            /*!< [16..16] Trusted Protect                                                  */
      __IOM uint32_t WP3        : 1;            /*!< [17..17] Write Protect                                                    */
      __IOM uint32_t SP3        : 1;            /*!< [18..18] Supervisor Protect                                               */
            uint32_t            : 5;
      __IOM uint32_t TP1        : 1;            /*!< [24..24] Trusted Protect                                                  */
      __IOM uint32_t WP1        : 1;            /*!< [25..25] Write Protect                                                    */
      __IOM uint32_t SP1        : 1;            /*!< [26..26] Supervisor Protect                                               */
            uint32_t            : 5;
    } AIPS_OPACRI_b;
  } ;

  union {
    __IOM uint32_t AIPS_OPACRJ;                 /*!< (@ 0x00000064) Off-Platform Peripheral Access Control Register            */

    struct {
            uint32_t            : 12;
      __IOM uint32_t TP4        : 1;            /*!< [12..12] Trusted Protect                                                  */
      __IOM uint32_t WP4        : 1;            /*!< [13..13] Write Protect                                                    */
      __IOM uint32_t SP4        : 1;            /*!< [14..14] Supervisor Protect                                               */
            uint32_t            : 1;
      __IOM uint32_t TP3        : 1;            /*!< [16..16] Trusted Protect                                                  */
      __IOM uint32_t WP3        : 1;            /*!< [17..17] Write Protect                                                    */
      __IOM uint32_t SP3        : 1;            /*!< [18..18] Supervisor Protect                                               */
            uint32_t            : 1;
      __IOM uint32_t TP2        : 1;            /*!< [20..20] Trusted Protect                                                  */
      __IOM uint32_t WP2        : 1;            /*!< [21..21] Write Protect                                                    */
      __IOM uint32_t SP2        : 1;            /*!< [22..22] Supervisor Protect                                               */
            uint32_t            : 9;
    } AIPS_OPACRJ_b;
  } ;

  union {
    __IOM uint32_t AIPS_OPACRK;                 /*!< (@ 0x00000068) Off-Platform Peripheral Access Control Register            */

    struct {
            uint32_t            : 16;
      __IOM uint32_t TP3        : 1;            /*!< [16..16] Trusted Protect                                                  */
      __IOM uint32_t WP3        : 1;            /*!< [17..17] Write Protect                                                    */
      __IOM uint32_t SP3        : 1;            /*!< [18..18] Supervisor Protect                                               */
            uint32_t            : 13;
    } AIPS_OPACRK_b;
  } ;

  union {
    __IOM uint32_t AIPS_OPACRL;                 /*!< (@ 0x0000006C) Off-Platform Peripheral Access Control Register            */

    struct {
      __IOM uint32_t TP7        : 1;            /*!< [0..0] Trusted Protect                                                    */
      __IOM uint32_t WP7        : 1;            /*!< [1..1] Write Protect                                                      */
      __IOM uint32_t SP7        : 1;            /*!< [2..2] Supervisor Protect                                                 */
            uint32_t            : 1;
      __IOM uint32_t TP6        : 1;            /*!< [4..4] Trusted Protect                                                    */
      __IOM uint32_t WP6        : 1;            /*!< [5..5] Write Protect                                                      */
      __IOM uint32_t SP6        : 1;            /*!< [6..6] Supervisor Protect                                                 */
            uint32_t            : 1;
      __IOM uint32_t TP5        : 1;            /*!< [8..8] Trusted Protect                                                    */
      __IOM uint32_t WP5        : 1;            /*!< [9..9] Write Protect                                                      */
      __IOM uint32_t SP5        : 1;            /*!< [10..10] Supervisor Protect                                               */
            uint32_t            : 21;
    } AIPS_OPACRL_b;
  } ;
} AIPS_Type;                                    /*!< Size = 112 (0x70)                                                         */



/* =========================================================================================================================== */
/* ================                                           MSCM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief MSCM (MSCM)
  */

typedef struct {                                /*!< (@ 0x40001000) MSCM Structure                                             */

  union {
    __IM  uint32_t MSCM_CPxTYPE;                /*!< (@ 0x00000000) Processor X Type Register                                  */

