nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint32_t RYPZ       : 8;            /*!< [7..0] Processor x Revision                                               */
      __IM  uint32_t PERSONALITY : 24;          /*!< [31..8] Processor x Personality                                           */
    } MSCM_CPxTYPE_b;
  } ;

  union {
    __IM  uint32_t MSCM_CPxNUM;                 /*!< (@ 0x00000004) Processor X Number Register                                */

    struct {
      __IM  uint32_t CPN        : 1;            /*!< [0..0] Processor x Number                                                 */
            uint32_t            : 31;
    } MSCM_CPxNUM_b;
  } ;

  union {
    __IM  uint32_t MSCM_CPxMASTER;              /*!< (@ 0x00000008) Processor X Master Register                                */

    struct {
      __IM  uint32_t PPMN       : 6;            /*!< [5..0] Processor x Physical Master Number                                 */
            uint32_t            : 26;
    } MSCM_CPxMASTER_b;
  } ;

  union {
    __IM  uint32_t MSCM_CPxCOUNT;               /*!< (@ 0x0000000C) Processor X Count Register                                 */

    struct {
      __IM  uint32_t PCNT       : 2;            /*!< [1..0] Processor Count                                                    */
            uint32_t            : 30;
    } MSCM_CPxCOUNT_b;
  } ;

  union {
    __IM  uint32_t MSCM_CPxCFG0;                /*!< (@ 0x00000010) Processor X Configuration Register 0                       */

    struct {
      __IM  uint32_t DCWY       : 8;            /*!< [7..0] Level 1 Data Cache Ways                                            */
      __IM  uint32_t DCSZ       : 8;            /*!< [15..8] Level 1 Data Cache Size                                           */
      __IM  uint32_t ICWY       : 8;            /*!< [23..16] Level 1 Instruction Cache Ways                                   */
      __IM  uint32_t ICSZ       : 8;            /*!< [31..24] Level 1 Instruction Cache Size                                   */
    } MSCM_CPxCFG0_b;
  } ;

  union {
    __IM  uint32_t MSCM_CPxCFG1;                /*!< (@ 0x00000014) Processor X Configuration Register 1                       */

    struct {
            uint32_t            : 16;
      __IM  uint32_t L2WY       : 8;            /*!< [23..16] Level 2 Instruction Cache Ways                                   */
      __IM  uint32_t L2SZ       : 8;            /*!< [31..24] Level 2 Instruction Cache Size                                   */
    } MSCM_CPxCFG1_b;
  } ;

  union {
    __IM  uint32_t MSCM_CPxCFG2;                /*!< (@ 0x00000018) Processor X Configuration Register 2                       */

    struct {
            uint32_t            : 8;
      __IM  uint32_t TMUSZ      : 8;            /*!< [15..8] Tightly-coupled Memory Upper Size                                 */
            uint32_t            : 8;
      __IM  uint32_t TMLSZ      : 8;            /*!< [31..24] Tightly-coupled Memory Lower Size                                */
    } MSCM_CPxCFG2_b;
  } ;

  union {
    __IM  uint32_t MSCM_CPxCFG3;                /*!< (@ 0x0000001C) Processor X Configuration Register 3                       */

    struct {
      __IM  uint32_t FPU        : 1;            /*!< [0..0] Floating Point Unit                                                */
      __IM  uint32_t SIMD       : 1;            /*!< [1..1] SIMD/NEON instruction support                                      */
      __IM  uint32_t JAZ        : 1;            /*!< [2..2] Jazelle support                                                    */
      __IM  uint32_t MMU        : 1;            /*!< [3..3] Memory Management Unit                                             */
      __IM  uint32_t TZ         : 1;            /*!< [4..4] Trust Zone                                                         */
      __IM  uint32_t CMP        : 1;            /*!< [5..5] Core Memory Protection unit                                        */
      __IM  uint32_t BB         : 1;            /*!< [6..6] Bit Banding                                                        */
            uint32_t            : 1;
      __IM  uint32_t SBP        : 2;            /*!< [9..8] System Bus Ports                                                   */
            uint32_t            : 22;
    } MSCM_CPxCFG3_b;
  } ;

  union {
    __IM  uint32_t MSCM_CP0TYPE;                /*!< (@ 0x00000020) Processor 0 Type Register                                  */

    struct {
      __IM  uint32_t RYPZ       : 8;            /*!< [7..0] Processor 0 Revision                                               */
      __IM  uint32_t PERSONALITY : 24;          /*!< [31..8] Processor 0 Personality                                           */
    } MSCM_CP0TYPE_b;
  } ;

  union {
    __IM  uint32_t MSCM_CP0NUM;                 /*!< (@ 0x00000024) Processor 0 Number Register                                */

    struct {
      __IM  uint32_t CPN        : 1;            /*!< [0..0] Processor 0 Number                                                 */
            uint32_t            : 31;
    } MSCM_CP0NUM_b;
  } ;

  union {
    __IM  uint32_t MSCM_CP0MASTER;              /*!< (@ 0x00000028) Processor 0 Master Register                                */

    struct {
      __IM  uint32_t PPMN       : 6;            /*!< [5..0] Processor 0 Physical Master Number                                 */
            uint32_t            : 26;
    } MSCM_CP0MASTER_b;
  } ;

  union {
    __IM  uint32_t MSCM_CP0COUNT;               /*!< (@ 0x0000002C) Processor 0 Count Register                                 */

    struct {
      __IM  uint32_t PCNT       : 2;            /*!< [1..0] Processor Count                                                    */
            uint32_t            : 30;
    } MSCM_CP0COUNT_b;
  } ;

  union {
    __IM  uint32_t MSCM_CP0CFG0;                /*!< (@ 0x00000030) Processor 0 Configuration Register 0                       */

    struct {
      __IM  uint32_t DCWY       : 8;            /*!< [7..0] Level 1 Data Cache Ways                                            */
      __IM  uint32_t DCSZ       : 8;            /*!< [15..8] Level 1 Data Cache Size                                           */
      __IM  uint32_t ICWY       : 8;            /*!< [23..16] Level 1 Instruction Cache Ways                                   */
      __IM  uint32_t ICSZ       : 8;            /*!< [31..24] Level 1 Instruction Cache Size                                   */
    } MSCM_CP0CFG0_b;
  } ;

  union {
    __IM  uint32_t MSCM_CP0CFG1;                /*!< (@ 0x00000034) Processor 0 Configuration Register 1                       */

