nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
            uint32_t            : 1;
      __IOM uint32_t EDBG       : 1;            /*!< [1..1] Enable Debug                                                       */
      __IOM uint32_t ERCA       : 1;            /*!< [2..2] Enable Round Robin Channel Arbitration                             */
            uint32_t            : 1;
      __IOM uint32_t HOE        : 1;            /*!< [4..4] Halt On Error                                                      */
      __IOM uint32_t HALT       : 1;            /*!< [5..5] Halt DMA Operations                                                */
      __IOM uint32_t CLM        : 1;            /*!< [6..6] Continuous Link Mode                                               */
      __IOM uint32_t EMLM       : 1;            /*!< [7..7] Enable Minor Loop Mapping                                          */
            uint32_t            : 8;
      __IOM uint32_t ECX        : 1;            /*!< [16..16] Error Cancel Transfer                                            */
      __IOM uint32_t CX         : 1;            /*!< [17..17] Cancel Transfer                                                  */
            uint32_t            : 13;
      __IM  uint32_t ACTIVE     : 1;            /*!< [31..31] DMA Active Status                                                */
    } DMA_CR_b;
  } ;

  union {
    __IM  uint32_t DMA_ES;                      /*!< (@ 0x00000004) Error Status Register                                      */

    struct {
      __IM  uint32_t DBE        : 1;            /*!< [0..0] Destination Bus Error                                              */
      __IM  uint32_t SBE        : 1;            /*!< [1..1] Source Bus Error                                                   */
      __IM  uint32_t SGE        : 1;            /*!< [2..2] Scatter/Gather Configuration Error                                 */
      __IM  uint32_t NCE        : 1;            /*!< [3..3] NBYTES/CITER Configuration Error                                   */
      __IM  uint32_t DOE        : 1;            /*!< [4..4] Destination Offset Error                                           */
      __IM  uint32_t DAE        : 1;            /*!< [5..5] Destination Address Error                                          */
      __IM  uint32_t SOE        : 1;            /*!< [6..6] Source Offset Error                                                */
      __IM  uint32_t SAE        : 1;            /*!< [7..7] Source Address Error                                               */
      __IM  uint32_t ERRCHN     : 4;            /*!< [11..8] Error Channel Number or Canceled Channel Number                   */
            uint32_t            : 2;
      __IM  uint32_t CPE        : 1;            /*!< [14..14] Channel Priority Error                                           */
            uint32_t            : 1;
      __IM  uint32_t ECX        : 1;            /*!< [16..16] Transfer Canceled                                                */
            uint32_t            : 14;
      __IM  uint32_t VLD        : 1;            /*!< [31..31] VLD                                                              */
    } DMA_ES_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t DMA_ERQ;                     /*!< (@ 0x0000000C) Enable Request Register                                    */

    struct {
      __IOM uint32_t ERQ0       : 1;            /*!< [0..0] Enable DMA Request 0                                               */
      __IOM uint32_t ERQ1       : 1;            /*!< [1..1] Enable DMA Request 1                                               */
      __IOM uint32_t ERQ2       : 1;            /*!< [2..2] Enable DMA Request 2                                               */
      __IOM uint32_t ERQ3       : 1;            /*!< [3..3] Enable DMA Request 3                                               */
      __IOM uint32_t ERQ4       : 1;            /*!< [4..4] Enable DMA Request 4                                               */
      __IOM uint32_t ERQ5       : 1;            /*!< [5..5] Enable DMA Request 5                                               */
      __IOM uint32_t ERQ6       : 1;            /*!< [6..6] Enable DMA Request 6                                               */
      __IOM uint32_t ERQ7       : 1;            /*!< [7..7] Enable DMA Request 7                                               */
      __IOM uint32_t ERQ8       : 1;            /*!< [8..8] Enable DMA Request 8                                               */
      __IOM uint32_t ERQ9       : 1;            /*!< [9..9] Enable DMA Request 9                                               */
      __IOM uint32_t ERQ10      : 1;            /*!< [10..10] Enable DMA Request 10                                            */
      __IOM uint32_t ERQ11      : 1;            /*!< [11..11] Enable DMA Request 11                                            */
      __IOM uint32_t ERQ12      : 1;            /*!< [12..12] Enable DMA Request 12                                            */
      __IOM uint32_t ERQ13      : 1;            /*!< [13..13] Enable DMA Request 13                                            */
      __IOM uint32_t ERQ14      : 1;            /*!< [14..14] Enable DMA Request 14                                            */
      __IOM uint32_t ERQ15      : 1;            /*!< [15..15] Enable DMA Request 15                                            */
            uint32_t            : 16;
    } DMA_ERQ_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t DMA_EEI;                     /*!< (@ 0x00000014) Enable Error Interrupt Register                            */

    struct {
      __IOM uint32_t EEI0       : 1;            /*!< [0..0] Enable Error Interrupt 0                                           */
      __IOM uint32_t EEI1       : 1;            /*!< [1..1] Enable Error Interrupt 1                                           */
      __IOM uint32_t EEI2       : 1;            /*!< [2..2] Enable Error Interrupt 2                                           */
      __IOM uint32_t EEI3       : 1;            /*!< [3..3] Enable Error Interrupt 3                                           */
      __IOM uint32_t EEI4       : 1;            /*!< [4..4] Enable Error Interrupt 4                                           */
      __IOM uint32_t EEI5       : 1;            /*!< [5..5] Enable Error Interrupt 5                                           */
      __IOM uint32_t EEI6       : 1;            /*!< [6..6] Enable Error Interrupt 6                                           */
      __IOM uint32_t EEI7       : 1;            /*!< [7..7] Enable Error Interrupt 7                                           */
      __IOM uint32_t EEI8       : 1;            /*!< [8..8] Enable Error Interrupt 8                                           */
      __IOM uint32_t EEI9       : 1;            /*!< [9..9] Enable Error Interrupt 9                                           */
      __IOM uint32_t EEI10      : 1;            /*!< [10..10] Enable Error Interrupt 10                                        */
      __IOM uint32_t EEI11      : 1;            /*!< [11..11] Enable Error Interrupt 11                                        */
      __IOM uint32_t EEI12      : 1;            /*!< [12..12] Enable Error Interrupt 12                                        */
      __IOM uint32_t EEI13      : 1;            /*!< [13..13] Enable Error Interrupt 13                                        */
      __IOM uint32_t EEI14      : 1;            /*!< [14..14] Enable Error Interrupt 14                                        */
      __IOM uint32_t EEI15      : 1;            /*!< [15..15] Enable Error Interrupt 15                                        */
            uint32_t            : 16;
    } DMA_EEI_b;
  } ;

  union {
    __OM  uint8_t DMA_CEEI;                     /*!< (@ 0x00000018) Clear Enable Error Interrupt Register                      */

