nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __OM  uint8_t CEEI        : 4;            /*!< [3..0] Clear Enable Error Interrupt                                       */
            uint8_t             : 2;
      __OM  uint8_t CAEE        : 1;            /*!< [6..6] Clear All Enable Error Interrupts                                  */
      __OM  uint8_t NOP         : 1;            /*!< [7..7] No Op enable                                                       */
    } DMA_CEEI_b;
  } ;

  union {
    __OM  uint8_t DMA_SEEI;                     /*!< (@ 0x00000019) Set Enable Error Interrupt Register                        */

    struct {
      __OM  uint8_t SEEI        : 4;            /*!< [3..0] Set Enable Error Interrupt                                         */
            uint8_t             : 2;
      __OM  uint8_t SAEE        : 1;            /*!< [6..6] Sets All Enable Error Interrupts                                   */
      __OM  uint8_t NOP         : 1;            /*!< [7..7] No Op enable                                                       */
    } DMA_SEEI_b;
  } ;

  union {
    __OM  uint8_t DMA_CERQ;                     /*!< (@ 0x0000001A) Clear Enable Request Register                              */

    struct {
      __OM  uint8_t CERQ        : 4;            /*!< [3..0] Clear Enable Request                                               */
            uint8_t             : 2;
      __OM  uint8_t CAER        : 1;            /*!< [6..6] Clear All Enable Requests                                          */
      __OM  uint8_t NOP         : 1;            /*!< [7..7] No Op enable                                                       */
    } DMA_CERQ_b;
  } ;

  union {
    __OM  uint8_t DMA_SERQ;                     /*!< (@ 0x0000001B) Set Enable Request Register                                */

    struct {
      __OM  uint8_t SERQ        : 4;            /*!< [3..0] Set Enable Request                                                 */
            uint8_t             : 2;
      __OM  uint8_t SAER        : 1;            /*!< [6..6] Set All Enable Requests                                            */
      __OM  uint8_t NOP         : 1;            /*!< [7..7] No Op enable                                                       */
    } DMA_SERQ_b;
  } ;

  union {
    __OM  uint8_t DMA_CDNE;                     /*!< (@ 0x0000001C) Clear DONE Status Bit Register                             */

    struct {
      __OM  uint8_t CDNE        : 4;            /*!< [3..0] Clear DONE Bit                                                     */
            uint8_t             : 2;
      __OM  uint8_t CADN        : 1;            /*!< [6..6] Clears All DONE Bits                                               */
      __OM  uint8_t NOP         : 1;            /*!< [7..7] No Op enable                                                       */
    } DMA_CDNE_b;
  } ;

  union {
    __OM  uint8_t DMA_SSRT;                     /*!< (@ 0x0000001D) Set START Bit Register                                     */

    struct {
      __OM  uint8_t SSRT        : 4;            /*!< [3..0] Set START Bit                                                      */
            uint8_t             : 2;
      __OM  uint8_t SAST        : 1;            /*!< [6..6] Set All START Bits (activates all channels)                        */
      __OM  uint8_t NOP         : 1;            /*!< [7..7] No Op enable                                                       */
    } DMA_SSRT_b;
  } ;

  union {
    __OM  uint8_t DMA_CERR;                     /*!< (@ 0x0000001E) Clear Error Register                                       */

    struct {
      __OM  uint8_t CERR        : 4;            /*!< [3..0] Clear Error Indicator                                              */
            uint8_t             : 2;
      __OM  uint8_t CAEI        : 1;            /*!< [6..6] Clear All Error Indicators                                         */
      __OM  uint8_t NOP         : 1;            /*!< [7..7] No Op enable                                                       */
    } DMA_CERR_b;
  } ;

  union {
    __OM  uint8_t DMA_CINT;                     /*!< (@ 0x0000001F) Clear Interrupt Request Register                           */

    struct {
      __OM  uint8_t CINT        : 4;            /*!< [3..0] Clear Interrupt Request                                            */
            uint8_t             : 2;
      __OM  uint8_t CAIR        : 1;            /*!< [6..6] Clear All Interrupt Requests                                       */
      __OM  uint8_t NOP         : 1;            /*!< [7..7] No Op enable                                                       */
    } DMA_CINT_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t DMA_INT;                     /*!< (@ 0x00000024) Interrupt Request Register                                 */

    struct {
      __IOM uint32_t INT0       : 1;            /*!< [0..0] Interrupt Request 0                                                */
      __IOM uint32_t INT1       : 1;            /*!< [1..1] Interrupt Request 1                                                */
      __IOM uint32_t INT2       : 1;            /*!< [2..2] Interrupt Request 2                                                */
      __IOM uint32_t INT3       : 1;            /*!< [3..3] Interrupt Request 3                                                */
      __IOM uint32_t INT4       : 1;            /*!< [4..4] Interrupt Request 4                                                */
      __IOM uint32_t INT5       : 1;            /*!< [5..5] Interrupt Request 5                                                */
      __IOM uint32_t INT6       : 1;            /*!< [6..6] Interrupt Request 6                                                */
      __IOM uint32_t INT7       : 1;            /*!< [7..7] Interrupt Request 7                                                */
      __IOM uint32_t INT8       : 1;            /*!< [8..8] Interrupt Request 8                                                */
      __IOM uint32_t INT9       : 1;            /*!< [9..9] Interrupt Request 9                                                */
      __IOM uint32_t INT10      : 1;            /*!< [10..10] Interrupt Request 10                                             */
      __IOM uint32_t INT11      : 1;            /*!< [11..11] Interrupt Request 11                                             */
      __IOM uint32_t INT12      : 1;            /*!< [12..12] Interrupt Request 12                                             */
      __IOM uint32_t INT13      : 1;            /*!< [13..13] Interrupt Request 13                                             */
      __IOM uint32_t INT14      : 1;            /*!< [14..14] Interrupt Request 14                                             */
      __IOM uint32_t INT15      : 1;            /*!< [15..15] Interrupt Request 15                                             */
            uint32_t            : 16;
    } DMA_INT_b;
  } ;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t DMA_ERR;                     /*!< (@ 0x0000002C) Error Register                                             */

