nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
      struct {
        __IOM uint32_t NBYTES   : 32;           /*!< [31..0] Minor Byte Transfer Count                                         */
      } DMA_TCD1_NBYTES_MLNO_DMA_b;
    } ;

    union {
      __IOM uint32_t DMA_TCD1_NBYTES_MLOFFNO_DMA;/*!< (@ 0x00001028) TCD Signed Minor Loop Offset (Minor Loop Mapping
                                                                    Enabled and Offset Disabled)                               */

      struct {
        __IOM uint32_t NBYTES   : 30;           /*!< [29..0] Minor Byte Transfer Count                                         */
        __IOM uint32_t DMLOE    : 1;            /*!< [30..30] Destination Minor Loop Offset enable                             */
        __IOM uint32_t SMLOE    : 1;            /*!< [31..31] Source Minor Loop Offset Enable                                  */
      } DMA_TCD1_NBYTES_MLOFFNO_DMA_b;
    } ;

    union {
      __IOM uint32_t DMA_TCD1_NBYTES_MLOFFYES_DMA;/*!< (@ 0x00001028) TCD Signed Minor Loop Offset (Minor Loop Mapping
                                                                    and Offset Enabled)                                        */

      struct {
        __IOM uint32_t NBYTES   : 10;           /*!< [9..0] Minor Byte Transfer Count                                          */
        __IOM uint32_t MLOFF    : 20;           /*!< [29..10] If SMLOE or DMLOE is set, this field represents a sign-extended
                                                     offset applied to the source or destination address to
                                                     form the next-state value after the minor loop completes.                 */
        __IOM uint32_t DMLOE    : 1;            /*!< [30..30] Destination Minor Loop Offset enable                             */
        __IOM uint32_t SMLOE    : 1;            /*!< [31..31] Source Minor Loop Offset Enable                                  */
      } DMA_TCD1_NBYTES_MLOFFYES_DMA_b;
    } ;
  };

  union {
    __IOM uint32_t DMA_TCD1_SLAST;              /*!< (@ 0x0000102C) TCD Last Source Address Adjustment                         */

    struct {
      __IOM uint32_t SLAST      : 32;           /*!< [31..0] Last Source Address Adjustment                                    */
    } DMA_TCD1_SLAST_b;
  } ;

  union {
    __IOM uint32_t DMA_TCD1_DADDR;              /*!< (@ 0x00001030) TCD Destination Address                                    */

    struct {
      __IOM uint32_t DADDR      : 32;           /*!< [31..0] Destination Address                                               */
    } DMA_TCD1_DADDR_b;
  } ;

  union {
    __IOM uint16_t DMA_TCD1_DOFF;               /*!< (@ 0x00001034) TCD Signed Destination Address Offset                      */

    struct {
      __IOM uint16_t DOFF       : 16;           /*!< [15..0] Destination Address Signed Offset                                 */
    } DMA_TCD1_DOFF_b;
  } ;

  union {
    union {
      __IOM uint16_t DMA_TCD1_CITER_ELINKNO_DMA;/*!< (@ 0x00001036) TCD Current Minor Loop Link, Major Loop Count
                                                                    (Channel Linking Disabled)                                 */

      struct {
        __IOM uint16_t CITER    : 15;           /*!< [14..0] Current Major Iteration Count                                     */
        __IOM uint16_t ELINK    : 1;            /*!< [15..15] Enable channel-to-channel linking on minor-loop complete         */
      } DMA_TCD1_CITER_ELINKNO_DMA_b;
    } ;

    union {
      __IOM uint16_t DMA_TCD1_CITER_ELINKYES_DMA;/*!< (@ 0x00001036) TCD Current Minor Loop Link, Major Loop Count
                                                                    (Channel Linking Enabled)                                  */

      struct {
        __IOM uint16_t CITER_LE : 9;            /*!< [8..0] Current Major Iteration Count                                      */
        __IOM uint16_t LINKCH   : 4;            /*!< [12..9] Minor Loop Link Channel Number                                    */
              uint16_t          : 2;
        __IOM uint16_t ELINK    : 1;            /*!< [15..15] Enable channel-to-channel linking on minor-loop complete         */
      } DMA_TCD1_CITER_ELINKYES_DMA_b;
    } ;
  };

  union {
    __IOM uint32_t DMA_TCD1_DLASTSGA;           /*!< (@ 0x00001038) TCD Last Destination Address Adjustment/Scatter
                                                                    Gather Address                                             */

    struct {
      __IOM uint32_t DLASTSGA   : 32;           /*!< [31..0] DLASTSGA                                                          */
    } DMA_TCD1_DLASTSGA_b;
  } ;

  union {
    __IOM uint16_t DMA_TCD1_CSR;                /*!< (@ 0x0000103C) TCD Control and Status                                     */

    struct {
      __IOM uint16_t START      : 1;            /*!< [0..0] Channel Start                                                      */
      __IOM uint16_t INTMAJOR   : 1;            /*!< [1..1] Enable an interrupt when major iteration count completes.          */
      __IOM uint16_t INTHALF    : 1;            /*!< [2..2] Enable an interrupt when major counter is half complete.           */
      __IOM uint16_t DREQ       : 1;            /*!< [3..3] Disable Request                                                    */
      __IOM uint16_t ESG        : 1;            /*!< [4..4] Enable Scatter/Gather Processing                                   */
      __IOM uint16_t MAJORELINK : 1;            /*!< [5..5] Enable channel-to-channel linking on major loop complete           */
      __IOM uint16_t ACTIVE     : 1;            /*!< [6..6] Channel Active                                                     */
      __IOM uint16_t DONE       : 1;            /*!< [7..7] Channel Done                                                       */
      __IOM uint16_t MAJORLINKCH : 4;           /*!< [11..8] Major Loop Link Channel Number                                    */
            uint16_t            : 2;
      __IOM uint16_t BWC        : 2;            /*!< [15..14] Bandwidth Control                                                */
    } DMA_TCD1_CSR_b;
  } ;

  union {
    union {
      __IOM uint16_t DMA_TCD1_BITER_ELINKNO_DMA;/*!< (@ 0x0000103E) TCD Beginning Minor Loop Link, Major Loop Count
                                                                    (Channel Linking Disabled)                                 */

