nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
      struct {
        __IOM uint16_t CITER_LE : 9;            /*!< [8..0] Current Major Iteration Count                                      */
        __IOM uint16_t LINKCH   : 4;            /*!< [12..9] Minor Loop Link Channel Number                                    */
              uint16_t          : 2;
        __IOM uint16_t ELINK    : 1;            /*!< [15..15] Enable channel-to-channel linking on minor-loop complete         */
      } DMA_TCD2_CITER_ELINKYES_DMA_b;
    } ;
  };

  union {
    __IOM uint32_t DMA_TCD2_DLASTSGA;           /*!< (@ 0x00001058) TCD Last Destination Address Adjustment/Scatter
                                                                    Gather Address                                             */

    struct {
      __IOM uint32_t DLASTSGA   : 32;           /*!< [31..0] DLASTSGA                                                          */
    } DMA_TCD2_DLASTSGA_b;
  } ;

  union {
    __IOM uint16_t DMA_TCD2_CSR;                /*!< (@ 0x0000105C) TCD Control and Status                                     */

    struct {
      __IOM uint16_t START      : 1;            /*!< [0..0] Channel Start                                                      */
      __IOM uint16_t INTMAJOR   : 1;            /*!< [1..1] Enable an interrupt when major iteration count completes.          */
      __IOM uint16_t INTHALF    : 1;            /*!< [2..2] Enable an interrupt when major counter is half complete.           */
      __IOM uint16_t DREQ       : 1;            /*!< [3..3] Disable Request                                                    */
      __IOM uint16_t ESG        : 1;            /*!< [4..4] Enable Scatter/Gather Processing                                   */
      __IOM uint16_t MAJORELINK : 1;            /*!< [5..5] Enable channel-to-channel linking on major loop complete           */
      __IOM uint16_t ACTIVE     : 1;            /*!< [6..6] Channel Active                                                     */
      __IOM uint16_t DONE       : 1;            /*!< [7..7] Channel Done                                                       */
      __IOM uint16_t MAJORLINKCH : 4;           /*!< [11..8] Major Loop Link Channel Number                                    */
            uint16_t            : 2;
      __IOM uint16_t BWC        : 2;            /*!< [15..14] Bandwidth Control                                                */
    } DMA_TCD2_CSR_b;
  } ;

  union {
    union {
      __IOM uint16_t DMA_TCD2_BITER_ELINKNO_DMA;/*!< (@ 0x0000105E) TCD Beginning Minor Loop Link, Major Loop Count
                                                                    (Channel Linking Disabled)                                 */

      struct {
        __IOM uint16_t BITER    : 15;           /*!< [14..0] Starting Major Iteration Count                                    */
        __IOM uint16_t ELINK    : 1;            /*!< [15..15] Enables channel-to-channel linking on minor loop complete        */
      } DMA_TCD2_BITER_ELINKNO_DMA_b;
    } ;

    union {
      __IOM uint16_t DMA_TCD2_BITER_ELINKYES_DMA;/*!< (@ 0x0000105E) TCD Beginning Minor Loop Link, Major Loop Count
                                                                    (Channel Linking Enabled)                                  */

      struct {
        __IOM uint16_t BITER    : 9;            /*!< [8..0] Starting major iteration count                                     */
        __IOM uint16_t LINKCH   : 4;            /*!< [12..9] Link Channel Number                                               */
              uint16_t          : 2;
        __IOM uint16_t ELINK    : 1;            /*!< [15..15] Enables channel-to-channel linking on minor loop complete        */
      } DMA_TCD2_BITER_ELINKYES_DMA_b;
    } ;
  };

  union {
    __IOM uint32_t DMA_TCD3_SADDR;              /*!< (@ 0x00001060) TCD Source Address                                         */

    struct {
      __IOM uint32_t SADDR      : 32;           /*!< [31..0] Source Address                                                    */
    } DMA_TCD3_SADDR_b;
  } ;

  union {
    __IOM uint16_t DMA_TCD3_SOFF;               /*!< (@ 0x00001064) TCD Signed Source Address Offset                           */

    struct {
      __IOM uint16_t SOFF       : 16;           /*!< [15..0] Source address signed offset                                      */
    } DMA_TCD3_SOFF_b;
  } ;

  union {
    __IOM uint16_t DMA_TCD3_ATTR;               /*!< (@ 0x00001066) TCD Transfer Attributes                                    */

    struct {
      __IOM uint16_t DSIZE      : 3;            /*!< [2..0] Destination data transfer size                                     */
      __IOM uint16_t DMOD       : 5;            /*!< [7..3] Destination Address Modulo                                         */
      __IOM uint16_t SSIZE      : 3;            /*!< [10..8] Source data transfer size                                         */
      __IOM uint16_t SMOD       : 5;            /*!< [15..11] Source Address Modulo                                            */
    } DMA_TCD3_ATTR_b;
  } ;

  union {
    union {
      __IOM uint32_t DMA_TCD3_NBYTES_MLNO_DMA;  /*!< (@ 0x00001068) TCD Minor Byte Count (Minor Loop Mapping Disabled)         */

      struct {
        __IOM uint32_t NBYTES   : 32;           /*!< [31..0] Minor Byte Transfer Count                                         */
      } DMA_TCD3_NBYTES_MLNO_DMA_b;
    } ;

    union {
      __IOM uint32_t DMA_TCD3_NBYTES_MLOFFNO_DMA;/*!< (@ 0x00001068) TCD Signed Minor Loop Offset (Minor Loop Mapping
                                                                    Enabled and Offset Disabled)                               */

      struct {
        __IOM uint32_t NBYTES   : 30;           /*!< [29..0] Minor Byte Transfer Count                                         */
        __IOM uint32_t DMLOE    : 1;            /*!< [30..30] Destination Minor Loop Offset enable                             */
        __IOM uint32_t SMLOE    : 1;            /*!< [31..31] Source Minor Loop Offset Enable                                  */
      } DMA_TCD3_NBYTES_MLOFFNO_DMA_b;
    } ;

    union {
      __IOM uint32_t DMA_TCD3_NBYTES_MLOFFYES_DMA;/*!< (@ 0x00001068) TCD Signed Minor Loop Offset (Minor Loop Mapping
                                                                    and Offset Enabled)                                        */

