nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t VLD        : 1;            /*!< [0..0] Valid                                                              */
            uint32_t            : 15;
      __IOM uint32_t PIDMASK    : 8;            /*!< [23..16] Process Identifier Mask                                          */
      __IOM uint32_t PID        : 8;            /*!< [31..24] Process Identifier                                               */
    } MPU_RGD2_WORD3_b;
  } ;

  union {
    __IOM uint32_t MPU_RGD3_WORD0;              /*!< (@ 0x00000430) Region Descriptor 3, Word 0                                */

    struct {
            uint32_t            : 5;
      __IOM uint32_t SRTADDR    : 27;           /*!< [31..5] Start Address                                                     */
    } MPU_RGD3_WORD0_b;
  } ;

  union {
    __IOM uint32_t MPU_RGD3_WORD1;              /*!< (@ 0x00000434) Region Descriptor 3, Word 1                                */

    struct {
            uint32_t            : 5;
      __IOM uint32_t ENDADDR    : 27;           /*!< [31..5] End Address                                                       */
    } MPU_RGD3_WORD1_b;
  } ;

  union {
    __IOM uint32_t MPU_RGD3_WORD2;              /*!< (@ 0x00000438) Region Descriptor 3, Word 2                                */

    struct {
      __IOM uint32_t M0UM       : 3;            /*!< [2..0] Bus Master 0 User Mode Access Control                              */
      __IOM uint32_t M0SM       : 2;            /*!< [4..3] Bus Master 0 Supervisor Mode Access Control                        */
      __IOM uint32_t M0PE       : 1;            /*!< [5..5] Bus Master 0 Process Identifier enable                             */
      __IOM uint32_t M1UM       : 3;            /*!< [8..6] Bus Master 1 User Mode Access Control                              */
      __IOM uint32_t M1SM       : 2;            /*!< [10..9] Bus Master 1 Supervisor Mode Access Control                       */
            uint32_t            : 1;
      __IOM uint32_t M2UM       : 3;            /*!< [14..12] Bus Master 2 User Mode Access control                            */
      __IOM uint32_t M2SM       : 2;            /*!< [16..15] Bus Master 2 Supervisor Mode Access Control                      */
            uint32_t            : 1;
      __IOM uint32_t M3UM       : 3;            /*!< [20..18] Bus Master 3 User Mode Access Control                            */
      __IOM uint32_t M3SM       : 2;            /*!< [22..21] Bus Master 3 Supervisor Mode Access Control                      */
            uint32_t            : 1;
      __IOM uint32_t M4WE       : 1;            /*!< [24..24] Bus Master 4 Write Enable                                        */
      __IOM uint32_t M4RE       : 1;            /*!< [25..25] Bus Master 4 Read Enable                                         */
      __IOM uint32_t M5WE       : 1;            /*!< [26..26] Bus Master 5 Write Enable                                        */
      __IOM uint32_t M5RE       : 1;            /*!< [27..27] Bus Master 5 Read Enable                                         */
      __IOM uint32_t M6WE       : 1;            /*!< [28..28] Bus Master 6 Write Enable                                        */
      __IOM uint32_t M6RE       : 1;            /*!< [29..29] Bus Master 6 Read Enable                                         */
      __IOM uint32_t M7WE       : 1;            /*!< [30..30] Bus Master 7 Write Enable                                        */
      __IOM uint32_t M7RE       : 1;            /*!< [31..31] Bus Master 7 Read Enable                                         */
    } MPU_RGD3_WORD2_b;
  } ;

  union {
    __IOM uint32_t MPU_RGD3_WORD3;              /*!< (@ 0x0000043C) Region Descriptor 3, Word 3                                */

    struct {
      __IOM uint32_t VLD        : 1;            /*!< [0..0] Valid                                                              */
            uint32_t            : 15;
      __IOM uint32_t PIDMASK    : 8;            /*!< [23..16] Process Identifier Mask                                          */
      __IOM uint32_t PID        : 8;            /*!< [31..24] Process Identifier                                               */
    } MPU_RGD3_WORD3_b;
  } ;

  union {
    __IOM uint32_t MPU_RGD4_WORD0;              /*!< (@ 0x00000440) Region Descriptor 4, Word 0                                */

    struct {
            uint32_t            : 5;
      __IOM uint32_t SRTADDR    : 27;           /*!< [31..5] Start Address                                                     */
    } MPU_RGD4_WORD0_b;
  } ;

  union {
    __IOM uint32_t MPU_RGD4_WORD1;              /*!< (@ 0x00000444) Region Descriptor 4, Word 1                                */

    struct {
            uint32_t            : 5;
      __IOM uint32_t ENDADDR    : 27;           /*!< [31..5] End Address                                                       */
    } MPU_RGD4_WORD1_b;
  } ;

  union {
    __IOM uint32_t MPU_RGD4_WORD2;              /*!< (@ 0x00000448) Region Descriptor 4, Word 2                                */

    struct {
      __IOM uint32_t M0UM       : 3;            /*!< [2..0] Bus Master 0 User Mode Access Control                              */
      __IOM uint32_t M0SM       : 2;            /*!< [4..3] Bus Master 0 Supervisor Mode Access Control                        */
      __IOM uint32_t M0PE       : 1;            /*!< [5..5] Bus Master 0 Process Identifier enable                             */
      __IOM uint32_t M1UM       : 3;            /*!< [8..6] Bus Master 1 User Mode Access Control                              */
      __IOM uint32_t M1SM       : 2;            /*!< [10..9] Bus Master 1 Supervisor Mode Access Control                       */
            uint32_t            : 1;
      __IOM uint32_t M2UM       : 3;            /*!< [14..12] Bus Master 2 User Mode Access control                            */
      __IOM uint32_t M2SM       : 2;            /*!< [16..15] Bus Master 2 Supervisor Mode Access Control                      */
            uint32_t            : 1;
      __IOM uint32_t M3UM       : 3;            /*!< [20..18] Bus Master 3 User Mode Access Control                            */
      __IOM uint32_t M3SM       : 2;            /*!< [22..21] Bus Master 3 Supervisor Mode Access Control                      */
            uint32_t            : 1;
      __IOM uint32_t M4WE       : 1;            /*!< [24..24] Bus Master 4 Write Enable                                        */
      __IOM uint32_t M4RE       : 1;            /*!< [25..25] Bus Master 4 Read Enable                                         */
      __IOM uint32_t M5WE       : 1;            /*!< [26..26] Bus Master 5 Write Enable                                        */
      __IOM uint32_t M5RE       : 1;            /*!< [27..27] Bus Master 5 Read Enable                                         */
      __IOM uint32_t M6WE       : 1;            /*!< [28..28] Bus Master 6 Write Enable                                        */
      __IOM uint32_t M6RE       : 1;            /*!< [29..29] Bus Master 6 Read Enable                                         */
      __IOM uint32_t M7WE       : 1;            /*!< [30..30] Bus Master 7 Write Enable                                        */
      __IOM uint32_t M7RE       : 1;            /*!< [31..31] Bus Master 7 Read Enable                                         */
    } MPU_RGD4_WORD2_b;
  } ;

  union {
    __IOM uint32_t MPU_RGD4_WORD3;              /*!< (@ 0x0000044C) Region Descriptor 4, Word 3                                */

