nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t M0UM       : 3;            /*!< [2..0] Bus Master 0 User Mode Access Control                              */
      __IOM uint32_t M0SM       : 2;            /*!< [4..3] Bus Master 0 Supervisor Mode Access Control                        */
      __IOM uint32_t M0PE       : 1;            /*!< [5..5] Bus Master 0 Process Identifier Enable                             */
      __IOM uint32_t M1UM       : 3;            /*!< [8..6] Bus Master 1 User Mode Access Control                              */
      __IOM uint32_t M1SM       : 2;            /*!< [10..9] Bus Master 1 Supervisor Mode Access Control                       */
            uint32_t            : 1;
      __IOM uint32_t M2UM       : 3;            /*!< [14..12] Bus Master 2 User Mode Access Control                            */
      __IOM uint32_t M2SM       : 2;            /*!< [16..15] Bus Master 2 Supervisor Mode Access Control                      */
            uint32_t            : 1;
      __IOM uint32_t M3UM       : 3;            /*!< [20..18] Bus Master 3 User Mode Access Control                            */
      __IOM uint32_t M3SM       : 2;            /*!< [22..21] Bus Master 3 Supervisor Mode Access Control                      */
            uint32_t            : 1;
      __IOM uint32_t M4WE       : 1;            /*!< [24..24] Bus Master 4 Write Enable                                        */
      __IOM uint32_t M4RE       : 1;            /*!< [25..25] Bus Master 4 Read Enable                                         */
      __IOM uint32_t M5WE       : 1;            /*!< [26..26] Bus Master 5 Write Enable                                        */
      __IOM uint32_t M5RE       : 1;            /*!< [27..27] Bus Master 5 Read Enable                                         */
      __IOM uint32_t M6WE       : 1;            /*!< [28..28] Bus Master 6 Write Enable                                        */
      __IOM uint32_t M6RE       : 1;            /*!< [29..29] Bus Master 6 Read Enable                                         */
      __IOM uint32_t M7WE       : 1;            /*!< [30..30] Bus Master 7 Write Enable                                        */
      __IOM uint32_t M7RE       : 1;            /*!< [31..31] Bus Master 7 Read Enable                                         */
    } MPU_RGDAAC7_b;
  } ;
} MPU_Type;                                     /*!< Size = 2080 (0x820)                                                       */



/* =========================================================================================================================== */
/* ================                                            ERM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief ERM (ERM)
  */

typedef struct {                                /*!< (@ 0x40018000) ERM Structure                                              */

  union {
    __IOM uint32_t ERM_CR0;                     /*!< (@ 0x00000000) ERM Configuration Register 0                               */

    struct {
            uint32_t            : 30;
      __IOM uint32_t ENCIE0     : 1;            /*!< [30..30] ENCIE0                                                           */
      __IOM uint32_t ESCIE0     : 1;            /*!< [31..31] ESCIE0                                                           */
    } ERM_CR0_b;
  } ;
  __IM  uint32_t  RESERVED[3];

  union {
    __IOM uint32_t ERM_SR0;                     /*!< (@ 0x00000010) ERM Status Register 0                                      */

    struct {
            uint32_t            : 30;
      __IOM uint32_t NCE0       : 1;            /*!< [30..30] NCE0                                                             */
      __IOM uint32_t SBC0       : 1;            /*!< [31..31] SBC0                                                             */
    } ERM_SR0_b;
  } ;
  __IM  uint32_t  RESERVED1[59];

  union {
    __IM  uint32_t ERM_EAR0;                    /*!< (@ 0x00000100) ERM Memory n Error Address Register                        */

    struct {
      __IM  uint32_t EAR        : 32;           /*!< [31..0] EAR                                                               */
    } ERM_EAR0_b;
  } ;
} ERM_Type;                                     /*!< Size = 260 (0x104)                                                        */



/* =========================================================================================================================== */
/* ================                                            EIM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Error Injection Module (EIM)
  */

typedef struct {                                /*!< (@ 0x40019000) EIM Structure                                              */

  union {
    __IOM uint32_t EIM_EIMCR;                   /*!< (@ 0x00000000) Error Injection Module Configuration Register              */

    struct {
      __IOM uint32_t GEIEN      : 1;            /*!< [0..0] Global Error Injection Enable                                      */
            uint32_t            : 31;
    } EIM_EIMCR_b;
  } ;

  union {
    __IOM uint32_t EIM_EICHEN;                  /*!< (@ 0x00000004) Error Injection Channel Enable register                    */

    struct {
            uint32_t            : 31;
      __IOM uint32_t EICH0EN    : 1;            /*!< [31..31] Error Injection Channel 0 Enable                                 */
    } EIM_EICHEN_b;
  } ;
  __IM  uint32_t  RESERVED[62];

  union {
    __IOM uint32_t EIM_EICHD0_WORD0;            /*!< (@ 0x00000100) Error Injection Channel Descriptor n, Word0                */

    struct {
            uint32_t            : 25;
      __IOM uint32_t CHKBIT_MASK : 7;           /*!< [31..25] Checkbit Mask                                                    */
    } EIM_EICHD0_WORD0_b;
  } ;

  union {
    __IOM uint32_t EIM_EICHD0_WORD1;            /*!< (@ 0x00000104) Error Injection Channel Descriptor n, Word1                */

