nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t B0_3DATA_MASK : 32;        /*!< [31..0] Data Mask Bytes 0-3                                               */
    } EIM_EICHD0_WORD1_b;
  } ;
} EIM_Type;                                     /*!< Size = 264 (0x108)                                                        */



/* =========================================================================================================================== */
/* ================                                           FTFC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief FTFC (FTFC)
  */

typedef struct {                                /*!< (@ 0x40020000) FTFC Structure                                             */

  union {
    __IOM uint8_t FTFC_FSTAT;                   /*!< (@ 0x00000000) Flash Status Register                                      */

    struct {
      __IM  uint8_t MGSTAT0     : 1;            /*!< [0..0] Memory Controller Command Completion Status Flag                   */
            uint8_t             : 3;
      __IOM uint8_t FPVIOL      : 1;            /*!< [4..4] Flash Protection Violation Flag                                    */
      __IOM uint8_t ACCERR      : 1;            /*!< [5..5] Flash Access Error Flag                                            */
      __IOM uint8_t RDCOLERR    : 1;            /*!< [6..6] FTFC Read Collision Error Flag                                     */
      __IOM uint8_t CCIF        : 1;            /*!< [7..7] Command Complete Interrupt Flag                                    */
    } FTFC_FSTAT_b;
  } ;

  union {
    __IOM uint8_t FTFC_FCNFG;                   /*!< (@ 0x00000001) Flash Configuration Register                               */

    struct {
      __IM  uint8_t EEERDY      : 1;            /*!< [0..0] EEERDY                                                             */
      __IM  uint8_t RAMRDY      : 1;            /*!< [1..1] RAM Ready                                                          */
            uint8_t             : 2;
      __IOM uint8_t ERSSUSP     : 1;            /*!< [4..4] Erase Suspend                                                      */
      __IM  uint8_t ERSAREQ     : 1;            /*!< [5..5] Erase All Request                                                  */
      __IOM uint8_t RDCOLLIE    : 1;            /*!< [6..6] Read Collision Error Interrupt Enable                              */
      __IOM uint8_t CCIE        : 1;            /*!< [7..7] Command Complete Interrupt Enable                                  */
    } FTFC_FCNFG_b;
  } ;

  union {
    __IM  uint8_t FTFC_FSEC;                    /*!< (@ 0x00000002) Flash Security Register                                    */

    struct {
      __IM  uint8_t SEC         : 2;            /*!< [1..0] Flash Security                                                     */
      __IM  uint8_t FSLACC      : 2;            /*!< [3..2] Factory Failure Analysis Access Code                               */
      __IM  uint8_t MEEN        : 2;            /*!< [5..4] Mass Erase Enable Bits                                             */
      __IM  uint8_t KEYEN       : 2;            /*!< [7..6] Backdoor Key Security Enable                                       */
    } FTFC_FSEC_b;
  } ;

  union {
    __IM  uint8_t FTFC_FOPT;                    /*!< (@ 0x00000003) Flash Option Register                                      */

    struct {
      __IM  uint8_t OPT         : 8;            /*!< [7..0] Nonvolatile Option                                                 */
    } FTFC_FOPT_b;
  } ;

  union {
    __IOM uint8_t FTFC_FCCOB3;                  /*!< (@ 0x00000004) Flash Common Command Object Registers                      */

    struct {
      __IOM uint8_t CCOBn       : 8;            /*!< [7..0] CCOBn                                                              */
    } FTFC_FCCOB3_b;
  } ;

  union {
    __IOM uint8_t FTFC_FCCOB2;                  /*!< (@ 0x00000005) Flash Common Command Object Registers                      */

    struct {
      __IOM uint8_t CCOBn       : 8;            /*!< [7..0] CCOBn                                                              */
    } FTFC_FCCOB2_b;
  } ;

  union {
    __IOM uint8_t FTFC_FCCOB1;                  /*!< (@ 0x00000006) Flash Common Command Object Registers                      */

    struct {
      __IOM uint8_t CCOBn       : 8;            /*!< [7..0] CCOBn                                                              */
    } FTFC_FCCOB1_b;
  } ;

  union {
    __IOM uint8_t FTFC_FCCOB0;                  /*!< (@ 0x00000007) Flash Common Command Object Registers                      */

    struct {
      __IOM uint8_t CCOBn       : 8;            /*!< [7..0] CCOBn                                                              */
    } FTFC_FCCOB0_b;
  } ;

  union {
    __IOM uint8_t FTFC_FCCOB7;                  /*!< (@ 0x00000008) Flash Common Command Object Registers                      */

    struct {
      __IOM uint8_t CCOBn       : 8;            /*!< [7..0] CCOBn                                                              */
    } FTFC_FCCOB7_b;
  } ;

  union {
    __IOM uint8_t FTFC_FCCOB6;                  /*!< (@ 0x00000009) Flash Common Command Object Registers                      */

    struct {
      __IOM uint8_t CCOBn       : 8;            /*!< [7..0] CCOBn                                                              */
    } FTFC_FCCOB6_b;
  } ;

  union {
    __IOM uint8_t FTFC_FCCOB5;                  /*!< (@ 0x0000000A) Flash Common Command Object Registers                      */

    struct {
      __IOM uint8_t CCOBn       : 8;            /*!< [7..0] CCOBn                                                              */
    } FTFC_FCCOB5_b;
  } ;

  union {
    __IOM uint8_t FTFC_FCCOB4;                  /*!< (@ 0x0000000B) Flash Common Command Object Registers                      */

