nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint8_t CCOBn       : 8;            /*!< [7..0] CCOBn                                                              */
    } FTFC_FCCOB4_b;
  } ;

  union {
    __IOM uint8_t FTFC_FCCOBB;                  /*!< (@ 0x0000000C) Flash Common Command Object Registers                      */

    struct {
      __IOM uint8_t CCOBn       : 8;            /*!< [7..0] CCOBn                                                              */
    } FTFC_FCCOBB_b;
  } ;

  union {
    __IOM uint8_t FTFC_FCCOBA;                  /*!< (@ 0x0000000D) Flash Common Command Object Registers                      */

    struct {
      __IOM uint8_t CCOBn       : 8;            /*!< [7..0] CCOBn                                                              */
    } FTFC_FCCOBA_b;
  } ;

  union {
    __IOM uint8_t FTFC_FCCOB9;                  /*!< (@ 0x0000000E) Flash Common Command Object Registers                      */

    struct {
      __IOM uint8_t CCOBn       : 8;            /*!< [7..0] CCOBn                                                              */
    } FTFC_FCCOB9_b;
  } ;

  union {
    __IOM uint8_t FTFC_FCCOB8;                  /*!< (@ 0x0000000F) Flash Common Command Object Registers                      */

    struct {
      __IOM uint8_t CCOBn       : 8;            /*!< [7..0] CCOBn                                                              */
    } FTFC_FCCOB8_b;
  } ;

  union {
    __IOM uint8_t FTFC_FPROT3;                  /*!< (@ 0x00000010) Program Flash Protection Registers                         */

    struct {
      __IOM uint8_t PROT        : 8;            /*!< [7..0] Program Flash Region Protect                                       */
    } FTFC_FPROT3_b;
  } ;

  union {
    __IOM uint8_t FTFC_FPROT2;                  /*!< (@ 0x00000011) Program Flash Protection Registers                         */

    struct {
      __IOM uint8_t PROT        : 8;            /*!< [7..0] Program Flash Region Protect                                       */
    } FTFC_FPROT2_b;
  } ;

  union {
    __IOM uint8_t FTFC_FPROT1;                  /*!< (@ 0x00000012) Program Flash Protection Registers                         */

    struct {
      __IOM uint8_t PROT        : 8;            /*!< [7..0] Program Flash Region Protect                                       */
    } FTFC_FPROT1_b;
  } ;

  union {
    __IOM uint8_t FTFC_FPROT0;                  /*!< (@ 0x00000013) Program Flash Protection Registers                         */

    struct {
      __IOM uint8_t PROT        : 8;            /*!< [7..0] Program Flash Region Protect                                       */
    } FTFC_FPROT0_b;
  } ;
  __IM  uint8_t   RESERVED[2];

  union {
    __IOM uint8_t FTFC_FEPROT;                  /*!< (@ 0x00000016) EEPROM Protection Register                                 */

    struct {
      __IOM uint8_t EPROT       : 8;            /*!< [7..0] EEPROM Region Protect                                              */
    } FTFC_FEPROT_b;
  } ;

  union {
    __IOM uint8_t FTFC_FDPROT;                  /*!< (@ 0x00000017) Data Flash Protection Register                             */

    struct {
      __IOM uint8_t DPROT       : 8;            /*!< [7..0] Data Flash Region Protect                                          */
    } FTFC_FDPROT_b;
  } ;
  __IM  uint8_t   RESERVED1[20];

  union {
    __IM  uint8_t FTFC_FCSESTAT;                /*!< (@ 0x0000002C) Flash CSEc Status Register                                 */

    struct {
      __IM  uint8_t BSY         : 1;            /*!< [0..0] Busy                                                               */
      __IM  uint8_t SB          : 1;            /*!< [1..1] Secure Boot                                                        */
      __IM  uint8_t BIN         : 1;            /*!< [2..2] Secure Boot Initialization                                         */
      __IM  uint8_t BFN         : 1;            /*!< [3..3] Secure Boot Finished                                               */
      __IM  uint8_t BOK         : 1;            /*!< [4..4] Secure Boot OK                                                     */
      __IM  uint8_t RIN         : 1;            /*!< [5..5] Random Number Generator Initialized                                */
      __IM  uint8_t EDB         : 1;            /*!< [6..6] External Debug                                                     */
      __IM  uint8_t IDB         : 1;            /*!< [7..7] Internal Debug                                                     */
    } FTFC_FCSESTAT_b;
  } ;
  __IM  uint8_t   RESERVED2;

  union {
    __IOM uint8_t FTFC_FERSTAT;                 /*!< (@ 0x0000002E) Flash Error Status Register                                */

    struct {
            uint8_t             : 1;
      __IOM uint8_t DFDIF       : 1;            /*!< [1..1] Double Bit Fault Detect Interrupt Flag                             */
            uint8_t             : 6;
    } FTFC_FERSTAT_b;
  } ;

  union {
    __IOM uint8_t FTFC_FERCNFG;                 /*!< (@ 0x0000002F) Flash Error Configuration Register                         */

    struct {
            uint8_t             : 1;
      __IOM uint8_t DFDIE       : 1;            /*!< [1..1] Double Bit Fault Detect Interrupt Enable                           */
            uint8_t             : 3;
      __IOM uint8_t FDFD        : 1;            /*!< [5..5] Force Double Bit Fault Detect                                      */
            uint8_t             : 2;
    } FTFC_FERCNFG_b;
  } ;
} FTFC_Type;                                    /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                          DMAMUX                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA channel multiplexor (DMAMUX)
  */

typedef struct {                                /*!< (@ 0x40021000) DMAMUX Structure                                           */

  union {
    __IOM uint8_t DMAMUX_CHCFG0;                /*!< (@ 0x00000000) Channel Configuration register                             */

