nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t TIMER      : 16;           /*!< [15..0] Timer Value                                                       */
            uint32_t            : 16;
    } CAN0_TIMER_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t CAN0_RXMGMASK;               /*!< (@ 0x00000010) Rx Mailboxes Global Mask Register                          */

    struct {
      __IOM uint32_t MG         : 32;           /*!< [31..0] Rx Mailboxes Global Mask Bits                                     */
    } CAN0_RXMGMASK_b;
  } ;

  union {
    __IOM uint32_t CAN0_RX14MASK;               /*!< (@ 0x00000014) Rx 14 Mask register                                        */

    struct {
      __IOM uint32_t RX14M      : 32;           /*!< [31..0] Rx Buffer 14 Mask Bits                                            */
    } CAN0_RX14MASK_b;
  } ;

  union {
    __IOM uint32_t CAN0_RX15MASK;               /*!< (@ 0x00000018) Rx 15 Mask register                                        */

    struct {
      __IOM uint32_t RX15M      : 32;           /*!< [31..0] Rx Buffer 15 Mask Bits                                            */
    } CAN0_RX15MASK_b;
  } ;

  union {
    __IOM uint32_t CAN0_ECR;                    /*!< (@ 0x0000001C) Error Counter                                              */

    struct {
      __IOM uint32_t TXERRCNT   : 8;            /*!< [7..0] Transmit Error Counter                                             */
      __IOM uint32_t RXERRCNT   : 8;            /*!< [15..8] Receive Error Counter                                             */
      __IOM uint32_t TXERRCNT_FAST : 8;         /*!< [23..16] Transmit Error Counter for fast bits                             */
      __IOM uint32_t RXERRCNT_FAST : 8;         /*!< [31..24] Receive Error Counter for fast bits                              */
    } CAN0_ECR_b;
  } ;

  union {
    __IOM uint32_t CAN0_ESR1;                   /*!< (@ 0x00000020) Error and Status 1 register                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t ERRINT     : 1;            /*!< [1..1] Error Interrupt                                                    */
      __IOM uint32_t BOFFINT    : 1;            /*!< [2..2] Bus Off Interrupt                                                  */
      __IM  uint32_t RX         : 1;            /*!< [3..3] FlexCAN In Reception                                               */
      __IM  uint32_t FLTCONF    : 2;            /*!< [5..4] Fault Confinement State                                            */
      __IM  uint32_t TX         : 1;            /*!< [6..6] FlexCAN In Transmission                                            */
      __IM  uint32_t IDLE       : 1;            /*!< [7..7] IDLE                                                               */
      __IM  uint32_t RXWRN      : 1;            /*!< [8..8] Rx Error Warning                                                   */
      __IM  uint32_t TXWRN      : 1;            /*!< [9..9] TX Error Warning                                                   */
      __IM  uint32_t STFERR     : 1;            /*!< [10..10] Stuffing Error                                                   */
      __IM  uint32_t FRMERR     : 1;            /*!< [11..11] Form Error                                                       */
      __IM  uint32_t CRCERR     : 1;            /*!< [12..12] Cyclic Redundancy Check Error                                    */
      __IM  uint32_t ACKERR     : 1;            /*!< [13..13] Acknowledge Error                                                */
      __IM  uint32_t BIT0ERR    : 1;            /*!< [14..14] Bit0 Error                                                       */
      __IM  uint32_t BIT1ERR    : 1;            /*!< [15..15] Bit1 Error                                                       */
      __IOM uint32_t RWRNINT    : 1;            /*!< [16..16] Rx Warning Interrupt Flag                                        */
      __IOM uint32_t TWRNINT    : 1;            /*!< [17..17] Tx Warning Interrupt Flag                                        */
      __IM  uint32_t SYNCH      : 1;            /*!< [18..18] CAN Synchronization Status                                       */
      __IOM uint32_t BOFFDONEINT : 1;           /*!< [19..19] Bus Off Done Interrupt                                           */
      __IOM uint32_t ERRINT_FAST : 1;           /*!< [20..20] Error Interrupt for errors detected in the Data Phase
                                                     of CAN FD frames with the BRS bit set                                     */
      __IOM uint32_t ERROVR     : 1;            /*!< [21..21] Error Overrun bit                                                */
            uint32_t            : 4;
      __IM  uint32_t STFERR_FAST : 1;           /*!< [26..26] Stuffing Error in the Data Phase of CAN FD frames with
                                                     the BRS bit set                                                           */
      __IM  uint32_t FRMERR_FAST : 1;           /*!< [27..27] Form Error in the Data Phase of CAN FD frames with
                                                     the BRS bit set                                                           */
      __IM  uint32_t CRCERR_FAST : 1;           /*!< [28..28] Cyclic Redundancy Check Error in the CRC field of CAN
                                                     FD frames with the BRS bit set                                            */
            uint32_t            : 1;
      __IM  uint32_t BIT0ERR_FAST : 1;          /*!< [30..30] Bit0 Error in the Data Phase of CAN FD frames with
                                                     the BRS bit set                                                           */
      __IM  uint32_t BIT1ERR_FAST : 1;          /*!< [31..31] Bit1 Error in the Data Phase of CAN FD frames with
                                                     the BRS bit set                                                           */
    } CAN0_ESR1_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t CAN0_IMASK1;                 /*!< (@ 0x00000028) Interrupt Masks 1 register                                 */

