nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t BUF31TO0M  : 32;           /*!< [31..0] Buffer MB i Mask                                                  */
    } CAN0_IMASK1_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t CAN0_IFLAG1;                 /*!< (@ 0x00000030) Interrupt Flags 1 register                                 */

    struct {
      __IOM uint32_t BUF0I      : 1;            /*!< [0..0] Buffer MB0 Interrupt Or Clear FIFO bit                             */
      __IOM uint32_t BUF4TO1I   : 4;            /*!< [4..1] Buffer MB i Interrupt Or 'reserved'                                */
      __IOM uint32_t BUF5I      : 1;            /*!< [5..5] Buffer MB5 Interrupt Or 'Frames available in Rx FIFO'              */
      __IOM uint32_t BUF6I      : 1;            /*!< [6..6] Buffer MB6 Interrupt Or 'Rx FIFO Warning'                          */
      __IOM uint32_t BUF7I      : 1;            /*!< [7..7] Buffer MB7 Interrupt Or 'Rx FIFO Overflow'                         */
      __IOM uint32_t BUF31TO8I  : 24;           /*!< [31..8] Buffer MBi Interrupt                                              */
    } CAN0_IFLAG1_b;
  } ;

  union {
    __IOM uint32_t CAN0_CTRL2;                  /*!< (@ 0x00000034) Control 2 register                                         */

    struct {
            uint32_t            : 11;
      __IOM uint32_t EDFLTDIS   : 1;            /*!< [11..11] Edge Filter Disable                                              */
      __IOM uint32_t ISOCANFDEN : 1;            /*!< [12..12] ISO CAN FD Enable                                                */
            uint32_t            : 1;
      __IOM uint32_t PREXCEN    : 1;            /*!< [14..14] Protocol Exception Enable                                        */
      __IOM uint32_t TIMER_SRC  : 1;            /*!< [15..15] Timer Source                                                     */
      __IOM uint32_t EACEN      : 1;            /*!< [16..16] Entire Frame Arbitration Field Comparison Enable For
                                                     Rx Mailboxes                                                              */
      __IOM uint32_t RRS        : 1;            /*!< [17..17] Remote Request Storing                                           */
      __IOM uint32_t MRP        : 1;            /*!< [18..18] Mailboxes Reception Priority                                     */
      __IOM uint32_t TASD       : 5;            /*!< [23..19] Tx Arbitration Start Delay                                       */
      __IOM uint32_t RFFN       : 4;            /*!< [27..24] Number Of Rx FIFO Filters                                        */
            uint32_t            : 2;
      __IOM uint32_t BOFFDONEMSK : 1;           /*!< [30..30] Bus Off Done Interrupt Mask                                      */
      __IOM uint32_t ERRMSK_FAST : 1;           /*!< [31..31] Error Interrupt Mask for errors detected in the Data
                                                     Phase of fast CAN FD frames                                               */
    } CAN0_CTRL2_b;
  } ;

  union {
    __IM  uint32_t CAN0_ESR2;                   /*!< (@ 0x00000038) Error and Status 2 register                                */

    struct {
            uint32_t            : 13;
      __IM  uint32_t IMB        : 1;            /*!< [13..13] Inactive Mailbox                                                 */
      __IM  uint32_t VPS        : 1;            /*!< [14..14] Valid Priority Status                                            */
            uint32_t            : 1;
      __IM  uint32_t LPTM       : 7;            /*!< [22..16] Lowest Priority Tx Mailbox                                       */
            uint32_t            : 9;
    } CAN0_ESR2_b;
  } ;
  __IM  uint32_t  RESERVED3[2];

  union {
    __IM  uint32_t CAN0_CRCR;                   /*!< (@ 0x00000044) CRC Register                                               */

    struct {
      __IM  uint32_t TXCRC      : 15;           /*!< [14..0] Transmitted CRC value                                             */
            uint32_t            : 1;
      __IM  uint32_t MBCRC      : 7;            /*!< [22..16] CRC Mailbox                                                      */
            uint32_t            : 9;
    } CAN0_CRCR_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXFGMASK;               /*!< (@ 0x00000048) Rx FIFO Global Mask register                               */

    struct {
      __IOM uint32_t FGM        : 32;           /*!< [31..0] Rx FIFO Global Mask Bits                                          */
    } CAN0_RXFGMASK_b;
  } ;

  union {
    __IM  uint32_t CAN0_RXFIR;                  /*!< (@ 0x0000004C) Rx FIFO Information Register                               */

    struct {
      __IM  uint32_t IDHIT      : 9;            /*!< [8..0] Identifier Acceptance Filter Hit Indicator                         */
            uint32_t            : 23;
    } CAN0_RXFIR_b;
  } ;

  union {
    __IOM uint32_t CAN0_CBT;                    /*!< (@ 0x00000050) CAN Bit Timing Register                                    */

    struct {
      __IOM uint32_t EPSEG2     : 5;            /*!< [4..0] Extended Phase Segment 2                                           */
      __IOM uint32_t EPSEG1     : 5;            /*!< [9..5] Extended Phase Segment 1                                           */
      __IOM uint32_t EPROPSEG   : 6;            /*!< [15..10] Extended Propagation Segment                                     */
      __IOM uint32_t ERJW       : 5;            /*!< [20..16] Extended Resync Jump Width                                       */
      __IOM uint32_t EPRESDIV   : 10;           /*!< [30..21] Extended Prescaler Division Factor                               */
      __IOM uint32_t BTF        : 1;            /*!< [31..31] Bit Timing Format Enable                                         */
    } CAN0_CBT_b;
  } ;
  __IM  uint32_t  RESERVED4[11];

  union {
    __IOM uint32_t CAN0_RAMn0;                  /*!< (@ 0x00000080) Embedded RAM                                               */

