nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn9_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn10;                 /*!< (@ 0x000000A8) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn10_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn11;                 /*!< (@ 0x000000AC) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn11_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn12;                 /*!< (@ 0x000000B0) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn12_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn13;                 /*!< (@ 0x000000B4) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn13_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn14;                 /*!< (@ 0x000000B8) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn14_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn15;                 /*!< (@ 0x000000BC) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn15_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn16;                 /*!< (@ 0x000000C0) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn16_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn17;                 /*!< (@ 0x000000C4) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn17_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn18;                 /*!< (@ 0x000000C8) Embedded RAM                                               */

