nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn72_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn73;                 /*!< (@ 0x000001A4) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn73_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn74;                 /*!< (@ 0x000001A8) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn74_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn75;                 /*!< (@ 0x000001AC) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn75_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn76;                 /*!< (@ 0x000001B0) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn76_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn77;                 /*!< (@ 0x000001B4) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn77_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn78;                 /*!< (@ 0x000001B8) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn78_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn79;                 /*!< (@ 0x000001BC) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn79_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn80;                 /*!< (@ 0x000001C0) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn80_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn81;                 /*!< (@ 0x000001C4) Embedded RAM                                               */

