nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn126_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn127;                /*!< (@ 0x0000027C) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn127_b;
  } ;
  __IM  uint32_t  RESERVED5[384];

  union {
    __IOM uint32_t CAN0_RXIMR0;                 /*!< (@ 0x00000880) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR0_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR1;                 /*!< (@ 0x00000884) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR1_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR2;                 /*!< (@ 0x00000888) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR2_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR3;                 /*!< (@ 0x0000088C) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR3_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR4;                 /*!< (@ 0x00000890) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR4_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR5;                 /*!< (@ 0x00000894) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR5_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR6;                 /*!< (@ 0x00000898) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR6_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR7;                 /*!< (@ 0x0000089C) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR7_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR8;                 /*!< (@ 0x000008A0) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR8_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR9;                 /*!< (@ 0x000008A4) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR9_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR10;                /*!< (@ 0x000008A8) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR10_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR11;                /*!< (@ 0x000008AC) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR11_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR12;                /*!< (@ 0x000008B0) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR12_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR13;                /*!< (@ 0x000008B4) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR13_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR14;                /*!< (@ 0x000008B8) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR14_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR15;                /*!< (@ 0x000008BC) Rx Individual Mask Registers                               */

