nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t Data_byte_7 : 8;           /*!< [7..0] Payload Filter 2 high order bits / Payload Mask high
                                                     order bits for Pretended Networking payload filtering corresponding
                                                     to the data byte 7.                                                       */
      __IOM uint32_t Data_byte_6 : 8;           /*!< [15..8] Payload Filter 2 high order bits / Payload Mask high
                                                     order bits for Pretended Networking payload filtering corresponding
                                                     to the data byte 6.                                                       */
      __IOM uint32_t Data_byte_5 : 8;           /*!< [23..16] Payload Filter 2 high order bits / Payload Mask high
                                                     order bits for Pretended Networking payload filtering corresponding
                                                     to the data byte 5.                                                       */
      __IOM uint32_t Data_byte_4 : 8;           /*!< [31..24] Payload Filter 2 high order bits / Payload Mask high
                                                     order bits for Pretended Networking payload filtering corresponding
                                                     to the data byte 4.                                                       */
    } CAN0_PL2_PLMASK_HI_b;
  } ;
  __IM  uint32_t  RESERVED7[6];

  union {
    __IM  uint32_t CAN0_WMB0_CS;                /*!< (@ 0x00000B40) Wake Up Message Buffer Register for C/S                    */

    struct {
            uint32_t            : 16;
      __IM  uint32_t DLC        : 4;            /*!< [19..16] Length of Data in Bytes                                          */
      __IM  uint32_t RTR        : 1;            /*!< [20..20] Remote Transmission Request Bit                                  */
      __IM  uint32_t IDE        : 1;            /*!< [21..21] ID Extended Bit                                                  */
      __IM  uint32_t SRR        : 1;            /*!< [22..22] Substitute Remote Request                                        */
            uint32_t            : 9;
    } CAN0_WMB0_CS_b;
  } ;

  union {
    __IM  uint32_t CAN0_WMB0_ID;                /*!< (@ 0x00000B44) Wake Up Message Buffer Register for ID                     */

    struct {
      __IM  uint32_t ID         : 29;           /*!< [28..0] Received ID under Pretended Networking mode                       */
            uint32_t            : 3;
    } CAN0_WMB0_ID_b;
  } ;

  union {
    __IM  uint32_t CAN0_WMB0_D03;               /*!< (@ 0x00000B48) Wake Up Message Buffer Register for Data 0-3               */

    struct {
      __IM  uint32_t Data_byte_3 : 8;           /*!< [7..0] Received payload corresponding to the data byte 3 under
                                                     Pretended Networking mode                                                 */
      __IM  uint32_t Data_byte_2 : 8;           /*!< [15..8] Received payload corresponding to the data byte 2 under
                                                     Pretended Networking mode                                                 */
      __IM  uint32_t Data_byte_1 : 8;           /*!< [23..16] Received payload corresponding to the data byte 1 under
                                                     Pretended Networking mode                                                 */
      __IM  uint32_t Data_byte_0 : 8;           /*!< [31..24] Received payload corresponding to the data byte 0 under
                                                     Pretended Networking mode                                                 */
    } CAN0_WMB0_D03_b;
  } ;

  union {
    __IM  uint32_t CAN0_WMB0_D47;               /*!< (@ 0x00000B4C) Wake Up Message Buffer Register Data 4-7                   */

    struct {
      __IM  uint32_t Data_byte_7 : 8;           /*!< [7..0] Received payload corresponding to the data byte 7 under
                                                     Pretended Networking mode                                                 */
      __IM  uint32_t Data_byte_6 : 8;           /*!< [15..8] Received payload corresponding to the data byte 6 under
                                                     Pretended Networking mode                                                 */
      __IM  uint32_t Data_byte_5 : 8;           /*!< [23..16] Received payload corresponding to the data byte 5 under
                                                     Pretended Networking mode                                                 */
      __IM  uint32_t Data_byte_4 : 8;           /*!< [31..24] Received payload corresponding to the data byte 4 under
                                                     Pretended Networking mode                                                 */
    } CAN0_WMB0_D47_b;
  } ;

  union {
    __IM  uint32_t CAN0_WMB1_CS;                /*!< (@ 0x00000B50) Wake Up Message Buffer Register for C/S                    */

    struct {
            uint32_t            : 16;
      __IM  uint32_t DLC        : 4;            /*!< [19..16] Length of Data in Bytes                                          */
      __IM  uint32_t RTR        : 1;            /*!< [20..20] Remote Transmission Request Bit                                  */
      __IM  uint32_t IDE        : 1;            /*!< [21..21] ID Extended Bit                                                  */
      __IM  uint32_t SRR        : 1;            /*!< [22..22] Substitute Remote Request                                        */
            uint32_t            : 9;
    } CAN0_WMB1_CS_b;
  } ;

  union {
    __IM  uint32_t CAN0_WMB1_ID;                /*!< (@ 0x00000B54) Wake Up Message Buffer Register for ID                     */

    struct {
      __IM  uint32_t ID         : 29;           /*!< [28..0] Received ID under Pretended Networking mode                       */
            uint32_t            : 3;
    } CAN0_WMB1_ID_b;
  } ;

  union {
    __IM  uint32_t CAN0_WMB1_D03;               /*!< (@ 0x00000B58) Wake Up Message Buffer Register for Data 0-3               */

