nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint32_t ID         : 29;           /*!< [28..0] Received ID under Pretended Networking mode                       */
            uint32_t            : 3;
    } CAN0_WMB3_ID_b;
  } ;

  union {
    __IM  uint32_t CAN0_WMB3_D03;               /*!< (@ 0x00000B78) Wake Up Message Buffer Register for Data 0-3               */

    struct {
      __IM  uint32_t Data_byte_3 : 8;           /*!< [7..0] Received payload corresponding to the data byte 3 under
                                                     Pretended Networking mode                                                 */
      __IM  uint32_t Data_byte_2 : 8;           /*!< [15..8] Received payload corresponding to the data byte 2 under
                                                     Pretended Networking mode                                                 */
      __IM  uint32_t Data_byte_1 : 8;           /*!< [23..16] Received payload corresponding to the data byte 1 under
                                                     Pretended Networking mode                                                 */
      __IM  uint32_t Data_byte_0 : 8;           /*!< [31..24] Received payload corresponding to the data byte 0 under
                                                     Pretended Networking mode                                                 */
    } CAN0_WMB3_D03_b;
  } ;

  union {
    __IM  uint32_t CAN0_WMB3_D47;               /*!< (@ 0x00000B7C) Wake Up Message Buffer Register Data 4-7                   */

    struct {
      __IM  uint32_t Data_byte_7 : 8;           /*!< [7..0] Received payload corresponding to the data byte 7 under
                                                     Pretended Networking mode                                                 */
      __IM  uint32_t Data_byte_6 : 8;           /*!< [15..8] Received payload corresponding to the data byte 6 under
                                                     Pretended Networking mode                                                 */
      __IM  uint32_t Data_byte_5 : 8;           /*!< [23..16] Received payload corresponding to the data byte 5 under
                                                     Pretended Networking mode                                                 */
      __IM  uint32_t Data_byte_4 : 8;           /*!< [31..24] Received payload corresponding to the data byte 4 under
                                                     Pretended Networking mode                                                 */
    } CAN0_WMB3_D47_b;
  } ;
  __IM  uint32_t  RESERVED8[32];

  union {
    __IOM uint32_t CAN0_FDCTRL;                 /*!< (@ 0x00000C00) CAN FD Control Register                                    */

    struct {
      __IM  uint32_t TDCVAL     : 6;            /*!< [5..0] Transceiver Delay Compensation Value                               */
            uint32_t            : 2;
      __IOM uint32_t TDCOFF     : 5;            /*!< [12..8] Transceiver Delay Compensation Offset                             */
            uint32_t            : 1;
      __IOM uint32_t TDCFAIL    : 1;            /*!< [14..14] Transceiver Delay Compensation Fail                              */
      __IOM uint32_t TDCEN      : 1;            /*!< [15..15] Transceiver Delay Compensation Enable                            */
      __IOM uint32_t MBDSR0     : 2;            /*!< [17..16] Message Buffer Data Size for Region 0                            */
            uint32_t            : 13;
      __IOM uint32_t FDRATE     : 1;            /*!< [31..31] Bit Rate Switch Enable                                           */
    } CAN0_FDCTRL_b;
  } ;

  union {
    __IOM uint32_t CAN0_FDCBT;                  /*!< (@ 0x00000C04) CAN FD Bit Timing Register                                 */

    struct {
      __IOM uint32_t FPSEG2     : 3;            /*!< [2..0] Fast Phase Segment 2                                               */
            uint32_t            : 2;
      __IOM uint32_t FPSEG1     : 3;            /*!< [7..5] Fast Phase Segment 1                                               */
            uint32_t            : 2;
      __IOM uint32_t FPROPSEG   : 5;            /*!< [14..10] Fast Propagation Segment                                         */
            uint32_t            : 1;
      __IOM uint32_t FRJW       : 3;            /*!< [18..16] Fast Resync Jump Width                                           */
            uint32_t            : 1;
      __IOM uint32_t FPRESDIV   : 10;           /*!< [29..20] Fast Prescaler Division Factor                                   */
            uint32_t            : 2;
    } CAN0_FDCBT_b;
  } ;

  union {
    __IM  uint32_t CAN0_FDCRC;                  /*!< (@ 0x00000C08) CAN FD CRC Register                                        */

    struct {
      __IM  uint32_t FD_TXCRC   : 21;           /*!< [20..0] Extended Transmitted CRC value                                    */
            uint32_t            : 3;
      __IM  uint32_t FD_MBCRC   : 7;            /*!< [30..24] CRC Mailbox Number for FD_TXCRC                                  */
            uint32_t            : 1;
    } CAN0_FDCRC_b;
  } ;
} CAN0_Type;                                    /*!< Size = 3084 (0xc0c)                                                       */



/* =========================================================================================================================== */
/* ================                                          LPSPI0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief The LPSPI Memory Map/Register Definition can be found here. (LPSPI0)
  */

typedef struct {                                /*!< (@ 0x4002C000) LPSPI0 Structure                                           */

  union {
    __IM  uint32_t LPSPI0_VERID;                /*!< (@ 0x00000000) Version ID Register                                        */

