nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint32_t SOF        : 1;            /*!< [0..0] Start Of Frame                                                     */
      __IM  uint32_t RXEMPTY    : 1;            /*!< [1..1] RX FIFO Empty                                                      */
            uint32_t            : 30;
    } LPSPI0_RSR_b;
  } ;

  union {
    __IM  uint32_t LPSPI0_RDR;                  /*!< (@ 0x00000074) Receive Data Register                                      */

    struct {
      __IM  uint32_t DATA       : 32;           /*!< [31..0] Receive Data                                                      */
    } LPSPI0_RDR_b;
  } ;
} LPSPI0_Type;                                  /*!< Size = 120 (0x78)                                                         */



/* =========================================================================================================================== */
/* ================                                          LPSPI1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief The LPSPI Memory Map/Register Definition can be found here. (LPSPI1)
  */

typedef struct {                                /*!< (@ 0x4002D000) LPSPI1 Structure                                           */

  union {
    __IM  uint32_t LPSPI1_VERID;                /*!< (@ 0x00000000) Version ID Register                                        */

    struct {
      __IM  uint32_t FEATURE    : 16;           /*!< [15..0] Module Identification Number                                      */
      __IM  uint32_t MINOR      : 8;            /*!< [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /*!< [31..24] Major Version Number                                             */
    } LPSPI1_VERID_b;
  } ;

  union {
    __IM  uint32_t LPSPI1_PARAM;                /*!< (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t TXFIFO     : 8;            /*!< [7..0] Transmit FIFO Size                                                 */
      __IM  uint32_t RXFIFO     : 8;            /*!< [15..8] Receive FIFO Size                                                 */
            uint32_t            : 16;
    } LPSPI1_PARAM_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t LPSPI1_CR;                   /*!< (@ 0x00000010) Control Register                                           */

    struct {
      __IOM uint32_t MEN        : 1;            /*!< [0..0] Module Enable                                                      */
      __IOM uint32_t RST        : 1;            /*!< [1..1] Software Reset                                                     */
      __IOM uint32_t DOZEN      : 1;            /*!< [2..2] Doze mode enable                                                   */
      __IOM uint32_t DBGEN      : 1;            /*!< [3..3] Debug Enable                                                       */
            uint32_t            : 4;
      __OM  uint32_t RTF        : 1;            /*!< [8..8] Reset Transmit FIFO                                                */
      __OM  uint32_t RRF        : 1;            /*!< [9..9] Reset Receive FIFO                                                 */
            uint32_t            : 22;
    } LPSPI1_CR_b;
  } ;

  union {
    __IOM uint32_t LPSPI1_SR;                   /*!< (@ 0x00000014) Status Register                                            */

    struct {
      __IM  uint32_t TDF        : 1;            /*!< [0..0] Transmit Data Flag                                                 */
      __IM  uint32_t RDF        : 1;            /*!< [1..1] Receive Data Flag                                                  */
            uint32_t            : 6;
      __IOM uint32_t WCF        : 1;            /*!< [8..8] Word Complete Flag                                                 */
      __IOM uint32_t FCF        : 1;            /*!< [9..9] Frame Complete Flag                                                */
      __IOM uint32_t TCF        : 1;            /*!< [10..10] Transfer Complete Flag                                           */
      __IOM uint32_t TEF        : 1;            /*!< [11..11] Transmit Error Flag                                              */
      __IOM uint32_t REF        : 1;            /*!< [12..12] Receive Error Flag                                               */
      __IOM uint32_t DMF        : 1;            /*!< [13..13] Data Match Flag                                                  */
            uint32_t            : 10;
      __IM  uint32_t MBF        : 1;            /*!< [24..24] Module Busy Flag                                                 */
            uint32_t            : 7;
    } LPSPI1_SR_b;
  } ;

  union {
    __IOM uint32_t LPSPI1_IER;                  /*!< (@ 0x00000018) Interrupt Enable Register                                  */

    struct {
      __IOM uint32_t TDIE       : 1;            /*!< [0..0] Transmit Data Interrupt Enable                                     */
      __IOM uint32_t RDIE       : 1;            /*!< [1..1] Receive Data Interrupt Enable                                      */
            uint32_t            : 6;
      __IOM uint32_t WCIE       : 1;            /*!< [8..8] Word Complete Interrupt Enable                                     */
      __IOM uint32_t FCIE       : 1;            /*!< [9..9] Frame Complete Interrupt Enable                                    */
      __IOM uint32_t TCIE       : 1;            /*!< [10..10] Transfer Complete Interrupt Enable                               */
      __IOM uint32_t TEIE       : 1;            /*!< [11..11] Transmit Error Interrupt Enable                                  */
      __IOM uint32_t REIE       : 1;            /*!< [12..12] Receive Error Interrupt Enable                                   */
      __IOM uint32_t DMIE       : 1;            /*!< [13..13] Data Match Interrupt Enable                                      */
            uint32_t            : 18;
    } LPSPI1_IER_b;
  } ;

  union {
    __IOM uint32_t LPSPI1_DER;                  /*!< (@ 0x0000001C) DMA Enable Register                                        */

