nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t LDOK       : 1;            /*!< [0..0] Load OK                                                            */
      __IOM uint32_t CONT       : 1;            /*!< [1..1] Continuous Mode Enable                                             */
      __IOM uint32_t MULT       : 2;            /*!< [3..2] Multiplication Factor Select for Prescaler                         */
            uint32_t            : 1;
      __IOM uint32_t PDBIE      : 1;            /*!< [5..5] PDB Interrupt Enable                                               */
      __IOM uint32_t PDBIF      : 1;            /*!< [6..6] PDB Interrupt Flag                                                 */
      __IOM uint32_t PDBEN      : 1;            /*!< [7..7] PDB Enable                                                         */
      __IOM uint32_t TRGSEL     : 4;            /*!< [11..8] Trigger Input Source Select                                       */
      __IOM uint32_t PRESCALER  : 3;            /*!< [14..12] Prescaler Divider Select                                         */
      __IOM uint32_t DMAEN      : 1;            /*!< [15..15] DMA Enable                                                       */
      __OM  uint32_t SWTRIG     : 1;            /*!< [16..16] Software Trigger                                                 */
      __IOM uint32_t PDBEIE     : 1;            /*!< [17..17] PDB Sequence Error Interrupt Enable                              */
      __IOM uint32_t LDMOD      : 2;            /*!< [19..18] Load Mode Select                                                 */
            uint32_t            : 12;
    } PDB0_SC_b;
  } ;

  union {
    __IOM uint32_t PDB0_MOD;                    /*!< (@ 0x00000004) Modulus register                                           */

    struct {
      __IOM uint32_t MOD        : 16;           /*!< [15..0] PDB Modulus                                                       */
            uint32_t            : 16;
    } PDB0_MOD_b;
  } ;

  union {
    __IM  uint32_t PDB0_CNT;                    /*!< (@ 0x00000008) Counter register                                           */

    struct {
      __IM  uint32_t CNT        : 16;           /*!< [15..0] PDB Counter                                                       */
            uint32_t            : 16;
    } PDB0_CNT_b;
  } ;

  union {
    __IOM uint32_t PDB0_IDLY;                   /*!< (@ 0x0000000C) Interrupt Delay register                                   */

    struct {
      __IOM uint32_t IDLY       : 16;           /*!< [15..0] PDB Interrupt Delay                                               */
            uint32_t            : 16;
    } PDB0_IDLY_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH0C1;                  /*!< (@ 0x00000010) Channel n Control register 1                               */

    struct {
      __IOM uint32_t EN         : 8;            /*!< [7..0] PDB Channel Pre-Trigger Enable                                     */
      __IOM uint32_t TOS        : 8;            /*!< [15..8] PDB Channel Pre-Trigger Output Select                             */
      __IOM uint32_t BB         : 8;            /*!< [23..16] PDB Channel Pre-Trigger Back-to-Back Operation Enable            */
            uint32_t            : 8;
    } PDB0_CH0C1_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH0S;                   /*!< (@ 0x00000014) Channel n Status register                                  */

    struct {
      __IOM uint32_t ERR        : 8;            /*!< [7..0] PDB Channel Sequence Error Flags                                   */
            uint32_t            : 8;
      __IOM uint32_t CF         : 8;            /*!< [23..16] PDB Channel Flags                                                */
            uint32_t            : 8;
    } PDB0_CH0S_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH0DLY0;                /*!< (@ 0x00000018) Channel n Delay 0 register                                 */

    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH0DLY0_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH0DLY1;                /*!< (@ 0x0000001C) Channel n Delay 1 register                                 */

    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH0DLY1_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH0DLY2;                /*!< (@ 0x00000020) Channel n Delay 2 register                                 */

    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH0DLY2_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH0DLY3;                /*!< (@ 0x00000024) Channel n Delay 3 register                                 */

    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH0DLY3_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH0DLY4;                /*!< (@ 0x00000028) Channel n Delay 4 register                                 */

    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH0DLY4_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH0DLY5;                /*!< (@ 0x0000002C) Channel n Delay 5 register                                 */

    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH0DLY5_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH0DLY6;                /*!< (@ 0x00000030) Channel n Delay 6 register                                 */

