nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t TMR_VAL    : 32;           /*!< [31..0] Timer Value                                                       */
    } LPIT0_TVAL1_b;
  } ;

  union {
    __IM  uint32_t LPIT0_CVAL1;                 /*!< (@ 0x00000034) Current Timer Value                                        */

    struct {
      __IM  uint32_t TMR_CUR_VAL : 32;          /*!< [31..0] Current Timer Value                                               */
    } LPIT0_CVAL1_b;
  } ;

  union {
    __IOM uint32_t LPIT0_TCTRL1;                /*!< (@ 0x00000038) Timer Control Register                                     */

    struct {
      __IOM uint32_t T_EN       : 1;            /*!< [0..0] Timer Enable                                                       */
      __IOM uint32_t CHAIN      : 1;            /*!< [1..1] Chain Channel                                                      */
      __IOM uint32_t MODE       : 2;            /*!< [3..2] Timer Operation Mode                                               */
            uint32_t            : 12;
      __IOM uint32_t TSOT       : 1;            /*!< [16..16] Timer Start On Trigger                                           */
      __IOM uint32_t TSOI       : 1;            /*!< [17..17] Timer Stop On Interrupt                                          */
      __IOM uint32_t TROT       : 1;            /*!< [18..18] Timer Reload On Trigger                                          */
            uint32_t            : 4;
      __IOM uint32_t TRG_SRC    : 1;            /*!< [23..23] Trigger Source                                                   */
      __IOM uint32_t TRG_SEL    : 4;            /*!< [27..24] Trigger Select                                                   */
            uint32_t            : 4;
    } LPIT0_TCTRL1_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t LPIT0_TVAL2;                 /*!< (@ 0x00000040) Timer Value Register                                       */

    struct {
      __IOM uint32_t TMR_VAL    : 32;           /*!< [31..0] Timer Value                                                       */
    } LPIT0_TVAL2_b;
  } ;

  union {
    __IM  uint32_t LPIT0_CVAL2;                 /*!< (@ 0x00000044) Current Timer Value                                        */

    struct {
      __IM  uint32_t TMR_CUR_VAL : 32;          /*!< [31..0] Current Timer Value                                               */
    } LPIT0_CVAL2_b;
  } ;

  union {
    __IOM uint32_t LPIT0_TCTRL2;                /*!< (@ 0x00000048) Timer Control Register                                     */

    struct {
      __IOM uint32_t T_EN       : 1;            /*!< [0..0] Timer Enable                                                       */
      __IOM uint32_t CHAIN      : 1;            /*!< [1..1] Chain Channel                                                      */
      __IOM uint32_t MODE       : 2;            /*!< [3..2] Timer Operation Mode                                               */
            uint32_t            : 12;
      __IOM uint32_t TSOT       : 1;            /*!< [16..16] Timer Start On Trigger                                           */
      __IOM uint32_t TSOI       : 1;            /*!< [17..17] Timer Stop On Interrupt                                          */
      __IOM uint32_t TROT       : 1;            /*!< [18..18] Timer Reload On Trigger                                          */
            uint32_t            : 4;
      __IOM uint32_t TRG_SRC    : 1;            /*!< [23..23] Trigger Source                                                   */
      __IOM uint32_t TRG_SEL    : 4;            /*!< [27..24] Trigger Select                                                   */
            uint32_t            : 4;
    } LPIT0_TCTRL2_b;
  } ;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t LPIT0_TVAL3;                 /*!< (@ 0x00000050) Timer Value Register                                       */

    struct {
      __IOM uint32_t TMR_VAL    : 32;           /*!< [31..0] Timer Value                                                       */
    } LPIT0_TVAL3_b;
  } ;

  union {
    __IM  uint32_t LPIT0_CVAL3;                 /*!< (@ 0x00000054) Current Timer Value                                        */

    struct {
      __IM  uint32_t TMR_CUR_VAL : 32;          /*!< [31..0] Current Timer Value                                               */
    } LPIT0_CVAL3_b;
  } ;

  union {
    __IOM uint32_t LPIT0_TCTRL3;                /*!< (@ 0x00000058) Timer Control Register                                     */

    struct {
      __IOM uint32_t T_EN       : 1;            /*!< [0..0] Timer Enable                                                       */
      __IOM uint32_t CHAIN      : 1;            /*!< [1..1] Chain Channel                                                      */
      __IOM uint32_t MODE       : 2;            /*!< [3..2] Timer Operation Mode                                               */
            uint32_t            : 12;
      __IOM uint32_t TSOT       : 1;            /*!< [16..16] Timer Start On Trigger                                           */
      __IOM uint32_t TSOI       : 1;            /*!< [17..17] Timer Stop On Interrupt                                          */
      __IOM uint32_t TROT       : 1;            /*!< [18..18] Timer Reload On Trigger                                          */
            uint32_t            : 4;
      __IOM uint32_t TRG_SRC    : 1;            /*!< [23..23] Trigger Source                                                   */
      __IOM uint32_t TRG_SEL    : 4;            /*!< [27..24] Trigger Select                                                   */
            uint32_t            : 4;
    } LPIT0_TCTRL3_b;
  } ;
} LPIT0_Type;                                   /*!< Size = 92 (0x5c)                                                          */



/* =========================================================================================================================== */
/* ================                                           FTM0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief FlexTimer Module (FTM0)
  */

typedef struct {                                /*!< (@ 0x40038000) FTM0 Structure                                             */

  union {
    __IOM uint32_t FTM0_SC;                     /*!< (@ 0x00000000) Status And Control                                         */

