nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint32_t CH0F       : 1;            /*!< [0..0] Channel 0 Flag                                                     */
      __IM  uint32_t CH1F       : 1;            /*!< [1..1] Channel 1 Flag                                                     */
      __IM  uint32_t CH2F       : 1;            /*!< [2..2] Channel 2 Flag                                                     */
      __IM  uint32_t CH3F       : 1;            /*!< [3..3] Channel 3 Flag                                                     */
      __IM  uint32_t CH4F       : 1;            /*!< [4..4] Channel 4 Flag                                                     */
      __IM  uint32_t CH5F       : 1;            /*!< [5..5] Channel 5 Flag                                                     */
      __IM  uint32_t CH6F       : 1;            /*!< [6..6] Channel 6 Flag                                                     */
      __IM  uint32_t CH7F       : 1;            /*!< [7..7] Channel 7 Flag                                                     */
            uint32_t            : 24;
    } FTM0_STATUS_b;
  } ;

  union {
    __IOM uint32_t FTM0_MODE;                   /*!< (@ 0x00000054) Features Mode Selection                                    */

    struct {
      __IOM uint32_t FTMEN      : 1;            /*!< [0..0] FTM Enable                                                         */
      __OM  uint32_t INIT       : 1;            /*!< [1..1] Initialize The Channels Output                                     */
      __IOM uint32_t WPDIS      : 1;            /*!< [2..2] Write Protection Disable                                           */
      __IOM uint32_t PWMSYNC    : 1;            /*!< [3..3] PWM Synchronization Mode                                           */
      __IOM uint32_t CAPTEST    : 1;            /*!< [4..4] Capture Test Mode Enable                                           */
      __IOM uint32_t FAULTM     : 2;            /*!< [6..5] Fault Control Mode                                                 */
      __IOM uint32_t FAULTIE    : 1;            /*!< [7..7] Fault Interrupt Enable                                             */
            uint32_t            : 24;
    } FTM0_MODE_b;
  } ;

  union {
    __IOM uint32_t FTM0_SYNC;                   /*!< (@ 0x00000058) Synchronization                                            */

    struct {
      __IOM uint32_t CNTMIN     : 1;            /*!< [0..0] Minimum Loading Point Enable                                       */
      __IOM uint32_t CNTMAX     : 1;            /*!< [1..1] Maximum Loading Point Enable                                       */
      __IOM uint32_t REINIT     : 1;            /*!< [2..2] FTM Counter Reinitialization by Synchronization                    */
      __IOM uint32_t SYNCHOM    : 1;            /*!< [3..3] Output Mask Synchronization                                        */
      __IOM uint32_t TRIG0      : 1;            /*!< [4..4] PWM Synchronization Hardware Trigger 0                             */
      __IOM uint32_t TRIG1      : 1;            /*!< [5..5] PWM Synchronization Hardware Trigger 1                             */
      __IOM uint32_t TRIG2      : 1;            /*!< [6..6] PWM Synchronization Hardware Trigger 2                             */
      __IOM uint32_t SWSYNC     : 1;            /*!< [7..7] PWM Synchronization Software Trigger                               */
            uint32_t            : 24;
    } FTM0_SYNC_b;
  } ;

  union {
    __IOM uint32_t FTM0_OUTINIT;                /*!< (@ 0x0000005C) Initial State For Channels Output                          */

    struct {
      __IOM uint32_t CH0OI      : 1;            /*!< [0..0] Channel 0 Output Initialization Value                              */
      __IOM uint32_t CH1OI      : 1;            /*!< [1..1] Channel 1 Output Initialization Value                              */
      __IOM uint32_t CH2OI      : 1;            /*!< [2..2] Channel 2 Output Initialization Value                              */
      __IOM uint32_t CH3OI      : 1;            /*!< [3..3] Channel 3 Output Initialization Value                              */
      __IOM uint32_t CH4OI      : 1;            /*!< [4..4] Channel 4 Output Initialization Value                              */
      __IOM uint32_t CH5OI      : 1;            /*!< [5..5] Channel 5 Output Initialization Value                              */
      __IOM uint32_t CH6OI      : 1;            /*!< [6..6] Channel 6 Output Initialization Value                              */
      __IOM uint32_t CH7OI      : 1;            /*!< [7..7] Channel 7 Output Initialization Value                              */
            uint32_t            : 24;
    } FTM0_OUTINIT_b;
  } ;

  union {
    __IOM uint32_t FTM0_OUTMASK;                /*!< (@ 0x00000060) Output Mask                                                */

    struct {
      __IOM uint32_t CH0OM      : 1;            /*!< [0..0] Channel 0 Output Mask                                              */
      __IOM uint32_t CH1OM      : 1;            /*!< [1..1] Channel 1 Output Mask                                              */
      __IOM uint32_t CH2OM      : 1;            /*!< [2..2] Channel 2 Output Mask                                              */
      __IOM uint32_t CH3OM      : 1;            /*!< [3..3] Channel 3 Output Mask                                              */
      __IOM uint32_t CH4OM      : 1;            /*!< [4..4] Channel 4 Output Mask                                              */
      __IOM uint32_t CH5OM      : 1;            /*!< [5..5] Channel 5 Output Mask                                              */
      __IOM uint32_t CH6OM      : 1;            /*!< [6..6] Channel 6 Output Mask                                              */
      __IOM uint32_t CH7OM      : 1;            /*!< [7..7] Channel 7 Output Mask                                              */
            uint32_t            : 24;
    } FTM0_OUTMASK_b;
  } ;

  union {
    __IOM uint32_t FTM0_COMBINE;                /*!< (@ 0x00000064) Function For Linked Channels                               */

