nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t POL0       : 1;            /*!< [0..0] Channel 0 Polarity                                                 */
      __IOM uint32_t POL1       : 1;            /*!< [1..1] Channel 1 Polarity                                                 */
      __IOM uint32_t POL2       : 1;            /*!< [2..2] Channel 2 Polarity                                                 */
      __IOM uint32_t POL3       : 1;            /*!< [3..3] Channel 3 Polarity                                                 */
      __IOM uint32_t POL4       : 1;            /*!< [4..4] Channel 4 Polarity                                                 */
      __IOM uint32_t POL5       : 1;            /*!< [5..5] Channel 5 Polarity                                                 */
      __IOM uint32_t POL6       : 1;            /*!< [6..6] Channel 6 Polarity                                                 */
      __IOM uint32_t POL7       : 1;            /*!< [7..7] Channel 7 Polarity                                                 */
            uint32_t            : 24;
    } FTM0_POL_b;
  } ;

  union {
    __IOM uint32_t FTM0_FMS;                    /*!< (@ 0x00000074) Fault Mode Status                                          */

    struct {
      __IM  uint32_t FAULTF0    : 1;            /*!< [0..0] Fault Detection Flag 0                                             */
      __IM  uint32_t FAULTF1    : 1;            /*!< [1..1] Fault Detection Flag 1                                             */
      __IM  uint32_t FAULTF2    : 1;            /*!< [2..2] Fault Detection Flag 2                                             */
      __IM  uint32_t FAULTF3    : 1;            /*!< [3..3] Fault Detection Flag 3                                             */
            uint32_t            : 1;
      __IM  uint32_t FAULTIN    : 1;            /*!< [5..5] Fault Inputs                                                       */
      __IOM uint32_t WPEN       : 1;            /*!< [6..6] Write Protection Enable                                            */
      __IM  uint32_t FAULTF     : 1;            /*!< [7..7] Fault Detection Flag                                               */
            uint32_t            : 24;
    } FTM0_FMS_b;
  } ;

  union {
    __IOM uint32_t FTM0_FILTER;                 /*!< (@ 0x00000078) Input Capture Filter Control                               */

    struct {
      __IOM uint32_t CH0FVAL    : 4;            /*!< [3..0] Channel 0 Input Filter                                             */
      __IOM uint32_t CH1FVAL    : 4;            /*!< [7..4] Channel 1 Input Filter                                             */
      __IOM uint32_t CH2FVAL    : 4;            /*!< [11..8] Channel 2 Input Filter                                            */
      __IOM uint32_t CH3FVAL    : 4;            /*!< [15..12] Channel 3 Input Filter                                           */
            uint32_t            : 16;
    } FTM0_FILTER_b;
  } ;

  union {
    __IOM uint32_t FTM0_FLTCTRL;                /*!< (@ 0x0000007C) Fault Control                                              */

    struct {
      __IOM uint32_t FAULT0EN   : 1;            /*!< [0..0] Fault Input 0 Enable                                               */
      __IOM uint32_t FAULT1EN   : 1;            /*!< [1..1] Fault Input 1 Enable                                               */
      __IOM uint32_t FAULT2EN   : 1;            /*!< [2..2] Fault Input 2 Enable                                               */
      __IOM uint32_t FAULT3EN   : 1;            /*!< [3..3] Fault Input 3 Enable                                               */
      __IOM uint32_t FFLTR0EN   : 1;            /*!< [4..4] Fault Input 0 Filter Enable                                        */
      __IOM uint32_t FFLTR1EN   : 1;            /*!< [5..5] Fault Input 1 Filter Enable                                        */
      __IOM uint32_t FFLTR2EN   : 1;            /*!< [6..6] Fault Input 2 Filter Enable                                        */
      __IOM uint32_t FFLTR3EN   : 1;            /*!< [7..7] Fault Input 3 Filter Enable                                        */
      __IOM uint32_t FFVAL      : 4;            /*!< [11..8] Fault Input Filter                                                */
            uint32_t            : 3;
      __IOM uint32_t FSTATE     : 1;            /*!< [15..15] Fault output state                                               */
            uint32_t            : 16;
    } FTM0_FLTCTRL_b;
  } ;

  union {
    __IOM uint32_t FTM0_QDCTRL;                 /*!< (@ 0x00000080) Quadrature Decoder Control And Status                      */

    struct {
      __IOM uint32_t QUADEN     : 1;            /*!< [0..0] Quadrature Decoder Mode Enable                                     */
      __IM  uint32_t TOFDIR     : 1;            /*!< [1..1] Timer Overflow Direction In Quadrature Decoder Mode                */
      __IM  uint32_t QUADIR     : 1;            /*!< [2..2] FTM Counter Direction In Quadrature Decoder Mode                   */
      __IOM uint32_t QUADMODE   : 1;            /*!< [3..3] Quadrature Decoder Mode                                            */
      __IOM uint32_t PHBPOL     : 1;            /*!< [4..4] Phase B Input Polarity                                             */
      __IOM uint32_t PHAPOL     : 1;            /*!< [5..5] Phase A Input Polarity                                             */
      __IOM uint32_t PHBFLTREN  : 1;            /*!< [6..6] Phase B Input Filter Enable                                        */
      __IOM uint32_t PHAFLTREN  : 1;            /*!< [7..7] Phase A Input Filter Enable                                        */
            uint32_t            : 24;
    } FTM0_QDCTRL_b;
  } ;

  union {
    __IOM uint32_t FTM0_CONF;                   /*!< (@ 0x00000084) Configuration                                              */

    struct {
      __IOM uint32_t LDFQ       : 5;            /*!< [4..0] Frequency of the Reload Opportunities                              */
            uint32_t            : 1;
      __IOM uint32_t BDMMODE    : 2;            /*!< [7..6] Debug Mode                                                         */
            uint32_t            : 1;
      __IOM uint32_t GTBEEN     : 1;            /*!< [9..9] Global Time Base Enable                                            */
      __IOM uint32_t GTBEOUT    : 1;            /*!< [10..10] Global Time Base Output                                          */
      __IOM uint32_t ITRIGR     : 1;            /*!< [11..11] Initialization trigger on Reload Point                           */
            uint32_t            : 20;
    } FTM0_CONF_b;
  } ;

  union {
    __IOM uint32_t FTM0_FLTPOL;                 /*!< (@ 0x00000088) FTM Fault Input Polarity                                   */

