nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM0_C2V_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM0_C3V_MIRROR;             /*!< (@ 0x00000210) Mirror of Channel (n) Match Value                          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM0_C3V_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM0_C4V_MIRROR;             /*!< (@ 0x00000214) Mirror of Channel (n) Match Value                          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM0_C4V_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM0_C5V_MIRROR;             /*!< (@ 0x00000218) Mirror of Channel (n) Match Value                          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM0_C5V_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM0_C6V_MIRROR;             /*!< (@ 0x0000021C) Mirror of Channel (n) Match Value                          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM0_C6V_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM0_C7V_MIRROR;             /*!< (@ 0x00000220) Mirror of Channel (n) Match Value                          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM0_C7V_MIRROR_b;
  } ;
} FTM0_Type;                                    /*!< Size = 548 (0x224)                                                        */



/* =========================================================================================================================== */
/* ================                                           FTM1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief FlexTimer Module (FTM1)
  */

typedef struct {                                /*!< (@ 0x40039000) FTM1 Structure                                             */

  union {
    __IOM uint32_t FTM1_SC;                     /*!< (@ 0x00000000) Status And Control                                         */

    struct {
      __IOM uint32_t PS         : 3;            /*!< [2..0] Prescale Factor Selection                                          */
      __IOM uint32_t CLKS       : 2;            /*!< [4..3] Clock Source Selection                                             */
      __IOM uint32_t CPWMS      : 1;            /*!< [5..5] Center-Aligned PWM Select                                          */
      __IOM uint32_t RIE        : 1;            /*!< [6..6] Reload Point Interrupt Enable                                      */
      __IM  uint32_t RF         : 1;            /*!< [7..7] Reload Flag                                                        */
      __IOM uint32_t TOIE       : 1;            /*!< [8..8] Timer Overflow Interrupt Enable                                    */
      __IM  uint32_t TOF        : 1;            /*!< [9..9] Timer Overflow Flag                                                */
            uint32_t            : 6;
      __IOM uint32_t PWMEN0     : 1;            /*!< [16..16] Channel 0 PWM enable bit                                         */
      __IOM uint32_t PWMEN1     : 1;            /*!< [17..17] Channel 1 PWM enable bit                                         */
      __IOM uint32_t PWMEN2     : 1;            /*!< [18..18] Channel 2 PWM enable bit                                         */
      __IOM uint32_t PWMEN3     : 1;            /*!< [19..19] Channel 3 PWM enable bit                                         */
      __IOM uint32_t PWMEN4     : 1;            /*!< [20..20] Channel 4 PWM enable bit                                         */
      __IOM uint32_t PWMEN5     : 1;            /*!< [21..21] Channel 5 PWM enable bit                                         */
      __IOM uint32_t PWMEN6     : 1;            /*!< [22..22] Channel 6 PWM enable bit                                         */
      __IOM uint32_t PWMEN7     : 1;            /*!< [23..23] Channel 7 PWM enable bit                                         */
      __IOM uint32_t FLTPS      : 4;            /*!< [27..24] Filter Prescaler                                                 */
            uint32_t            : 4;
    } FTM1_SC_b;
  } ;

  union {
    __IOM uint32_t FTM1_CNT;                    /*!< (@ 0x00000004) Counter                                                    */

    struct {
      __IOM uint32_t COUNT      : 16;           /*!< [15..0] Counter Value                                                     */
            uint32_t            : 16;
    } FTM1_CNT_b;
  } ;

  union {
    __IOM uint32_t FTM1_MOD;                    /*!< (@ 0x00000008) Modulo                                                     */

