nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t MOD        : 16;           /*!< [15..0] MOD                                                               */
            uint32_t            : 16;
    } FTM1_MOD_b;
  } ;

  union {
    __IOM uint32_t FTM1_C0SC;                   /*!< (@ 0x0000000C) Channel (n) Status And Control                             */

    struct {
      __IOM uint32_t DMA        : 1;            /*!< [0..0] DMA Enable                                                         */
      __IOM uint32_t ICRST      : 1;            /*!< [1..1] FTM counter reset by the selected input capture event.             */
      __IOM uint32_t ELSA       : 1;            /*!< [2..2] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t ELSB       : 1;            /*!< [3..3] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t MSA        : 1;            /*!< [4..4] Channel (n) Mode Select                                            */
      __IOM uint32_t MSB        : 1;            /*!< [5..5] Channel (n) Mode Select                                            */
      __IOM uint32_t CHIE       : 1;            /*!< [6..6] Channel (n) Interrupt Enable                                       */
      __IM  uint32_t CHF        : 1;            /*!< [7..7] Channel (n) Flag                                                   */
      __IOM uint32_t TRIGMODE   : 1;            /*!< [8..8] Trigger mode control                                               */
      __IM  uint32_t CHIS       : 1;            /*!< [9..9] Channel (n) Input State                                            */
      __IM  uint32_t CHOV       : 1;            /*!< [10..10] Channel (n) Output Value                                         */
            uint32_t            : 21;
    } FTM1_C0SC_b;
  } ;

  union {
    __IOM uint32_t FTM1_C0V;                    /*!< (@ 0x00000010) Channel (n) Value                                          */

    struct {
      __IOM uint32_t VAL        : 16;           /*!< [15..0] Channel Value                                                     */
            uint32_t            : 16;
    } FTM1_C0V_b;
  } ;

  union {
    __IOM uint32_t FTM1_C1SC;                   /*!< (@ 0x00000014) Channel (n) Status And Control                             */

    struct {
      __IOM uint32_t DMA        : 1;            /*!< [0..0] DMA Enable                                                         */
      __IOM uint32_t ICRST      : 1;            /*!< [1..1] FTM counter reset by the selected input capture event.             */
      __IOM uint32_t ELSA       : 1;            /*!< [2..2] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t ELSB       : 1;            /*!< [3..3] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t MSA        : 1;            /*!< [4..4] Channel (n) Mode Select                                            */
      __IOM uint32_t MSB        : 1;            /*!< [5..5] Channel (n) Mode Select                                            */
      __IOM uint32_t CHIE       : 1;            /*!< [6..6] Channel (n) Interrupt Enable                                       */
      __IM  uint32_t CHF        : 1;            /*!< [7..7] Channel (n) Flag                                                   */
      __IOM uint32_t TRIGMODE   : 1;            /*!< [8..8] Trigger mode control                                               */
      __IM  uint32_t CHIS       : 1;            /*!< [9..9] Channel (n) Input State                                            */
      __IM  uint32_t CHOV       : 1;            /*!< [10..10] Channel (n) Output Value                                         */
            uint32_t            : 21;
    } FTM1_C1SC_b;
  } ;

  union {
    __IOM uint32_t FTM1_C1V;                    /*!< (@ 0x00000018) Channel (n) Value                                          */

    struct {
      __IOM uint32_t VAL        : 16;           /*!< [15..0] Channel Value                                                     */
            uint32_t            : 16;
    } FTM1_C1V_b;
  } ;

  union {
    __IOM uint32_t FTM1_C2SC;                   /*!< (@ 0x0000001C) Channel (n) Status And Control                             */

    struct {
      __IOM uint32_t DMA        : 1;            /*!< [0..0] DMA Enable                                                         */
      __IOM uint32_t ICRST      : 1;            /*!< [1..1] FTM counter reset by the selected input capture event.             */
      __IOM uint32_t ELSA       : 1;            /*!< [2..2] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t ELSB       : 1;            /*!< [3..3] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t MSA        : 1;            /*!< [4..4] Channel (n) Mode Select                                            */
      __IOM uint32_t MSB        : 1;            /*!< [5..5] Channel (n) Mode Select                                            */
      __IOM uint32_t CHIE       : 1;            /*!< [6..6] Channel (n) Interrupt Enable                                       */
      __IM  uint32_t CHF        : 1;            /*!< [7..7] Channel (n) Flag                                                   */
      __IOM uint32_t TRIGMODE   : 1;            /*!< [8..8] Trigger mode control                                               */
      __IM  uint32_t CHIS       : 1;            /*!< [9..9] Channel (n) Input State                                            */
      __IM  uint32_t CHOV       : 1;            /*!< [10..10] Channel (n) Output Value                                         */
            uint32_t            : 21;
    } FTM1_C2SC_b;
  } ;

  union {
    __IOM uint32_t FTM1_C2V;                    /*!< (@ 0x00000020) Channel (n) Value                                          */

    struct {
      __IOM uint32_t VAL        : 16;           /*!< [15..0] Channel Value                                                     */
            uint32_t            : 16;
    } FTM1_C2V_b;
  } ;

  union {
    __IOM uint32_t FTM1_C3SC;                   /*!< (@ 0x00000024) Channel (n) Status And Control                             */

