nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t DTVAL      : 6;            /*!< [5..0] Deadtime Value                                                     */
      __IOM uint32_t DTPS       : 2;            /*!< [7..6] Deadtime Prescaler Value                                           */
            uint32_t            : 8;
      __IOM uint32_t DTVALEX    : 4;            /*!< [19..16] Extended Deadtime Value                                          */
            uint32_t            : 12;
    } FTM1_DEADTIME_b;
  } ;

  union {
    __IOM uint32_t FTM1_EXTTRIG;                /*!< (@ 0x0000006C) FTM External Trigger                                       */

    struct {
      __IOM uint32_t CH2TRIG    : 1;            /*!< [0..0] Channel 2 External Trigger Enable                                  */
      __IOM uint32_t CH3TRIG    : 1;            /*!< [1..1] Channel 3 External Trigger Enable                                  */
      __IOM uint32_t CH4TRIG    : 1;            /*!< [2..2] Channel 4 External Trigger Enable                                  */
      __IOM uint32_t CH5TRIG    : 1;            /*!< [3..3] Channel 5 External Trigger Enable                                  */
      __IOM uint32_t CH0TRIG    : 1;            /*!< [4..4] Channel 0 External Trigger Enable                                  */
      __IOM uint32_t CH1TRIG    : 1;            /*!< [5..5] Channel 1 External Trigger Enable                                  */
      __IOM uint32_t INITTRIGEN : 1;            /*!< [6..6] Initialization Trigger Enable                                      */
      __IM  uint32_t TRIGF      : 1;            /*!< [7..7] Channel Trigger Flag                                               */
      __IOM uint32_t CH6TRIG    : 1;            /*!< [8..8] Channel 6 External Trigger Enable                                  */
      __IOM uint32_t CH7TRIG    : 1;            /*!< [9..9] Channel 7 External Trigger Enable                                  */
            uint32_t            : 22;
    } FTM1_EXTTRIG_b;
  } ;

  union {
    __IOM uint32_t FTM1_POL;                    /*!< (@ 0x00000070) Channels Polarity                                          */

    struct {
      __IOM uint32_t POL0       : 1;            /*!< [0..0] Channel 0 Polarity                                                 */
      __IOM uint32_t POL1       : 1;            /*!< [1..1] Channel 1 Polarity                                                 */
      __IOM uint32_t POL2       : 1;            /*!< [2..2] Channel 2 Polarity                                                 */
      __IOM uint32_t POL3       : 1;            /*!< [3..3] Channel 3 Polarity                                                 */
      __IOM uint32_t POL4       : 1;            /*!< [4..4] Channel 4 Polarity                                                 */
      __IOM uint32_t POL5       : 1;            /*!< [5..5] Channel 5 Polarity                                                 */
      __IOM uint32_t POL6       : 1;            /*!< [6..6] Channel 6 Polarity                                                 */
      __IOM uint32_t POL7       : 1;            /*!< [7..7] Channel 7 Polarity                                                 */
            uint32_t            : 24;
    } FTM1_POL_b;
  } ;

  union {
    __IOM uint32_t FTM1_FMS;                    /*!< (@ 0x00000074) Fault Mode Status                                          */

    struct {
      __IM  uint32_t FAULTF0    : 1;            /*!< [0..0] Fault Detection Flag 0                                             */
      __IM  uint32_t FAULTF1    : 1;            /*!< [1..1] Fault Detection Flag 1                                             */
      __IM  uint32_t FAULTF2    : 1;            /*!< [2..2] Fault Detection Flag 2                                             */
      __IM  uint32_t FAULTF3    : 1;            /*!< [3..3] Fault Detection Flag 3                                             */
            uint32_t            : 1;
      __IM  uint32_t FAULTIN    : 1;            /*!< [5..5] Fault Inputs                                                       */
      __IOM uint32_t WPEN       : 1;            /*!< [6..6] Write Protection Enable                                            */
      __IM  uint32_t FAULTF     : 1;            /*!< [7..7] Fault Detection Flag                                               */
            uint32_t            : 24;
    } FTM1_FMS_b;
  } ;

  union {
    __IOM uint32_t FTM1_FILTER;                 /*!< (@ 0x00000078) Input Capture Filter Control                               */

    struct {
      __IOM uint32_t CH0FVAL    : 4;            /*!< [3..0] Channel 0 Input Filter                                             */
      __IOM uint32_t CH1FVAL    : 4;            /*!< [7..4] Channel 1 Input Filter                                             */
      __IOM uint32_t CH2FVAL    : 4;            /*!< [11..8] Channel 2 Input Filter                                            */
      __IOM uint32_t CH3FVAL    : 4;            /*!< [15..12] Channel 3 Input Filter                                           */
            uint32_t            : 16;
    } FTM1_FILTER_b;
  } ;

  union {
    __IOM uint32_t FTM1_FLTCTRL;                /*!< (@ 0x0000007C) Fault Control                                              */

    struct {
      __IOM uint32_t FAULT0EN   : 1;            /*!< [0..0] Fault Input 0 Enable                                               */
      __IOM uint32_t FAULT1EN   : 1;            /*!< [1..1] Fault Input 1 Enable                                               */
      __IOM uint32_t FAULT2EN   : 1;            /*!< [2..2] Fault Input 2 Enable                                               */
      __IOM uint32_t FAULT3EN   : 1;            /*!< [3..3] Fault Input 3 Enable                                               */
      __IOM uint32_t FFLTR0EN   : 1;            /*!< [4..4] Fault Input 0 Filter Enable                                        */
      __IOM uint32_t FFLTR1EN   : 1;            /*!< [5..5] Fault Input 1 Filter Enable                                        */
      __IOM uint32_t FFLTR2EN   : 1;            /*!< [6..6] Fault Input 2 Filter Enable                                        */
      __IOM uint32_t FFLTR3EN   : 1;            /*!< [7..7] Fault Input 3 Filter Enable                                        */
      __IOM uint32_t FFVAL      : 4;            /*!< [11..8] Fault Input Filter                                                */
            uint32_t            : 3;
      __IOM uint32_t FSTATE     : 1;            /*!< [15..15] Fault output state                                               */
            uint32_t            : 16;
    } FTM1_FLTCTRL_b;
  } ;

  union {
    __IOM uint32_t FTM1_QDCTRL;                 /*!< (@ 0x00000080) Quadrature Decoder Control And Status                      */

