nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t DTVAL      : 6;            /*!< [5..0] Deadtime Value                                                     */
      __IOM uint32_t DTPS       : 2;            /*!< [7..6] Deadtime Prescaler Value                                           */
            uint32_t            : 8;
      __IOM uint32_t DTVALEX    : 4;            /*!< [19..16] Extended Deadtime Value                                          */
            uint32_t            : 12;
    } FTM1_PAIR2DEADTIME_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t FTM1_PAIR3DEADTIME;          /*!< (@ 0x000000B8) Pair 3 Deadtime Configuration                              */

    struct {
      __IOM uint32_t DTVAL      : 6;            /*!< [5..0] Deadtime Value                                                     */
      __IOM uint32_t DTPS       : 2;            /*!< [7..6] Deadtime Prescaler Value                                           */
            uint32_t            : 8;
      __IOM uint32_t DTVALEX    : 4;            /*!< [19..16] Extended Deadtime Value                                          */
            uint32_t            : 12;
    } FTM1_PAIR3DEADTIME_b;
  } ;
  __IM  uint32_t  RESERVED3[81];

  union {
    __IOM uint32_t FTM1_MOD_MIRROR;             /*!< (@ 0x00000200) Mirror of Modulo Value                                     */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACMOD    : 5;            /*!< [15..11] Modulo Fractional Value                                          */
      __IOM uint32_t MOD        : 16;           /*!< [31..16] Mirror of the Modulo Integer Value                               */
    } FTM1_MOD_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM1_C0V_MIRROR;             /*!< (@ 0x00000204) Mirror of Channel (n) Match Value                          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM1_C0V_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM1_C1V_MIRROR;             /*!< (@ 0x00000208) Mirror of Channel (n) Match Value                          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM1_C1V_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM1_C2V_MIRROR;             /*!< (@ 0x0000020C) Mirror of Channel (n) Match Value                          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM1_C2V_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM1_C3V_MIRROR;             /*!< (@ 0x00000210) Mirror of Channel (n) Match Value                          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM1_C3V_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM1_C4V_MIRROR;             /*!< (@ 0x00000214) Mirror of Channel (n) Match Value                          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM1_C4V_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM1_C5V_MIRROR;             /*!< (@ 0x00000218) Mirror of Channel (n) Match Value                          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM1_C5V_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM1_C6V_MIRROR;             /*!< (@ 0x0000021C) Mirror of Channel (n) Match Value                          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM1_C6V_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM1_C7V_MIRROR;             /*!< (@ 0x00000220) Mirror of Channel (n) Match Value                          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM1_C7V_MIRROR_b;
  } ;
} FTM1_Type;                                    /*!< Size = 548 (0x224)                                                        */



/* =========================================================================================================================== */
/* ================                                           ADC0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog-to-Digital Converter (ADC0)
  */

typedef struct {                                /*!< (@ 0x4003B000) ADC0 Structure                                             */

  union {
    __IOM uint32_t ADC0_SC1A;                   /*!< (@ 0x00000000) ADC Status and Control Register 1                          */

