nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1A_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC1B;                   /*!< (@ 0x00000004) ADC Status and Control Register 1                          */

    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1B_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC1C;                   /*!< (@ 0x00000008) ADC Status and Control Register 1                          */

    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1C_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC1D;                   /*!< (@ 0x0000000C) ADC Status and Control Register 1                          */

    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1D_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC1E;                   /*!< (@ 0x00000010) ADC Status and Control Register 1                          */

    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1E_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC1F;                   /*!< (@ 0x00000014) ADC Status and Control Register 1                          */

    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1F_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC1G;                   /*!< (@ 0x00000018) ADC Status and Control Register 1                          */

    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1G_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC1H;                   /*!< (@ 0x0000001C) ADC Status and Control Register 1                          */

    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1H_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC1I;                   /*!< (@ 0x00000020) ADC Status and Control Register 1                          */

    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1I_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC1J;                   /*!< (@ 0x00000024) ADC Status and Control Register 1                          */

    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1J_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC1K;                   /*!< (@ 0x00000028) ADC Status and Control Register 1                          */

