nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1K_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC1L;                   /*!< (@ 0x0000002C) ADC Status and Control Register 1                          */

    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1L_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC1M;                   /*!< (@ 0x00000030) ADC Status and Control Register 1                          */

    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1M_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC1N;                   /*!< (@ 0x00000034) ADC Status and Control Register 1                          */

    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1N_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC1O;                   /*!< (@ 0x00000038) ADC Status and Control Register 1                          */

    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1O_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC1P;                   /*!< (@ 0x0000003C) ADC Status and Control Register 1                          */

    struct {
      __IOM uint32_t ADCH       : 5;            /*!< [4..0] Input channel select                                               */
            uint32_t            : 1;
      __IOM uint32_t AIEN       : 1;            /*!< [6..6] Interrupt Enable                                                   */
      __IM  uint32_t COCO       : 1;            /*!< [7..7] Conversion Complete Flag                                           */
            uint32_t            : 24;
    } ADC0_SC1P_b;
  } ;

  union {
    __IOM uint32_t ADC0_CFG1;                   /*!< (@ 0x00000040) ADC Configuration Register 1                               */

    struct {
      __IOM uint32_t ADICLK     : 2;            /*!< [1..0] Input Clock Select                                                 */
      __IOM uint32_t MODE       : 2;            /*!< [3..2] Conversion mode selection                                          */
            uint32_t            : 1;
      __IOM uint32_t ADIV       : 2;            /*!< [6..5] Clock Divide Select                                                */
            uint32_t            : 1;
      __OM  uint32_t CLRLTRG    : 1;            /*!< [8..8] Clear Latch Trigger in Trigger Handler Block                       */
            uint32_t            : 23;
    } ADC0_CFG1_b;
  } ;

  union {
    __IOM uint32_t ADC0_CFG2;                   /*!< (@ 0x00000044) ADC Configuration Register 2                               */

    struct {
      __IOM uint32_t SMPLTS     : 8;            /*!< [7..0] Sample Time Select                                                 */
            uint32_t            : 24;
    } ADC0_CFG2_b;
  } ;

  union {
    __IM  uint32_t ADC0_RA;                     /*!< (@ 0x00000048) ADC Data Result Registers                                  */

    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RA_b;
  } ;

  union {
    __IM  uint32_t ADC0_RB;                     /*!< (@ 0x0000004C) ADC Data Result Registers                                  */

    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RB_b;
  } ;

  union {
    __IM  uint32_t ADC0_RC;                     /*!< (@ 0x00000050) ADC Data Result Registers                                  */

    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RC_b;
  } ;

  union {
    __IM  uint32_t ADC0_RD;                     /*!< (@ 0x00000054) ADC Data Result Registers                                  */

