nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RD_b;
  } ;

  union {
    __IM  uint32_t ADC0_RE;                     /*!< (@ 0x00000058) ADC Data Result Registers                                  */

    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RE_b;
  } ;

  union {
    __IM  uint32_t ADC0_RF;                     /*!< (@ 0x0000005C) ADC Data Result Registers                                  */

    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RF_b;
  } ;

  union {
    __IM  uint32_t ADC0_RG;                     /*!< (@ 0x00000060) ADC Data Result Registers                                  */

    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RG_b;
  } ;

  union {
    __IM  uint32_t ADC0_RH;                     /*!< (@ 0x00000064) ADC Data Result Registers                                  */

    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RH_b;
  } ;

  union {
    __IM  uint32_t ADC0_RI;                     /*!< (@ 0x00000068) ADC Data Result Registers                                  */

    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RI_b;
  } ;

  union {
    __IM  uint32_t ADC0_RJ;                     /*!< (@ 0x0000006C) ADC Data Result Registers                                  */

    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RJ_b;
  } ;

  union {
    __IM  uint32_t ADC0_RK;                     /*!< (@ 0x00000070) ADC Data Result Registers                                  */

    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RK_b;
  } ;

  union {
    __IM  uint32_t ADC0_RL;                     /*!< (@ 0x00000074) ADC Data Result Registers                                  */

    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RL_b;
  } ;

  union {
    __IM  uint32_t ADC0_RM;                     /*!< (@ 0x00000078) ADC Data Result Registers                                  */

    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RM_b;
  } ;

  union {
    __IM  uint32_t ADC0_RN;                     /*!< (@ 0x0000007C) ADC Data Result Registers                                  */

    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RN_b;
  } ;

  union {
    __IM  uint32_t ADC0_RO;                     /*!< (@ 0x00000080) ADC Data Result Registers                                  */

    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RO_b;
  } ;

  union {
    __IM  uint32_t ADC0_RP;                     /*!< (@ 0x00000084) ADC Data Result Registers                                  */

    struct {
      __IM  uint32_t D          : 12;           /*!< [11..0] Data result                                                       */
            uint32_t            : 20;
    } ADC0_RP_b;
  } ;

  union {
    __IOM uint32_t ADC0_CV1;                    /*!< (@ 0x00000088) Compare Value Registers                                    */

    struct {
      __IOM uint32_t CV         : 16;           /*!< [15..0] Compare Value.                                                    */
            uint32_t            : 16;
    } ADC0_CV1_b;
  } ;

  union {
    __IOM uint32_t ADC0_CV2;                    /*!< (@ 0x0000008C) Compare Value Registers                                    */

    struct {
      __IOM uint32_t CV         : 16;           /*!< [15..0] Compare Value.                                                    */
            uint32_t            : 16;
    } ADC0_CV2_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC2;                    /*!< (@ 0x00000090) Status and Control Register 2                              */

    struct {
      __IOM uint32_t REFSEL     : 2;            /*!< [1..0] Voltage Reference Selection                                        */
      __IOM uint32_t DMAEN      : 1;            /*!< [2..2] DMA Enable                                                         */
      __IOM uint32_t ACREN      : 1;            /*!< [3..3] Compare Function Range Enable                                      */
      __IOM uint32_t ACFGT      : 1;            /*!< [4..4] Compare Function Greater Than Enable                               */
      __IOM uint32_t ACFE       : 1;            /*!< [5..5] Compare Function Enable                                            */
      __IOM uint32_t ADTRG      : 1;            /*!< [6..6] Conversion Trigger Select                                          */
      __IM  uint32_t ADACT      : 1;            /*!< [7..7] Conversion Active                                                  */
            uint32_t            : 5;
      __IM  uint32_t TRGPRNUM   : 2;            /*!< [14..13] Trigger Process Number                                           */
            uint32_t            : 1;
      __IM  uint32_t TRGSTLAT   : 4;            /*!< [19..16] Trigger Status                                                   */
            uint32_t            : 4;
      __IM  uint32_t TRGSTERR   : 4;            /*!< [27..24] Error in Multiplexed Trigger Request                             */
            uint32_t            : 4;
    } ADC0_SC2_b;
  } ;

  union {
    __IOM uint32_t ADC0_SC3;                    /*!< (@ 0x00000094) Status and Control Register 3                              */

