nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t CLP9       : 7;            /*!< [6..0] Calibration Value                                                  */
            uint32_t            : 25;
    } ADC0_CLP9_b;
  } ;

  union {
    __IOM uint32_t ADC0_CLPS_OFS;               /*!< (@ 0x000000D0) ADC General Calibration Offset Value Register
                                                                    S                                                          */

    struct {
      __IOM uint32_t CLPS_OFS   : 4;            /*!< [3..0] CLPS Offset                                                        */
            uint32_t            : 28;
    } ADC0_CLPS_OFS_b;
  } ;

  union {
    __IOM uint32_t ADC0_CLP3_OFS;               /*!< (@ 0x000000D4) ADC Plus-Side General Calibration Offset Value
                                                                    Register 3                                                 */

    struct {
      __IOM uint32_t CLP3_OFS   : 4;            /*!< [3..0] CLP3 Offset                                                        */
            uint32_t            : 28;
    } ADC0_CLP3_OFS_b;
  } ;

  union {
    __IOM uint32_t ADC0_CLP2_OFS;               /*!< (@ 0x000000D8) ADC Plus-Side General Calibration Offset Value
                                                                    Register 2                                                 */

    struct {
      __IOM uint32_t CLP2_OFS   : 4;            /*!< [3..0] CLP2 Offset                                                        */
            uint32_t            : 28;
    } ADC0_CLP2_OFS_b;
  } ;

  union {
    __IOM uint32_t ADC0_CLP1_OFS;               /*!< (@ 0x000000DC) ADC Plus-Side General Calibration Offset Value
                                                                    Register 1                                                 */

    struct {
      __IOM uint32_t CLP1_OFS   : 4;            /*!< [3..0] CLP1 Offset                                                        */
            uint32_t            : 28;
    } ADC0_CLP1_OFS_b;
  } ;

  union {
    __IOM uint32_t ADC0_CLP0_OFS;               /*!< (@ 0x000000E0) ADC Plus-Side General Calibration Offset Value
                                                                    Register 0                                                 */

    struct {
      __IOM uint32_t CLP0_OFS   : 4;            /*!< [3..0] CLP0 Offset                                                        */
            uint32_t            : 28;
    } ADC0_CLP0_OFS_b;
  } ;

  union {
    __IOM uint32_t ADC0_CLPX_OFS;               /*!< (@ 0x000000E4) ADC Plus-Side General Calibration Offset Value
                                                                    Register X                                                 */

    struct {
      __IOM uint32_t CLPX_OFS   : 12;           /*!< [11..0] CLPX Offset                                                       */
            uint32_t            : 20;
    } ADC0_CLPX_OFS_b;
  } ;

  union {
    __IOM uint32_t ADC0_CLP9_OFS;               /*!< (@ 0x000000E8) ADC Plus-Side General Calibration Offset Value
                                                                    Register 9                                                 */

    struct {
      __IOM uint32_t CLP9_OFS   : 12;           /*!< [11..0] CLP9 Offset                                                       */
            uint32_t            : 20;
    } ADC0_CLP9_OFS_b;
  } ;
} ADC0_Type;                                    /*!< Size = 236 (0xec)                                                         */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Secure Real Time Clock (RTC)
  */

typedef struct {                                /*!< (@ 0x4003D000) RTC Structure                                              */

  union {
    __IOM uint32_t RTC_TSR;                     /*!< (@ 0x00000000) RTC Time Seconds Register                                  */

    struct {
      __IOM uint32_t TSR        : 32;           /*!< [31..0] Time Seconds Register                                             */
    } RTC_TSR_b;
  } ;

  union {
    __IOM uint32_t RTC_TPR;                     /*!< (@ 0x00000004) RTC Time Prescaler Register                                */

    struct {
      __IOM uint32_t TPR        : 16;           /*!< [15..0] Time Prescaler Register                                           */
            uint32_t            : 16;
    } RTC_TPR_b;
  } ;

  union {
    __IOM uint32_t RTC_TAR;                     /*!< (@ 0x00000008) RTC Time Alarm Register                                    */

    struct {
      __IOM uint32_t TAR        : 32;           /*!< [31..0] Time Alarm Register                                               */
    } RTC_TAR_b;
  } ;

  union {
    __IOM uint32_t RTC_TCR;                     /*!< (@ 0x0000000C) RTC Time Compensation Register                             */

    struct {
      __IOM uint32_t TCR        : 8;            /*!< [7..0] Time Compensation Register                                         */
      __IOM uint32_t CIR        : 8;            /*!< [15..8] Compensation Interval Register                                    */
      __IM  uint32_t TCV        : 8;            /*!< [23..16] Time Compensation Value                                          */
      __IM  uint32_t CIC        : 8;            /*!< [31..24] Compensation Interval Counter                                    */
    } RTC_TCR_b;
  } ;

  union {
    __IOM uint32_t RTC_CR;                      /*!< (@ 0x00000010) RTC Control Register                                       */

    struct {
      __IOM uint32_t SWR        : 1;            /*!< [0..0] Software Reset                                                     */
            uint32_t            : 1;
      __IOM uint32_t SUP        : 1;            /*!< [2..2] Supervisor Access                                                  */
      __IOM uint32_t UM         : 1;            /*!< [3..3] Update Mode                                                        */
            uint32_t            : 1;
      __IOM uint32_t CPS        : 1;            /*!< [5..5] Clock Pin Select                                                   */
            uint32_t            : 1;
      __IOM uint32_t LPOS       : 1;            /*!< [7..7] LPO Select                                                         */
            uint32_t            : 1;
      __IOM uint32_t CLKO       : 1;            /*!< [9..9] Clock Output                                                       */
            uint32_t            : 14;
      __IOM uint32_t CPE        : 1;            /*!< [24..24] Clock Pin Enable                                                 */
            uint32_t            : 7;
    } RTC_CR_b;
  } ;

  union {
    __IOM uint32_t RTC_SR;                      /*!< (@ 0x00000014) RTC Status Register                                        */

