nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint32_t TIF        : 1;            /*!< [0..0] Time Invalid Flag                                                  */
      __IM  uint32_t TOF        : 1;            /*!< [1..1] Time Overflow Flag                                                 */
      __IM  uint32_t TAF        : 1;            /*!< [2..2] Time Alarm Flag                                                    */
            uint32_t            : 1;
      __IOM uint32_t TCE        : 1;            /*!< [4..4] Time Counter Enable                                                */
            uint32_t            : 27;
    } RTC_SR_b;
  } ;

  union {
    __IOM uint32_t RTC_LR;                      /*!< (@ 0x00000018) RTC Lock Register                                          */

    struct {
            uint32_t            : 3;
      __IOM uint32_t TCL        : 1;            /*!< [3..3] Time Compensation Lock                                             */
      __IOM uint32_t CRL        : 1;            /*!< [4..4] Control Register Lock                                              */
      __IOM uint32_t SRL        : 1;            /*!< [5..5] Status Register Lock                                               */
      __IOM uint32_t LRL        : 1;            /*!< [6..6] Lock Register Lock                                                 */
            uint32_t            : 25;
    } RTC_LR_b;
  } ;

  union {
    __IOM uint32_t RTC_IER;                     /*!< (@ 0x0000001C) RTC Interrupt Enable Register                              */

    struct {
      __IOM uint32_t TIIE       : 1;            /*!< [0..0] Time Invalid Interrupt Enable                                      */
      __IOM uint32_t TOIE       : 1;            /*!< [1..1] Time Overflow Interrupt Enable                                     */
      __IOM uint32_t TAIE       : 1;            /*!< [2..2] Time Alarm Interrupt Enable                                        */
            uint32_t            : 1;
      __IOM uint32_t TSIE       : 1;            /*!< [4..4] Time Seconds Interrupt Enable                                      */
            uint32_t            : 11;
      __IOM uint32_t TSIC       : 3;            /*!< [18..16] Timer Seconds Interrupt Configuration                            */
            uint32_t            : 13;
    } RTC_IER_b;
  } ;
} RTC_Type;                                     /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                         CMU_FC_0                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CMU_FC (CMU_FC_0)
  */

typedef struct {                                /*!< (@ 0x4003E000) CMU_FC_0 Structure                                         */

  union {
    __IOM uint32_t CMU_FC_0_GCR;                /*!< (@ 0x00000000) CMU Frequency Check Global Configuration Register          */

    struct {
      __IOM uint32_t FCE        : 1;            /*!< [0..0] Frequency Check Enable                                             */
            uint32_t            : 31;
    } CMU_FC_0_GCR_b;
  } ;

  union {
    __IOM uint32_t CMU_FC_0_RCCR;               /*!< (@ 0x00000004) CMU Frequency Check Reference Count Configuration
                                                                    Register                                                   */

    struct {
      __IOM uint32_t REF_CNT    : 16;           /*!< [15..0] Reference Clock Count                                             */
            uint32_t            : 16;
    } CMU_FC_0_RCCR_b;
  } ;

  union {
    __IOM uint32_t CMU_FC_0_HTCR;               /*!< (@ 0x00000008) CMU Frequency Check High Threshold Configuration
                                                                    Register                                                   */

    struct {
      __IOM uint32_t HFREF      : 24;           /*!< [23..0] High Frequency Reference Threshold                                */
            uint32_t            : 8;
    } CMU_FC_0_HTCR_b;
  } ;

  union {
    __IOM uint32_t CMU_FC_0_LTCR;               /*!< (@ 0x0000000C) CMU Frequency Check Low Threshold Configuration
                                                                    Register                                                   */

    struct {
      __IOM uint32_t LFREF      : 24;           /*!< [23..0] Low Frequency Reference Threshold                                 */
            uint32_t            : 8;
    } CMU_FC_0_LTCR_b;
  } ;

  union {
    __IOM uint32_t CMU_FC_0_SR;                 /*!< (@ 0x00000010) CMU Frequency Check Status Register                        */

    struct {
      __IOM uint32_t FLL        : 1;            /*!< [0..0] Frequency Lower than Low Frequency Reference Threshold
                                                     Event Status                                                              */
      __IOM uint32_t FHH        : 1;            /*!< [1..1] Frequency Higher than High Frequency Reference Threshold
                                                     Event Status                                                              */
      __IM  uint32_t STATE      : 2;            /*!< [3..2] Module State                                                       */
      __IM  uint32_t RS         : 1;            /*!< [4..4] Run Status                                                         */
            uint32_t            : 27;
    } CMU_FC_0_SR_b;
  } ;

  union {
    __IOM uint32_t CMU_FC_0_IER;                /*!< (@ 0x00000014) CMU Frequency Check Interrupt/Event Enable Register        */

    struct {
      __IOM uint32_t FLLIE      : 1;            /*!< [0..0] Frequency Lower than Low Frequency Reference Threshold
                                                     Interrupt Enable                                                          */
      __IOM uint32_t FHHIE      : 1;            /*!< [1..1] Frequency Higher than High Frequency Reference Threshold
                                                     Interrupt Enable                                                          */
      __IOM uint32_t FLLAEE     : 1;            /*!< [2..2] Frequency Lower than Low Frequency Reference Threshold
                                                     Asynchronous Event Enable                                                 */
      __IOM uint32_t FHHAEE     : 1;            /*!< [3..3] Frequency Higher than High Frequency Reference Threshold
                                                     Asynchronous Event Enable                                                 */
            uint32_t            : 28;
    } CMU_FC_0_IER_b;
  } ;
} CMU_FC_0_Type;                                /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                         CMU_FC_1                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CMU_FC (CMU_FC_1)
  */

typedef struct {                                /*!< (@ 0x4003F000) CMU_FC_1 Structure                                         */

  union {
    __IOM uint32_t CMU_FC_1_GCR;                /*!< (@ 0x00000000) CMU Frequency Check Global Configuration Register          */

