nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t FCE        : 1;            /*!< [0..0] Frequency Check Enable                                             */
            uint32_t            : 31;
    } CMU_FC_1_GCR_b;
  } ;

  union {
    __IOM uint32_t CMU_FC_1_RCCR;               /*!< (@ 0x00000004) CMU Frequency Check Reference Count Configuration
                                                                    Register                                                   */

    struct {
      __IOM uint32_t REF_CNT    : 16;           /*!< [15..0] Reference Clock Count                                             */
            uint32_t            : 16;
    } CMU_FC_1_RCCR_b;
  } ;

  union {
    __IOM uint32_t CMU_FC_1_HTCR;               /*!< (@ 0x00000008) CMU Frequency Check High Threshold Configuration
                                                                    Register                                                   */

    struct {
      __IOM uint32_t HFREF      : 24;           /*!< [23..0] High Frequency Reference Threshold                                */
            uint32_t            : 8;
    } CMU_FC_1_HTCR_b;
  } ;

  union {
    __IOM uint32_t CMU_FC_1_LTCR;               /*!< (@ 0x0000000C) CMU Frequency Check Low Threshold Configuration
                                                                    Register                                                   */

    struct {
      __IOM uint32_t LFREF      : 24;           /*!< [23..0] Low Frequency Reference Threshold                                 */
            uint32_t            : 8;
    } CMU_FC_1_LTCR_b;
  } ;

  union {
    __IOM uint32_t CMU_FC_1_SR;                 /*!< (@ 0x00000010) CMU Frequency Check Status Register                        */

    struct {
      __IOM uint32_t FLL        : 1;            /*!< [0..0] Frequency Lower than Low Frequency Reference Threshold
                                                     Event Status                                                              */
      __IOM uint32_t FHH        : 1;            /*!< [1..1] Frequency Higher than High Frequency Reference Threshold
                                                     Event Status                                                              */
      __IM  uint32_t STATE      : 2;            /*!< [3..2] Module State                                                       */
      __IM  uint32_t RS         : 1;            /*!< [4..4] Run Status                                                         */
            uint32_t            : 27;
    } CMU_FC_1_SR_b;
  } ;

  union {
    __IOM uint32_t CMU_FC_1_IER;                /*!< (@ 0x00000014) CMU Frequency Check Interrupt/Event Enable Register        */

    struct {
      __IOM uint32_t FLLIE      : 1;            /*!< [0..0] Frequency Lower than Low Frequency Reference Threshold
                                                     Interrupt Enable                                                          */
      __IOM uint32_t FHHIE      : 1;            /*!< [1..1] Frequency Higher than High Frequency Reference Threshold
                                                     Interrupt Enable                                                          */
      __IOM uint32_t FLLAEE     : 1;            /*!< [2..2] Frequency Lower than Low Frequency Reference Threshold
                                                     Asynchronous Event Enable                                                 */
      __IOM uint32_t FHHAEE     : 1;            /*!< [3..3] Frequency Higher than High Frequency Reference Threshold
                                                     Asynchronous Event Enable                                                 */
            uint32_t            : 28;
    } CMU_FC_1_IER_b;
  } ;
} CMU_FC_1_Type;                                /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                          LPTMR0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Low Power Timer (LPTMR0)
  */

typedef struct {                                /*!< (@ 0x40040000) LPTMR0 Structure                                           */

  union {
    __IOM uint32_t LPTMR0_CSR;                  /*!< (@ 0x00000000) Low Power Timer Control Status Register                    */

    struct {
      __IOM uint32_t TEN        : 1;            /*!< [0..0] Timer Enable                                                       */
      __IOM uint32_t TMS        : 1;            /*!< [1..1] Timer Mode Select                                                  */
      __IOM uint32_t TFC        : 1;            /*!< [2..2] Timer Free-Running Counter                                         */
      __IOM uint32_t TPP        : 1;            /*!< [3..3] Timer Pin Polarity                                                 */
      __IOM uint32_t TPS        : 2;            /*!< [5..4] Timer Pin Select                                                   */
      __IOM uint32_t TIE        : 1;            /*!< [6..6] Timer Interrupt Enable                                             */
      __IOM uint32_t TCF        : 1;            /*!< [7..7] Timer Compare Flag                                                 */
      __IOM uint32_t TDRE       : 1;            /*!< [8..8] Timer DMA Request Enable                                           */
            uint32_t            : 23;
    } LPTMR0_CSR_b;
  } ;

  union {
    __IOM uint32_t LPTMR0_PSR;                  /*!< (@ 0x00000004) Low Power Timer Prescale Register                          */

    struct {
      __IOM uint32_t PCS        : 2;            /*!< [1..0] Prescaler Clock Select                                             */
      __IOM uint32_t PBYP       : 1;            /*!< [2..2] Prescaler Bypass                                                   */
      __IOM uint32_t PRESCALE   : 4;            /*!< [6..3] Prescale Value                                                     */
            uint32_t            : 25;
    } LPTMR0_PSR_b;
  } ;

  union {
    __IOM uint32_t LPTMR0_CMR;                  /*!< (@ 0x00000008) Low Power Timer Compare Register                           */

