nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint32_t UID31_0    : 32;           /*!< [31..0] Unique Identification                                             */
    } SIM_UIDL_b;
  } ;
  __IM  uint32_t  RESERVED6;

  union {
    __IOM uint32_t SIM_CLKDIV4;                 /*!< (@ 0x00000068) System Clock Divider Register 4                            */

    struct {
      __IOM uint32_t TRACEFRAC  : 1;            /*!< [0..0] Trace Clock Divider fraction To configure TRACEDIV and
                                                     TRACEFRAC, you must first clear TRACEDIVEN to disable the
                                                     trace clock divide function.                                              */
      __IOM uint32_t TRACEDIV   : 3;            /*!< [3..1] Trace Clock Divider value To configure TRACEDIV, you
                                                     must first disable TRACEDIVEN, then enable it after setting
                                                     TRACEDIV.                                                                 */
            uint32_t            : 24;
      __IOM uint32_t TRACEDIVEN : 1;            /*!< [28..28] Debug Trace Divider control                                      */
            uint32_t            : 3;
    } SIM_CLKDIV4_b;
  } ;

  union {
    __IOM uint32_t SIM_MISCTRL1;                /*!< (@ 0x0000006C) Miscellaneous Control register 1                           */

    struct {
      __IOM uint32_t SW_TRG     : 1;            /*!< [0..0] Software trigger to TRGMUX. Writing to this bit generates
                                                     software trigger to peripherals through TRGMUX (Refer to
                                                     Figure: Trigger interconnectivity).                                       */
            uint32_t            : 31;
    } SIM_MISCTRL1_b;
  } ;
} SIM_Type;                                     /*!< Size = 112 (0x70)                                                         */



/* =========================================================================================================================== */
/* ================                                           PORTA                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Pin Control and Interrupts (PORTA)
  */

typedef struct {                                /*!< (@ 0x40049000) PORTA Structure                                            */

  union {
    __IOM uint32_t PORTA_PCR0;                  /*!< (@ 0x00000000) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTA_PCR0_b;
  } ;

  union {
    __IOM uint32_t PORTA_PCR1;                  /*!< (@ 0x00000004) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTA_PCR1_b;
  } ;

  union {
    __IOM uint32_t PORTA_PCR2;                  /*!< (@ 0x00000008) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTA_PCR2_b;
  } ;

  union {
    __IOM uint32_t PORTA_PCR3;                  /*!< (@ 0x0000000C) Pin Control Register n                                     */

