nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTA_PCR27_b;
  } ;

  union {
    __IOM uint32_t PORTA_PCR28;                 /*!< (@ 0x00000070) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTA_PCR28_b;
  } ;

  union {
    __IOM uint32_t PORTA_PCR29;                 /*!< (@ 0x00000074) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTA_PCR29_b;
  } ;

  union {
    __IOM uint32_t PORTA_PCR30;                 /*!< (@ 0x00000078) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTA_PCR30_b;
  } ;

  union {
    __IOM uint32_t PORTA_PCR31;                 /*!< (@ 0x0000007C) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTA_PCR31_b;
  } ;

  union {
    __OM  uint32_t PORTA_GPCLR;                 /*!< (@ 0x00000080) Global Pin Control Low Register                            */

    struct {
      __OM  uint32_t GPWD       : 16;           /*!< [15..0] Global Pin Write Data                                             */
      __OM  uint32_t GPWE       : 16;           /*!< [31..16] Global Pin Write Enable                                          */
    } PORTA_GPCLR_b;
  } ;

  union {
    __OM  uint32_t PORTA_GPCHR;                 /*!< (@ 0x00000084) Global Pin Control High Register                           */

    struct {
      __OM  uint32_t GPWD       : 16;           /*!< [15..0] Global Pin Write Data                                             */
      __OM  uint32_t GPWE       : 16;           /*!< [31..16] Global Pin Write Enable                                          */
    } PORTA_GPCHR_b;
  } ;

  union {
    __OM  uint32_t PORTA_GICLR;                 /*!< (@ 0x00000088) Global Interrupt Control Low Register                      */

