nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __OM  uint32_t GIWE       : 16;           /*!< [15..0] Global Interrupt Write Enable                                     */
      __OM  uint32_t GIWD       : 16;           /*!< [31..16] Global Interrupt Write Data                                      */
    } PORTA_GICLR_b;
  } ;

  union {
    __OM  uint32_t PORTA_GICHR;                 /*!< (@ 0x0000008C) Global Interrupt Control High Register                     */

    struct {
      __OM  uint32_t GIWE       : 16;           /*!< [15..0] Global Interrupt Write Enable                                     */
      __OM  uint32_t GIWD       : 16;           /*!< [31..16] Global Interrupt Write Data                                      */
    } PORTA_GICHR_b;
  } ;
  __IM  uint32_t  RESERVED[4];

  union {
    __IOM uint32_t PORTA_ISFR;                  /*!< (@ 0x000000A0) Interrupt Status Flag Register                             */

    struct {
      __IOM uint32_t ISF        : 32;           /*!< [31..0] Interrupt Status Flag                                             */
    } PORTA_ISFR_b;
  } ;
  __IM  uint32_t  RESERVED1[7];

  union {
    __IOM uint32_t PORTA_DFER;                  /*!< (@ 0x000000C0) Digital Filter Enable Register                             */

    struct {
      __IOM uint32_t DFE        : 32;           /*!< [31..0] Digital Filter Enable                                             */
    } PORTA_DFER_b;
  } ;

  union {
    __IOM uint32_t PORTA_DFCR;                  /*!< (@ 0x000000C4) Digital Filter Clock Register                              */

    struct {
      __IOM uint32_t CS         : 1;            /*!< [0..0] Clock Source                                                       */
            uint32_t            : 31;
    } PORTA_DFCR_b;
  } ;

  union {
    __IOM uint32_t PORTA_DFWR;                  /*!< (@ 0x000000C8) Digital Filter Width Register                              */

    struct {
      __IOM uint32_t FILT       : 5;            /*!< [4..0] Filter Length                                                      */
            uint32_t            : 27;
    } PORTA_DFWR_b;
  } ;
} PORTA_Type;                                   /*!< Size = 204 (0xcc)                                                         */



/* =========================================================================================================================== */
/* ================                                           PORTB                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Pin Control and Interrupts (PORTB)
  */

typedef struct {                                /*!< (@ 0x4004A000) PORTB Structure                                            */

  union {
    __IOM uint32_t PORTB_PCR0;                  /*!< (@ 0x00000000) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTB_PCR0_b;
  } ;

  union {
    __IOM uint32_t PORTB_PCR1;                  /*!< (@ 0x00000004) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTB_PCR1_b;
  } ;

  union {
    __IOM uint32_t PORTB_PCR2;                  /*!< (@ 0x00000008) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTB_PCR2_b;
  } ;

  union {
    __IOM uint32_t PORTB_PCR3;                  /*!< (@ 0x0000000C) Pin Control Register n                                     */

