nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTB_PCR20_b;
  } ;

  union {
    __IOM uint32_t PORTB_PCR21;                 /*!< (@ 0x00000054) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTB_PCR21_b;
  } ;

  union {
    __IOM uint32_t PORTB_PCR22;                 /*!< (@ 0x00000058) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTB_PCR22_b;
  } ;

  union {
    __IOM uint32_t PORTB_PCR23;                 /*!< (@ 0x0000005C) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTB_PCR23_b;
  } ;

  union {
    __IOM uint32_t PORTB_PCR24;                 /*!< (@ 0x00000060) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTB_PCR24_b;
  } ;

  union {
    __IOM uint32_t PORTB_PCR25;                 /*!< (@ 0x00000064) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTB_PCR25_b;
  } ;

  union {
    __IOM uint32_t PORTB_PCR26;                 /*!< (@ 0x00000068) Pin Control Register n                                     */

