nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __OM  uint32_t GPWD       : 16;           /*!< [15..0] Global Pin Write Data                                             */
      __OM  uint32_t GPWE       : 16;           /*!< [31..16] Global Pin Write Enable                                          */
    } PORTD_GPCLR_b;
  } ;

  union {
    __OM  uint32_t PORTD_GPCHR;                 /*!< (@ 0x00000084) Global Pin Control High Register                           */

    struct {
      __OM  uint32_t GPWD       : 16;           /*!< [15..0] Global Pin Write Data                                             */
      __OM  uint32_t GPWE       : 16;           /*!< [31..16] Global Pin Write Enable                                          */
    } PORTD_GPCHR_b;
  } ;

  union {
    __OM  uint32_t PORTD_GICLR;                 /*!< (@ 0x00000088) Global Interrupt Control Low Register                      */

    struct {
      __OM  uint32_t GIWE       : 16;           /*!< [15..0] Global Interrupt Write Enable                                     */
      __OM  uint32_t GIWD       : 16;           /*!< [31..16] Global Interrupt Write Data                                      */
    } PORTD_GICLR_b;
  } ;

  union {
    __OM  uint32_t PORTD_GICHR;                 /*!< (@ 0x0000008C) Global Interrupt Control High Register                     */

    struct {
      __OM  uint32_t GIWE       : 16;           /*!< [15..0] Global Interrupt Write Enable                                     */
      __OM  uint32_t GIWD       : 16;           /*!< [31..16] Global Interrupt Write Data                                      */
    } PORTD_GICHR_b;
  } ;
  __IM  uint32_t  RESERVED[4];

  union {
    __IOM uint32_t PORTD_ISFR;                  /*!< (@ 0x000000A0) Interrupt Status Flag Register                             */

    struct {
      __IOM uint32_t ISF        : 32;           /*!< [31..0] Interrupt Status Flag                                             */
    } PORTD_ISFR_b;
  } ;
  __IM  uint32_t  RESERVED1[7];

  union {
    __IOM uint32_t PORTD_DFER;                  /*!< (@ 0x000000C0) Digital Filter Enable Register                             */

    struct {
      __IOM uint32_t DFE        : 32;           /*!< [31..0] Digital Filter Enable                                             */
    } PORTD_DFER_b;
  } ;

  union {
    __IOM uint32_t PORTD_DFCR;                  /*!< (@ 0x000000C4) Digital Filter Clock Register                              */

    struct {
      __IOM uint32_t CS         : 1;            /*!< [0..0] Clock Source                                                       */
            uint32_t            : 31;
    } PORTD_DFCR_b;
  } ;

  union {
    __IOM uint32_t PORTD_DFWR;                  /*!< (@ 0x000000C8) Digital Filter Width Register                              */

    struct {
      __IOM uint32_t FILT       : 5;            /*!< [4..0] Filter Length                                                      */
            uint32_t            : 27;
    } PORTD_DFWR_b;
  } ;
} PORTD_Type;                                   /*!< Size = 204 (0xcc)                                                         */



/* =========================================================================================================================== */
/* ================                                           PORTE                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Pin Control and Interrupts (PORTE)
  */

typedef struct {                                /*!< (@ 0x4004D000) PORTE Structure                                            */

  union {
    __IOM uint32_t PORTE_PCR0;                  /*!< (@ 0x00000000) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 4;
      __IOM uint32_t DSE        : 1;            /*!< [6..6] Drive Strength Enable                                              */
            uint32_t            : 1;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTE_PCR0_b;
  } ;

  union {
    __IOM uint32_t PORTE_PCR1;                  /*!< (@ 0x00000004) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 4;
      __IOM uint32_t DSE        : 1;            /*!< [6..6] Drive Strength Enable                                              */
            uint32_t            : 1;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTE_PCR1_b;
  } ;

  union {
    __IOM uint32_t PORTE_PCR2;                  /*!< (@ 0x00000008) Pin Control Register n                                     */

