nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTE_PCR31_b;
  } ;

  union {
    __OM  uint32_t PORTE_GPCLR;                 /*!< (@ 0x00000080) Global Pin Control Low Register                            */

    struct {
      __OM  uint32_t GPWD       : 16;           /*!< [15..0] Global Pin Write Data                                             */
      __OM  uint32_t GPWE       : 16;           /*!< [31..16] Global Pin Write Enable                                          */
    } PORTE_GPCLR_b;
  } ;

  union {
    __OM  uint32_t PORTE_GPCHR;                 /*!< (@ 0x00000084) Global Pin Control High Register                           */

    struct {
      __OM  uint32_t GPWD       : 16;           /*!< [15..0] Global Pin Write Data                                             */
      __OM  uint32_t GPWE       : 16;           /*!< [31..16] Global Pin Write Enable                                          */
    } PORTE_GPCHR_b;
  } ;

  union {
    __OM  uint32_t PORTE_GICLR;                 /*!< (@ 0x00000088) Global Interrupt Control Low Register                      */

    struct {
      __OM  uint32_t GIWE       : 16;           /*!< [15..0] Global Interrupt Write Enable                                     */
      __OM  uint32_t GIWD       : 16;           /*!< [31..16] Global Interrupt Write Data                                      */
    } PORTE_GICLR_b;
  } ;

  union {
    __OM  uint32_t PORTE_GICHR;                 /*!< (@ 0x0000008C) Global Interrupt Control High Register                     */

    struct {
      __OM  uint32_t GIWE       : 16;           /*!< [15..0] Global Interrupt Write Enable                                     */
      __OM  uint32_t GIWD       : 16;           /*!< [31..16] Global Interrupt Write Data                                      */
    } PORTE_GICHR_b;
  } ;
  __IM  uint32_t  RESERVED[4];

  union {
    __IOM uint32_t PORTE_ISFR;                  /*!< (@ 0x000000A0) Interrupt Status Flag Register                             */

    struct {
      __IOM uint32_t ISF        : 32;           /*!< [31..0] Interrupt Status Flag                                             */
    } PORTE_ISFR_b;
  } ;
  __IM  uint32_t  RESERVED1[7];

  union {
    __IOM uint32_t PORTE_DFER;                  /*!< (@ 0x000000C0) Digital Filter Enable Register                             */

    struct {
      __IOM uint32_t DFE        : 32;           /*!< [31..0] Digital Filter Enable                                             */
    } PORTE_DFER_b;
  } ;

  union {
    __IOM uint32_t PORTE_DFCR;                  /*!< (@ 0x000000C4) Digital Filter Clock Register                              */

    struct {
      __IOM uint32_t CS         : 1;            /*!< [0..0] Clock Source                                                       */
            uint32_t            : 31;
    } PORTE_DFCR_b;
  } ;

  union {
    __IOM uint32_t PORTE_DFWR;                  /*!< (@ 0x000000C8) Digital Filter Width Register                              */

    struct {
      __IOM uint32_t FILT       : 5;            /*!< [4..0] Filter Length                                                      */
            uint32_t            : 27;
    } PORTE_DFWR_b;
  } ;
} PORTE_Type;                                   /*!< Size = 204 (0xcc)                                                         */



/* =========================================================================================================================== */
/* ================                                           WDOG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Watchdog timer (WDOG)
  */

typedef struct {                                /*!< (@ 0x40052000) WDOG Structure                                             */

  union {
    __IOM uint32_t WDOG_CS;                     /*!< (@ 0x00000000) Watchdog Control and Status Register                       */

    struct {
      __IOM uint32_t STOP       : 1;            /*!< [0..0] Stop Enable                                                        */
      __IOM uint32_t WAIT       : 1;            /*!< [1..1] Wait Enable                                                        */
      __IOM uint32_t DBG        : 1;            /*!< [2..2] Debug Enable                                                       */
      __IOM uint32_t TST        : 2;            /*!< [4..3] Watchdog Test                                                      */
      __IOM uint32_t UPDATE     : 1;            /*!< [5..5] Allow updates                                                      */
      __IOM uint32_t INT        : 1;            /*!< [6..6] Watchdog Interrupt                                                 */
      __IOM uint32_t EN         : 1;            /*!< [7..7] Watchdog Enable                                                    */
      __IOM uint32_t CLK        : 2;            /*!< [9..8] Watchdog Clock                                                     */
      __IM  uint32_t RCS        : 1;            /*!< [10..10] Reconfiguration Success                                          */
      __IM  uint32_t ULK        : 1;            /*!< [11..11] Unlock status                                                    */
      __IOM uint32_t PRES       : 1;            /*!< [12..12] Watchdog prescaler                                               */
      __IOM uint32_t CMD32EN    : 1;            /*!< [13..13] Enables or disables WDOG support for 32-bit (otherwise
                                                     16-bit or 8-bit) refresh/unlock command write words                       */
      __IOM uint32_t FLG        : 1;            /*!< [14..14] Watchdog Interrupt Flag                                          */
      __IOM uint32_t WIN        : 1;            /*!< [15..15] Watchdog Window                                                  */
            uint32_t            : 16;
    } WDOG_CS_b;
  } ;

  union {
    __IOM uint32_t WDOG_CNT;                    /*!< (@ 0x00000004) Watchdog Counter Register                                  */

