nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t CNTLOW     : 8;            /*!< [7..0] Low byte of the Watchdog Counter                                   */
      __IOM uint32_t CNTHIGH    : 8;            /*!< [15..8] High byte of the Watchdog Counter                                 */
            uint32_t            : 16;
    } WDOG_CNT_b;
  } ;

  union {
    __IOM uint32_t WDOG_TOVAL;                  /*!< (@ 0x00000008) Watchdog Timeout Value Register                            */

    struct {
      __IOM uint32_t TOVALLOW   : 8;            /*!< [7..0] Low byte of the timeout value                                      */
      __IOM uint32_t TOVALHIGH  : 8;            /*!< [15..8] High byte of the timeout value                                    */
            uint32_t            : 16;
    } WDOG_TOVAL_b;
  } ;

  union {
    __IOM uint32_t WDOG_WIN;                    /*!< (@ 0x0000000C) Watchdog Window Register                                   */

    struct {
      __IOM uint32_t WINLOW     : 8;            /*!< [7..0] Low byte of Watchdog Window                                        */
      __IOM uint32_t WINHIGH    : 8;            /*!< [15..8] High byte of Watchdog Window                                      */
            uint32_t            : 16;
    } WDOG_WIN_b;
  } ;
} WDOG_Type;                                    /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                          FLEXIO                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief The FLEXIO Memory Map/Register Definition can be found here. (FLEXIO)
  */

typedef struct {                                /*!< (@ 0x4005A000) FLEXIO Structure                                           */

  union {
    __IM  uint32_t FLEXIO_VERID;                /*!< (@ 0x00000000) Version ID Register                                        */

    struct {
      __IM  uint32_t FEATURE    : 16;           /*!< [15..0] Feature Specification Number                                      */
      __IM  uint32_t MINOR      : 8;            /*!< [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /*!< [31..24] Major Version Number                                             */
    } FLEXIO_VERID_b;
  } ;

  union {
    __IM  uint32_t FLEXIO_PARAM;                /*!< (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t SHIFTER    : 8;            /*!< [7..0] Shifter Number                                                     */
      __IM  uint32_t TIMER      : 8;            /*!< [15..8] Timer Number                                                      */
      __IM  uint32_t PIN        : 8;            /*!< [23..16] Pin Number                                                       */
      __IM  uint32_t TRIGGER    : 8;            /*!< [31..24] Trigger Number                                                   */
    } FLEXIO_PARAM_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_CTRL;                 /*!< (@ 0x00000008) FlexIO Control Register                                    */

    struct {
      __IOM uint32_t FLEXEN     : 1;            /*!< [0..0] FlexIO Enable                                                      */
      __IOM uint32_t SWRST      : 1;            /*!< [1..1] Software Reset                                                     */
      __IOM uint32_t FASTACC    : 1;            /*!< [2..2] Fast Access                                                        */
            uint32_t            : 27;
      __IOM uint32_t DBGE       : 1;            /*!< [30..30] Debug Enable                                                     */
      __IOM uint32_t DOZEN      : 1;            /*!< [31..31] Doze Enable                                                      */
    } FLEXIO_CTRL_b;
  } ;

  union {
    __IM  uint32_t FLEXIO_PIN;                  /*!< (@ 0x0000000C) Pin State Register                                         */

    struct {
      __IM  uint32_t PDI        : 8;            /*!< [7..0] Pin Data Input                                                     */
            uint32_t            : 24;
    } FLEXIO_PIN_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTSTAT;            /*!< (@ 0x00000010) Shifter Status Register                                    */

    struct {
      __IOM uint32_t SSF        : 4;            /*!< [3..0] Shifter Status Flag                                                */
            uint32_t            : 28;
    } FLEXIO_SHIFTSTAT_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTERR;             /*!< (@ 0x00000014) Shifter Error Register                                     */

    struct {
      __IOM uint32_t SEF        : 4;            /*!< [3..0] Shifter Error Flags                                                */
            uint32_t            : 28;
    } FLEXIO_SHIFTERR_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_TIMSTAT;              /*!< (@ 0x00000018) Timer Status Register                                      */

    struct {
      __IOM uint32_t TSF        : 4;            /*!< [3..0] Timer Status Flags                                                 */
            uint32_t            : 28;
    } FLEXIO_TIMSTAT_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t FLEXIO_SHIFTSIEN;            /*!< (@ 0x00000020) Shifter Status Interrupt Enable                            */

    struct {
      __IOM uint32_t SSIE       : 4;            /*!< [3..0] Shifter Status Interrupt Enable                                    */
            uint32_t            : 28;
    } FLEXIO_SHIFTSIEN_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTEIEN;            /*!< (@ 0x00000024) Shifter Error Interrupt Enable                             */

