nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t SHIFTBUFBBS : 32;          /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUFBBS0_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTBUFBBS1;         /*!< (@ 0x00000384) Shifter Buffer N Bit Byte Swapped Register                 */

    struct {
      __IOM uint32_t SHIFTBUFBBS : 32;          /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUFBBS1_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTBUFBBS2;         /*!< (@ 0x00000388) Shifter Buffer N Bit Byte Swapped Register                 */

    struct {
      __IOM uint32_t SHIFTBUFBBS : 32;          /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUFBBS2_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTBUFBBS3;         /*!< (@ 0x0000038C) Shifter Buffer N Bit Byte Swapped Register                 */

    struct {
      __IOM uint32_t SHIFTBUFBBS : 32;          /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUFBBS3_b;
  } ;
  __IM  uint32_t  RESERVED8[28];

  union {
    __IOM uint32_t FLEXIO_TIMCTL0;              /*!< (@ 0x00000400) Timer Control N Register                                   */

    struct {
      __IOM uint32_t TIMOD      : 2;            /*!< [1..0] Timer Mode                                                         */
            uint32_t            : 5;
      __IOM uint32_t PINPOL     : 1;            /*!< [7..7] Timer Pin Polarity                                                 */
      __IOM uint32_t PINSEL     : 3;            /*!< [10..8] Timer Pin Select                                                  */
            uint32_t            : 5;
      __IOM uint32_t PINCFG     : 2;            /*!< [17..16] Timer Pin Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t TRGSRC     : 1;            /*!< [22..22] Trigger Source                                                   */
      __IOM uint32_t TRGPOL     : 1;            /*!< [23..23] Trigger Polarity                                                 */
      __IOM uint32_t TRGSEL     : 4;            /*!< [27..24] Trigger Select                                                   */
            uint32_t            : 4;
    } FLEXIO_TIMCTL0_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_TIMCTL1;              /*!< (@ 0x00000404) Timer Control N Register                                   */

    struct {
      __IOM uint32_t TIMOD      : 2;            /*!< [1..0] Timer Mode                                                         */
            uint32_t            : 5;
      __IOM uint32_t PINPOL     : 1;            /*!< [7..7] Timer Pin Polarity                                                 */
      __IOM uint32_t PINSEL     : 3;            /*!< [10..8] Timer Pin Select                                                  */
            uint32_t            : 5;
      __IOM uint32_t PINCFG     : 2;            /*!< [17..16] Timer Pin Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t TRGSRC     : 1;            /*!< [22..22] Trigger Source                                                   */
      __IOM uint32_t TRGPOL     : 1;            /*!< [23..23] Trigger Polarity                                                 */
      __IOM uint32_t TRGSEL     : 4;            /*!< [27..24] Trigger Select                                                   */
            uint32_t            : 4;
    } FLEXIO_TIMCTL1_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_TIMCTL2;              /*!< (@ 0x00000408) Timer Control N Register                                   */

    struct {
      __IOM uint32_t TIMOD      : 2;            /*!< [1..0] Timer Mode                                                         */
            uint32_t            : 5;
      __IOM uint32_t PINPOL     : 1;            /*!< [7..7] Timer Pin Polarity                                                 */
      __IOM uint32_t PINSEL     : 3;            /*!< [10..8] Timer Pin Select                                                  */
            uint32_t            : 5;
      __IOM uint32_t PINCFG     : 2;            /*!< [17..16] Timer Pin Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t TRGSRC     : 1;            /*!< [22..22] Trigger Source                                                   */
      __IOM uint32_t TRGPOL     : 1;            /*!< [23..23] Trigger Polarity                                                 */
      __IOM uint32_t TRGSEL     : 4;            /*!< [27..24] Trigger Select                                                   */
            uint32_t            : 4;
    } FLEXIO_TIMCTL2_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_TIMCTL3;              /*!< (@ 0x0000040C) Timer Control N Register                                   */

    struct {
      __IOM uint32_t TIMOD      : 2;            /*!< [1..0] Timer Mode                                                         */
            uint32_t            : 5;
      __IOM uint32_t PINPOL     : 1;            /*!< [7..7] Timer Pin Polarity                                                 */
      __IOM uint32_t PINSEL     : 3;            /*!< [10..8] Timer Pin Select                                                  */
            uint32_t            : 5;
      __IOM uint32_t PINCFG     : 2;            /*!< [17..16] Timer Pin Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t TRGSRC     : 1;            /*!< [22..22] Trigger Source                                                   */
      __IOM uint32_t TRGPOL     : 1;            /*!< [23..23] Trigger Polarity                                                 */
      __IOM uint32_t TRGSEL     : 4;            /*!< [27..24] Trigger Select                                                   */
            uint32_t            : 4;
    } FLEXIO_TIMCTL3_b;
  } ;
  __IM  uint32_t  RESERVED9[28];

  union {
    __IOM uint32_t FLEXIO_TIMCFG0;              /*!< (@ 0x00000480) Timer Configuration N Register                             */

