nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t CMP        : 16;           /*!< [15..0] Timer Compare Value                                               */
            uint32_t            : 16;
    } FLEXIO_TIMCMP2_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_TIMCMP3;              /*!< (@ 0x0000050C) Timer Compare N Register                                   */

    struct {
      __IOM uint32_t CMP        : 16;           /*!< [15..0] Timer Compare Value                                               */
            uint32_t            : 16;
    } FLEXIO_TIMCMP3_b;
  } ;
} FLEXIO_Type;                                  /*!< Size = 1296 (0x510)                                                       */



/* =========================================================================================================================== */
/* ================                                          TRGMUX                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief TRGMUX (TRGMUX)
  */

typedef struct {                                /*!< (@ 0x40063000) TRGMUX Structure                                           */

  union {
    __IOM uint32_t TRGMUX_DMAMUX0;              /*!< (@ 0x00000000) TRGMUX DMAMUX0 Register                                    */

    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 2;
      __IOM uint32_t SEL1       : 6;            /*!< [13..8] Trigger MUX Input 1 Source Select                                 */
            uint32_t            : 2;
      __IOM uint32_t SEL2       : 6;            /*!< [21..16] Trigger MUX Input 2 Source Select                                */
            uint32_t            : 2;
      __IOM uint32_t SEL3       : 6;            /*!< [29..24] Trigger MUX Input 3 Source Select                                */
            uint32_t            : 1;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_DMAMUX0_b;
  } ;

  union {
    __IOM uint32_t TRGMUX_EXTOUT0;              /*!< (@ 0x00000004) TRGMUX EXTOUT0 Register                                    */

    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 2;
      __IOM uint32_t SEL1       : 6;            /*!< [13..8] Trigger MUX Input 1 Source Select                                 */
            uint32_t            : 2;
      __IOM uint32_t SEL2       : 6;            /*!< [21..16] Trigger MUX Input 2 Source Select                                */
            uint32_t            : 2;
      __IOM uint32_t SEL3       : 6;            /*!< [29..24] Trigger MUX Input 3 Source Select                                */
            uint32_t            : 1;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_EXTOUT0_b;
  } ;

  union {
    __IOM uint32_t TRGMUX_EXTOUT1;              /*!< (@ 0x00000008) TRGMUX EXTOUT1 Register                                    */

    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 2;
      __IOM uint32_t SEL1       : 6;            /*!< [13..8] Trigger MUX Input 1 Source Select                                 */
            uint32_t            : 2;
      __IOM uint32_t SEL2       : 6;            /*!< [21..16] Trigger MUX Input 2 Source Select                                */
            uint32_t            : 2;
      __IOM uint32_t SEL3       : 6;            /*!< [29..24] Trigger MUX Input 3 Source Select                                */
            uint32_t            : 1;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_EXTOUT1_b;
  } ;

  union {
    __IOM uint32_t TRGMUX_ADC0;                 /*!< (@ 0x0000000C) TRGMUX ADC0 Register                                       */

    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 2;
      __IOM uint32_t SEL1       : 6;            /*!< [13..8] Trigger MUX Input 1 Source Select                                 */
            uint32_t            : 2;
      __IOM uint32_t SEL2       : 6;            /*!< [21..16] Trigger MUX Input 2 Source Select                                */
            uint32_t            : 2;
      __IOM uint32_t SEL3       : 6;            /*!< [29..24] Trigger MUX Input 3 Source Select                                */
            uint32_t            : 1;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_ADC0_b;
  } ;
  __IM  uint32_t  RESERVED[3];

  union {
    __IOM uint32_t TRGMUX_CMP0;                 /*!< (@ 0x0000001C) TRGMUX CMP0 Register                                       */

    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 25;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_CMP0_b;
  } ;
  __IM  uint32_t  RESERVED1[2];

  union {
    __IOM uint32_t TRGMUX_FTM0;                 /*!< (@ 0x00000028) TRGMUX FTM0 Register                                       */

    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 2;
      __IOM uint32_t SEL1       : 6;            /*!< [13..8] Trigger MUX Input 1 Source Select                                 */
            uint32_t            : 2;
      __IOM uint32_t SEL2       : 6;            /*!< [21..16] Trigger MUX Input 2 Source Select                                */
            uint32_t            : 2;
      __IOM uint32_t SEL3       : 6;            /*!< [29..24] Trigger MUX Input 3 Source Select                                */
            uint32_t            : 1;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_FTM0_b;
  } ;

  union {
    __IOM uint32_t TRGMUX_FTM1;                 /*!< (@ 0x0000002C) TRGMUX FTM1 Register                                       */

