nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 2;
      __IOM uint32_t SEL1       : 6;            /*!< [13..8] Trigger MUX Input 1 Source Select                                 */
            uint32_t            : 2;
      __IOM uint32_t SEL2       : 6;            /*!< [21..16] Trigger MUX Input 2 Source Select                                */
            uint32_t            : 2;
      __IOM uint32_t SEL3       : 6;            /*!< [29..24] Trigger MUX Input 3 Source Select                                */
            uint32_t            : 1;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_FTM1_b;
  } ;
  __IM  uint32_t  RESERVED2[2];

  union {
    __IOM uint32_t TRGMUX_PDB0;                 /*!< (@ 0x00000038) TRGMUX PDB0 Register                                       */

    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 25;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_PDB0_b;
  } ;
  __IM  uint32_t  RESERVED3[2];

  union {
    __IOM uint32_t TRGMUX_FLEXIO;               /*!< (@ 0x00000044) TRGMUX FLEXIO Register                                     */

    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 2;
      __IOM uint32_t SEL1       : 6;            /*!< [13..8] Trigger MUX Input 1 Source Select                                 */
            uint32_t            : 2;
      __IOM uint32_t SEL2       : 6;            /*!< [21..16] Trigger MUX Input 2 Source Select                                */
            uint32_t            : 2;
      __IOM uint32_t SEL3       : 6;            /*!< [29..24] Trigger MUX Input 3 Source Select                                */
            uint32_t            : 1;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_FLEXIO_b;
  } ;

  union {
    __IOM uint32_t TRGMUX_LPIT0;                /*!< (@ 0x00000048) TRGMUX LPIT0 Register                                      */

    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 2;
      __IOM uint32_t SEL1       : 6;            /*!< [13..8] Trigger MUX Input 1 Source Select                                 */
            uint32_t            : 2;
      __IOM uint32_t SEL2       : 6;            /*!< [21..16] Trigger MUX Input 2 Source Select                                */
            uint32_t            : 2;
      __IOM uint32_t SEL3       : 6;            /*!< [29..24] Trigger MUX Input 3 Source Select                                */
            uint32_t            : 1;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_LPIT0_b;
  } ;

  union {
    __IOM uint32_t TRGMUX_LPUART0;              /*!< (@ 0x0000004C) TRGMUX LPUART0 Register                                    */

    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 25;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_LPUART0_b;
  } ;

  union {
    __IOM uint32_t TRGMUX_LPUART1;              /*!< (@ 0x00000050) TRGMUX LPUART1 Register                                    */

    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 25;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_LPUART1_b;
  } ;

  union {
    __IOM uint32_t TRGMUX_LPI2C0;               /*!< (@ 0x00000054) TRGMUX LPI2C0 Register                                     */

    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 25;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_LPI2C0_b;
  } ;
  __IM  uint32_t  RESERVED4;

  union {
    __IOM uint32_t TRGMUX_LPSPI0;               /*!< (@ 0x0000005C) TRGMUX LPSPI0 Register                                     */

    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 25;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_LPSPI0_b;
  } ;

  union {
    __IOM uint32_t TRGMUX_LPSPI1;               /*!< (@ 0x00000060) TRGMUX LPSPI1 Register                                     */

    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 25;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_LPSPI1_b;
  } ;

  union {
    __IOM uint32_t TRGMUX_LPTMR0;               /*!< (@ 0x00000064) TRGMUX LPTMR0 Register                                     */

    struct {
      __IOM uint32_t SEL0       : 6;            /*!< [5..0] Trigger MUX Input 0 Source Select                                  */
            uint32_t            : 25;
      __IOM uint32_t LK         : 1;            /*!< [31..31] TRGMUX register lock.                                            */
    } TRGMUX_LPTMR0_b;
  } ;
} TRGMUX_Type;                                  /*!< Size = 104 (0x68)                                                         */



/* =========================================================================================================================== */
/* ================                                            SCG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief System Clock Generator (SCG)
  */

