nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
typedef struct {                                /*!< (@ 0x40064000) SCG Structure                                              */

  union {
    __IM  uint32_t SCG_VERID;                   /*!< (@ 0x00000000) Version ID Register                                        */

    struct {
      __IM  uint32_t VERSION    : 32;           /*!< [31..0] SCG Version Number                                                */
    } SCG_VERID_b;
  } ;

  union {
    __IM  uint32_t SCG_PARAM;                   /*!< (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t CLKPRES    : 8;            /*!< [7..0] Clock Present                                                      */
            uint32_t            : 19;
      __IM  uint32_t DIVPRES    : 5;            /*!< [31..27] Divider Present                                                  */
    } SCG_PARAM_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IM  uint32_t SCG_CSR;                     /*!< (@ 0x00000010) Clock Status Register                                      */

    struct {
      __IM  uint32_t DIVSLOW    : 4;            /*!< [3..0] Slow Clock Divide Ratio                                            */
      __IM  uint32_t DIVBUS     : 4;            /*!< [7..4] Bus Clock Divide Ratio                                             */
            uint32_t            : 8;
      __IM  uint32_t DIVCORE    : 4;            /*!< [19..16] Core Clock Divide Ratio                                          */
            uint32_t            : 4;
      __IM  uint32_t SCS        : 4;            /*!< [27..24] System Clock Source                                              */
            uint32_t            : 4;
    } SCG_CSR_b;
  } ;

  union {
    __IOM uint32_t SCG_RCCR;                    /*!< (@ 0x00000014) Run Clock Control Register                                 */

    struct {
      __IOM uint32_t DIVSLOW    : 4;            /*!< [3..0] Slow Clock Divide Ratio                                            */
      __IOM uint32_t DIVBUS     : 4;            /*!< [7..4] Bus Clock Divide Ratio                                             */
            uint32_t            : 8;
      __IOM uint32_t DIVCORE    : 4;            /*!< [19..16] Core Clock Divide Ratio                                          */
            uint32_t            : 4;
      __IOM uint32_t SCS        : 4;            /*!< [27..24] System Clock Source                                              */
            uint32_t            : 4;
    } SCG_RCCR_b;
  } ;

  union {
    __IOM uint32_t SCG_VCCR;                    /*!< (@ 0x00000018) VLPR Clock Control Register                                */

    struct {
      __IOM uint32_t DIVSLOW    : 4;            /*!< [3..0] Slow Clock Divide Ratio                                            */
      __IOM uint32_t DIVBUS     : 4;            /*!< [7..4] Bus Clock Divide Ratio                                             */
            uint32_t            : 8;
      __IOM uint32_t DIVCORE    : 4;            /*!< [19..16] Core Clock Divide Ratio                                          */
            uint32_t            : 4;
      __IOM uint32_t SCS        : 4;            /*!< [27..24] System Clock Source                                              */
            uint32_t            : 4;
    } SCG_VCCR_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t SCG_CLKOUTCNFG;              /*!< (@ 0x00000020) SCG CLKOUT Configuration Register                          */

    struct {
            uint32_t            : 24;
      __IOM uint32_t CLKOUTSEL  : 4;            /*!< [27..24] SCG Clkout Select                                                */
            uint32_t            : 4;
    } SCG_CLKOUTCNFG_b;
  } ;
  __IM  uint32_t  RESERVED2[55];

  union {
    __IOM uint32_t SCG_SOSCCSR;                 /*!< (@ 0x00000100) System OSC Control Status Register                         */

    struct {
      __IOM uint32_t SOSCEN     : 1;            /*!< [0..0] System OSC Enable                                                  */
            uint32_t            : 15;
      __IOM uint32_t SOSCCM     : 1;            /*!< [16..16] System OSC Clock Monitor                                         */
      __IOM uint32_t SOSCCMRE   : 1;            /*!< [17..17] System OSC Clock Monitor Reset Enable                            */
            uint32_t            : 5;
      __IOM uint32_t LK         : 1;            /*!< [23..23] Lock Register                                                    */
      __IM  uint32_t SOSCVLD    : 1;            /*!< [24..24] System OSC Valid                                                 */
      __IM  uint32_t SOSCSEL    : 1;            /*!< [25..25] System OSC Selected                                              */
      __IOM uint32_t SOSCERR    : 1;            /*!< [26..26] System OSC Clock Error                                           */
            uint32_t            : 5;
    } SCG_SOSCCSR_b;
  } ;

  union {
    __IOM uint32_t SCG_SOSCDIV;                 /*!< (@ 0x00000104) System OSC Divide Register                                 */

    struct {
      __IOM uint32_t SOSCDIV1   : 3;            /*!< [2..0] System OSC Clock Divide 1                                          */
            uint32_t            : 5;
      __IOM uint32_t SOSCDIV2   : 3;            /*!< [10..8] System OSC Clock Divide 2                                         */
            uint32_t            : 21;
    } SCG_SOSCDIV_b;
  } ;

  union {
    __IOM uint32_t SCG_SOSCCFG;                 /*!< (@ 0x00000108) System Oscillator Configuration Register                   */

    struct {
            uint32_t            : 2;
      __IOM uint32_t EREFS      : 1;            /*!< [2..2] External Reference Select                                          */
      __IOM uint32_t HGO        : 1;            /*!< [3..3] High Gain Oscillator Select                                        */
      __IOM uint32_t RANGE      : 2;            /*!< [5..4] System OSC Range Select                                            */
            uint32_t            : 26;
    } SCG_SOSCCFG_b;
  } ;
  __IM  uint32_t  RESERVED3[61];

  union {
    __IOM uint32_t SCG_SIRCCSR;                 /*!< (@ 0x00000200) Slow IRC Control Status Register                           */

