nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t SIRCEN     : 1;            /*!< [0..0] Slow IRC Enable                                                    */
      __IOM uint32_t SIRCSTEN   : 1;            /*!< [1..1] Slow IRC Stop Enable                                               */
      __IOM uint32_t SIRCLPEN   : 1;            /*!< [2..2] Slow IRC Low Power Enable                                          */
            uint32_t            : 20;
      __IOM uint32_t LK         : 1;            /*!< [23..23] Lock Register                                                    */
      __IM  uint32_t SIRCVLD    : 1;            /*!< [24..24] Slow IRC Valid                                                   */
      __IM  uint32_t SIRCSEL    : 1;            /*!< [25..25] Slow IRC Selected                                                */
            uint32_t            : 6;
    } SCG_SIRCCSR_b;
  } ;

  union {
    __IOM uint32_t SCG_SIRCDIV;                 /*!< (@ 0x00000204) Slow IRC Divide Register                                   */

    struct {
      __IOM uint32_t SIRCDIV1   : 3;            /*!< [2..0] Slow IRC Clock Divide 1                                            */
            uint32_t            : 5;
      __IOM uint32_t SIRCDIV2   : 3;            /*!< [10..8] Slow IRC Clock Divide 2                                           */
            uint32_t            : 21;
    } SCG_SIRCDIV_b;
  } ;

  union {
    __IOM uint32_t SCG_SIRCCFG;                 /*!< (@ 0x00000208) Slow IRC Configuration Register                            */

    struct {
      __IOM uint32_t RANGE      : 1;            /*!< [0..0] Frequency Range                                                    */
            uint32_t            : 31;
    } SCG_SIRCCFG_b;
  } ;
  __IM  uint32_t  RESERVED4[61];

  union {
    __IOM uint32_t SCG_FIRCCSR;                 /*!< (@ 0x00000300) Fast IRC Control Status Register                           */

    struct {
      __IOM uint32_t FIRCEN     : 1;            /*!< [0..0] Fast IRC Enable                                                    */
            uint32_t            : 2;
      __IOM uint32_t FIRCREGOFF : 1;            /*!< [3..3] Fast IRC Regulator Enable                                          */
            uint32_t            : 19;
      __IOM uint32_t LK         : 1;            /*!< [23..23] Lock Register                                                    */
      __IM  uint32_t FIRCVLD    : 1;            /*!< [24..24] Fast IRC Valid status                                            */
      __IM  uint32_t FIRCSEL    : 1;            /*!< [25..25] Fast IRC Selected status                                         */
      __IOM uint32_t FIRCERR    : 1;            /*!< [26..26] Fast IRC Clock Error                                             */
            uint32_t            : 5;
    } SCG_FIRCCSR_b;
  } ;

  union {
    __IOM uint32_t SCG_FIRCDIV;                 /*!< (@ 0x00000304) Fast IRC Divide Register                                   */

    struct {
      __IOM uint32_t FIRCDIV1   : 3;            /*!< [2..0] Fast IRC Clock Divide 1                                            */
            uint32_t            : 5;
      __IOM uint32_t FIRCDIV2   : 3;            /*!< [10..8] Fast IRC Clock Divide 2                                           */
            uint32_t            : 21;
    } SCG_FIRCDIV_b;
  } ;

  union {
    __IOM uint32_t SCG_FIRCCFG;                 /*!< (@ 0x00000308) Fast IRC Configuration Register                            */

    struct {
      __IOM uint32_t RANGE      : 2;            /*!< [1..0] Frequency Range                                                    */
            uint32_t            : 30;
    } SCG_FIRCCFG_b;
  } ;
} SCG_Type;                                     /*!< Size = 780 (0x30c)                                                        */



/* =========================================================================================================================== */
/* ================                                            PCC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PCC (PCC)
  */

typedef struct {                                /*!< (@ 0x40065000) PCC Structure                                              */
  __IM  uint32_t  RESERVED[32];

  union {
    __IOM uint32_t PCC_FTFC;                    /*!< (@ 0x00000080) PCC FTFC Register                                          */

    struct {
            uint32_t            : 30;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_FTFC_b;
  } ;

  union {
    __IOM uint32_t PCC_DMAMUX;                  /*!< (@ 0x00000084) PCC DMAMUX Register                                        */

    struct {
            uint32_t            : 30;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_DMAMUX_b;
  } ;
  __IM  uint32_t  RESERVED1[2];

  union {
    __IOM uint32_t PCC_FlexCAN0;                /*!< (@ 0x00000090) PCC FlexCAN0 Register                                      */

    struct {
            uint32_t            : 30;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_FlexCAN0_b;
  } ;
  __IM  uint32_t  RESERVED2[7];

  union {
    __IOM uint32_t PCC_LPSPI0;                  /*!< (@ 0x000000B0) PCC LPSPI0 Register                                        */

