nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
            uint32_t            : 30;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_CMP0_b;
  } ;
} PCC_Type;                                     /*!< Size = 464 (0x1d0)                                                        */



/* =========================================================================================================================== */
/* ================                                          LPI2C0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief The LPI2C Memory Map/Register Definition can be found here. (LPI2C0)
  */

typedef struct {                                /*!< (@ 0x40066000) LPI2C0 Structure                                           */

  union {
    __IM  uint32_t LPI2C0_VERID;                /*!< (@ 0x00000000) Version ID Register                                        */

    struct {
      __IM  uint32_t FEATURE    : 16;           /*!< [15..0] Feature Specification Number                                      */
      __IM  uint32_t MINOR      : 8;            /*!< [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /*!< [31..24] Major Version Number                                             */
    } LPI2C0_VERID_b;
  } ;

  union {
    __IM  uint32_t LPI2C0_PARAM;                /*!< (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t MTXFIFO    : 4;            /*!< [3..0] Master Transmit FIFO Size                                          */
            uint32_t            : 4;
      __IM  uint32_t MRXFIFO    : 4;            /*!< [11..8] Master Receive FIFO Size                                          */
            uint32_t            : 20;
    } LPI2C0_PARAM_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t LPI2C0_MCR;                  /*!< (@ 0x00000010) Master Control Register                                    */

    struct {
      __IOM uint32_t MEN        : 1;            /*!< [0..0] Master Enable                                                      */
      __IOM uint32_t RST        : 1;            /*!< [1..1] Software Reset                                                     */
      __IOM uint32_t DOZEN      : 1;            /*!< [2..2] Doze mode enable                                                   */
      __IOM uint32_t DBGEN      : 1;            /*!< [3..3] Debug Enable                                                       */
            uint32_t            : 4;
      __OM  uint32_t RTF        : 1;            /*!< [8..8] Reset Transmit FIFO                                                */
      __OM  uint32_t RRF        : 1;            /*!< [9..9] Reset Receive FIFO                                                 */
            uint32_t            : 22;
    } LPI2C0_MCR_b;
  } ;

  union {
    __IOM uint32_t LPI2C0_MSR;                  /*!< (@ 0x00000014) Master Status Register                                     */

    struct {
      __IM  uint32_t TDF        : 1;            /*!< [0..0] Transmit Data Flag                                                 */
      __IM  uint32_t RDF        : 1;            /*!< [1..1] Receive Data Flag                                                  */
            uint32_t            : 6;
      __IOM uint32_t EPF        : 1;            /*!< [8..8] End Packet Flag                                                    */
      __IOM uint32_t SDF        : 1;            /*!< [9..9] STOP Detect Flag                                                   */
      __IOM uint32_t NDF        : 1;            /*!< [10..10] NACK Detect Flag                                                 */
      __IOM uint32_t ALF        : 1;            /*!< [11..11] Arbitration Lost Flag                                            */
      __IOM uint32_t FEF        : 1;            /*!< [12..12] FIFO Error Flag                                                  */
      __IOM uint32_t PLTF       : 1;            /*!< [13..13] Pin Low Timeout Flag                                             */
      __IOM uint32_t DMF        : 1;            /*!< [14..14] Data Match Flag                                                  */
            uint32_t            : 9;
      __IM  uint32_t MBF        : 1;            /*!< [24..24] Master Busy Flag                                                 */
      __IM  uint32_t BBF        : 1;            /*!< [25..25] Bus Busy Flag                                                    */
            uint32_t            : 6;
    } LPI2C0_MSR_b;
  } ;

  union {
    __IOM uint32_t LPI2C0_MIER;                 /*!< (@ 0x00000018) Master Interrupt Enable Register                           */

    struct {
      __IOM uint32_t TDIE       : 1;            /*!< [0..0] Transmit Data Interrupt Enable                                     */
      __IOM uint32_t RDIE       : 1;            /*!< [1..1] Receive Data Interrupt Enable                                      */
            uint32_t            : 6;
      __IOM uint32_t EPIE       : 1;            /*!< [8..8] End Packet Interrupt Enable                                        */
      __IOM uint32_t SDIE       : 1;            /*!< [9..9] STOP Detect Interrupt Enable                                       */
      __IOM uint32_t NDIE       : 1;            /*!< [10..10] NACK Detect Interrupt Enable                                     */
      __IOM uint32_t ALIE       : 1;            /*!< [11..11] Arbitration Lost Interrupt Enable                                */
      __IOM uint32_t FEIE       : 1;            /*!< [12..12] FIFO Error Interrupt Enable                                      */
      __IOM uint32_t PLTIE      : 1;            /*!< [13..13] Pin Low Timeout Interrupt Enable                                 */
      __IOM uint32_t DMIE       : 1;            /*!< [14..14] Data Match Interrupt Enable                                      */
            uint32_t            : 17;
    } LPI2C0_MIER_b;
  } ;

  union {
    __IOM uint32_t LPI2C0_MDER;                 /*!< (@ 0x0000001C) Master DMA Enable Register                                 */

