nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint32_t TXCOUNT    : 3;            /*!< [2..0] Transmit FIFO Count                                                */
            uint32_t            : 13;
      __IM  uint32_t RXCOUNT    : 3;            /*!< [18..16] Receive FIFO Count                                               */
            uint32_t            : 13;
    } LPI2C0_MFSR_b;
  } ;

  union {
    __IOM uint32_t LPI2C0_MTDR;                 /*!< (@ 0x00000060) Master Transmit Data Register                              */

    struct {
      __OM  uint32_t DATA       : 8;            /*!< [7..0] Transmit Data                                                      */
      __OM  uint32_t CMD        : 3;            /*!< [10..8] Command Data                                                      */
            uint32_t            : 21;
    } LPI2C0_MTDR_b;
  } ;
  __IM  uint32_t  RESERVED5[3];

  union {
    __IM  uint32_t LPI2C0_MRDR;                 /*!< (@ 0x00000070) Master Receive Data Register                               */

    struct {
      __IM  uint32_t DATA       : 8;            /*!< [7..0] Receive Data                                                       */
            uint32_t            : 6;
      __IM  uint32_t RXEMPTY    : 1;            /*!< [14..14] RX Empty                                                         */
            uint32_t            : 17;
    } LPI2C0_MRDR_b;
  } ;
  __IM  uint32_t  RESERVED6[39];

  union {
    __IOM uint32_t LPI2C0_SCR;                  /*!< (@ 0x00000110) Slave Control Register                                     */

    struct {
      __IOM uint32_t SEN        : 1;            /*!< [0..0] Slave Enable                                                       */
      __IOM uint32_t RST        : 1;            /*!< [1..1] Software Reset                                                     */
            uint32_t            : 2;
      __IOM uint32_t FILTEN     : 1;            /*!< [4..4] Filter Enable                                                      */
      __IOM uint32_t FILTDZ     : 1;            /*!< [5..5] Filter Doze Enable                                                 */
            uint32_t            : 2;
      __OM  uint32_t RTF        : 1;            /*!< [8..8] Reset Transmit FIFO                                                */
      __OM  uint32_t RRF        : 1;            /*!< [9..9] Reset Receive FIFO                                                 */
            uint32_t            : 22;
    } LPI2C0_SCR_b;
  } ;

  union {
    __IOM uint32_t LPI2C0_SSR;                  /*!< (@ 0x00000114) Slave Status Register                                      */

    struct {
      __IM  uint32_t TDF        : 1;            /*!< [0..0] Transmit Data Flag                                                 */
      __IM  uint32_t RDF        : 1;            /*!< [1..1] Receive Data Flag                                                  */
      __IM  uint32_t AVF        : 1;            /*!< [2..2] Address Valid Flag                                                 */
      __IM  uint32_t TAF        : 1;            /*!< [3..3] Transmit ACK Flag                                                  */
            uint32_t            : 4;
      __IOM uint32_t RSF        : 1;            /*!< [8..8] Repeated Start Flag                                                */
      __IOM uint32_t SDF        : 1;            /*!< [9..9] STOP Detect Flag                                                   */
      __IOM uint32_t BEF        : 1;            /*!< [10..10] Bit Error Flag                                                   */
      __IOM uint32_t FEF        : 1;            /*!< [11..11] FIFO Error Flag                                                  */
      __IM  uint32_t AM0F       : 1;            /*!< [12..12] Address Match 0 Flag                                             */
      __IM  uint32_t AM1F       : 1;            /*!< [13..13] Address Match 1 Flag                                             */
      __IM  uint32_t GCF        : 1;            /*!< [14..14] General Call Flag                                                */
      __IM  uint32_t SARF       : 1;            /*!< [15..15] SMBus Alert Response Flag                                        */
            uint32_t            : 8;
      __IM  uint32_t SBF        : 1;            /*!< [24..24] Slave Busy Flag                                                  */
      __IM  uint32_t BBF        : 1;            /*!< [25..25] Bus Busy Flag                                                    */
            uint32_t            : 6;
    } LPI2C0_SSR_b;
  } ;

  union {
    __IOM uint32_t LPI2C0_SIER;                 /*!< (@ 0x00000118) Slave Interrupt Enable Register                            */

    struct {
      __IOM uint32_t TDIE       : 1;            /*!< [0..0] Transmit Data Interrupt Enable                                     */
      __IOM uint32_t RDIE       : 1;            /*!< [1..1] Receive Data Interrupt Enable                                      */
      __IOM uint32_t AVIE       : 1;            /*!< [2..2] Address Valid Interrupt Enable                                     */
      __IOM uint32_t TAIE       : 1;            /*!< [3..3] Transmit ACK Interrupt Enable                                      */
            uint32_t            : 4;
      __IOM uint32_t RSIE       : 1;            /*!< [8..8] Repeated Start Interrupt Enable                                    */
      __IOM uint32_t SDIE       : 1;            /*!< [9..9] STOP Detect Interrupt Enable                                       */
      __IOM uint32_t BEIE       : 1;            /*!< [10..10] Bit Error Interrupt Enable                                       */
      __IOM uint32_t FEIE       : 1;            /*!< [11..11] FIFO Error Interrupt Enable                                      */
      __IOM uint32_t AM0IE      : 1;            /*!< [12..12] Address Match 0 Interrupt Enable                                 */
      __IOM uint32_t AM1F       : 1;            /*!< [13..13] Address Match 1 Interrupt Enable                                 */
      __IOM uint32_t GCIE       : 1;            /*!< [14..14] General Call Interrupt Enable                                    */
      __IOM uint32_t SARIE      : 1;            /*!< [15..15] SMBus Alert Response Interrupt Enable                            */
            uint32_t            : 16;
    } LPI2C0_SIER_b;
  } ;

  union {
    __IOM uint32_t LPI2C0_SDER;                 /*!< (@ 0x0000011C) Slave DMA Enable Register                                  */

