nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t TDDE       : 1;            /*!< [0..0] Transmit Data DMA Enable                                           */
      __IOM uint32_t RDDE       : 1;            /*!< [1..1] Receive Data DMA Enable                                            */
      __IOM uint32_t AVDE       : 1;            /*!< [2..2] Address Valid DMA Enable                                           */
            uint32_t            : 29;
    } LPI2C0_SDER_b;
  } ;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t LPI2C0_SCFGR1;               /*!< (@ 0x00000124) Slave Configuration Register 1                             */

    struct {
      __IOM uint32_t ADRSTALL   : 1;            /*!< [0..0] Address SCL Stall                                                  */
      __IOM uint32_t RXSTALL    : 1;            /*!< [1..1] RX SCL Stall                                                       */
      __IOM uint32_t TXDSTALL   : 1;            /*!< [2..2] TX Data SCL Stall                                                  */
      __IOM uint32_t ACKSTALL   : 1;            /*!< [3..3] ACK SCL Stall                                                      */
            uint32_t            : 4;
      __IOM uint32_t GCEN       : 1;            /*!< [8..8] General Call Enable                                                */
      __IOM uint32_t SAEN       : 1;            /*!< [9..9] SMBus Alert Enable                                                 */
      __IOM uint32_t TXCFG      : 1;            /*!< [10..10] Transmit Flag Configuration                                      */
      __IOM uint32_t RXCFG      : 1;            /*!< [11..11] Receive Data Configuration                                       */
      __IOM uint32_t IGNACK     : 1;            /*!< [12..12] Ignore NACK                                                      */
      __IOM uint32_t HSMEN      : 1;            /*!< [13..13] High Speed Mode Enable                                           */
            uint32_t            : 2;
      __IOM uint32_t ADDRCFG    : 3;            /*!< [18..16] Address Configuration                                            */
            uint32_t            : 13;
    } LPI2C0_SCFGR1_b;
  } ;

  union {
    __IOM uint32_t LPI2C0_SCFGR2;               /*!< (@ 0x00000128) Slave Configuration Register 2                             */

    struct {
      __IOM uint32_t CLKHOLD    : 4;            /*!< [3..0] Clock Hold Time                                                    */
            uint32_t            : 4;
      __IOM uint32_t DATAVD     : 6;            /*!< [13..8] Data Valid Delay                                                  */
            uint32_t            : 2;
      __IOM uint32_t FILTSCL    : 4;            /*!< [19..16] Glitch Filter SCL                                                */
            uint32_t            : 4;
      __IOM uint32_t FILTSDA    : 4;            /*!< [27..24] Glitch Filter SDA                                                */
            uint32_t            : 4;
    } LPI2C0_SCFGR2_b;
  } ;
  __IM  uint32_t  RESERVED8[5];

  union {
    __IOM uint32_t LPI2C0_SAMR;                 /*!< (@ 0x00000140) Slave Address Match Register                               */

    struct {
            uint32_t            : 1;
      __IOM uint32_t ADDR0      : 10;           /*!< [10..1] Address 0 Value                                                   */
            uint32_t            : 6;
      __IOM uint32_t ADDR1      : 10;           /*!< [26..17] Address 1 Value                                                  */
            uint32_t            : 5;
    } LPI2C0_SAMR_b;
  } ;
  __IM  uint32_t  RESERVED9[3];

  union {
    __IM  uint32_t LPI2C0_SASR;                 /*!< (@ 0x00000150) Slave Address Status Register                              */

    struct {
      __IM  uint32_t RADDR      : 11;           /*!< [10..0] Received Address                                                  */
            uint32_t            : 3;
      __IM  uint32_t ANV        : 1;            /*!< [14..14] Address Not Valid                                                */
            uint32_t            : 17;
    } LPI2C0_SASR_b;
  } ;

  union {
    __IOM uint32_t LPI2C0_STAR;                 /*!< (@ 0x00000154) Slave Transmit ACK Register                                */

    struct {
      __IOM uint32_t TXNACK     : 1;            /*!< [0..0] Transmit NACK                                                      */
            uint32_t            : 31;
    } LPI2C0_STAR_b;
  } ;
  __IM  uint32_t  RESERVED10[2];

  union {
    __IOM uint32_t LPI2C0_STDR;                 /*!< (@ 0x00000160) Slave Transmit Data Register                               */

    struct {
      __OM  uint32_t DATA       : 8;            /*!< [7..0] Transmit Data                                                      */
            uint32_t            : 24;
    } LPI2C0_STDR_b;
  } ;
  __IM  uint32_t  RESERVED11[3];

  union {
    __IM  uint32_t LPI2C0_SRDR;                 /*!< (@ 0x00000170) Slave Receive Data Register                                */

    struct {
      __IM  uint32_t DATA       : 8;            /*!< [7..0] Receive Data                                                       */
            uint32_t            : 6;
      __IM  uint32_t RXEMPTY    : 1;            /*!< [14..14] RX Empty                                                         */
      __IM  uint32_t SOF        : 1;            /*!< [15..15] Start Of Frame                                                   */
            uint32_t            : 16;
    } LPI2C0_SRDR_b;
  } ;
} LPI2C0_Type;                                  /*!< Size = 372 (0x174)                                                        */



/* =========================================================================================================================== */
/* ================                                          LPUART0                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal Asynchronous Receiver/Transmitter (LPUART0)
  */

typedef struct {                                /*!< (@ 0x4006A000) LPUART0 Structure                                          */

  union {
    __IM  uint32_t LPUART0_VERID;               /*!< (@ 0x00000000) Version ID Register                                        */

