nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint32_t FEATURE    : 16;           /*!< [15..0] Feature Identification Number                                     */
      __IM  uint32_t MINOR      : 8;            /*!< [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /*!< [31..24] Major Version Number                                             */
    } LPUART0_VERID_b;
  } ;

  union {
    __IM  uint32_t LPUART0_PARAM;               /*!< (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t TXFIFO     : 8;            /*!< [7..0] Transmit FIFO Size                                                 */
      __IM  uint32_t RXFIFO     : 8;            /*!< [15..8] Receive FIFO Size                                                 */
            uint32_t            : 16;
    } LPUART0_PARAM_b;
  } ;

  union {
    __IOM uint32_t LPUART0_GLOBAL;              /*!< (@ 0x00000008) LPUART Global Register                                     */

    struct {
            uint32_t            : 1;
      __IOM uint32_t RST        : 1;            /*!< [1..1] Software Reset                                                     */
            uint32_t            : 30;
    } LPUART0_GLOBAL_b;
  } ;

  union {
    __IOM uint32_t LPUART0_PINCFG;              /*!< (@ 0x0000000C) LPUART Pin Configuration Register                          */

    struct {
      __IOM uint32_t TRGSEL     : 2;            /*!< [1..0] Trigger Select                                                     */
            uint32_t            : 30;
    } LPUART0_PINCFG_b;
  } ;

  union {
    __IOM uint32_t LPUART0_BAUD;                /*!< (@ 0x00000010) LPUART Baud Rate Register                                  */

    struct {
      __IOM uint32_t SBR        : 13;           /*!< [12..0] Baud Rate Modulo Divisor.                                         */
      __IOM uint32_t SBNS       : 1;            /*!< [13..13] Stop Bit Number Select                                           */
      __IOM uint32_t RXEDGIE    : 1;            /*!< [14..14] RX Input Active Edge Interrupt Enable                            */
      __IOM uint32_t LBKDIE     : 1;            /*!< [15..15] LIN Break Detect Interrupt Enable                                */
      __IOM uint32_t RESYNCDIS  : 1;            /*!< [16..16] Resynchronization Disable                                        */
      __IOM uint32_t BOTHEDGE   : 1;            /*!< [17..17] Both Edge Sampling                                               */
      __IOM uint32_t MATCFG     : 2;            /*!< [19..18] Match Configuration                                              */
      __IOM uint32_t RIDMAE     : 1;            /*!< [20..20] Receiver Idle DMA Enable                                         */
      __IOM uint32_t RDMAE      : 1;            /*!< [21..21] Receiver Full DMA Enable                                         */
            uint32_t            : 1;
      __IOM uint32_t TDMAE      : 1;            /*!< [23..23] Transmitter DMA Enable                                           */
      __IOM uint32_t OSR        : 5;            /*!< [28..24] Oversampling Ratio                                               */
      __IOM uint32_t M10        : 1;            /*!< [29..29] 10-bit Mode select                                               */
      __IOM uint32_t MAEN2      : 1;            /*!< [30..30] Match Address Mode Enable 2                                      */
      __IOM uint32_t MAEN1      : 1;            /*!< [31..31] Match Address Mode Enable 1                                      */
    } LPUART0_BAUD_b;
  } ;

  union {
    __IOM uint32_t LPUART0_STAT;                /*!< (@ 0x00000014) LPUART Status Register                                     */

    struct {
            uint32_t            : 14;
      __IOM uint32_t MA2F       : 1;            /*!< [14..14] Match 2 Flag                                                     */
      __IOM uint32_t MA1F       : 1;            /*!< [15..15] Match 1 Flag                                                     */
      __IOM uint32_t PF         : 1;            /*!< [16..16] Parity Error Flag                                                */
      __IOM uint32_t FE         : 1;            /*!< [17..17] Framing Error Flag                                               */
      __IOM uint32_t NF         : 1;            /*!< [18..18] Noise Flag                                                       */
      __IOM uint32_t OR         : 1;            /*!< [19..19] Receiver Overrun Flag                                            */
      __IOM uint32_t IDLE       : 1;            /*!< [20..20] Idle Line Flag                                                   */
      __IM  uint32_t RDRF       : 1;            /*!< [21..21] Receive Data Register Full Flag                                  */
      __IM  uint32_t TC         : 1;            /*!< [22..22] Transmission Complete Flag                                       */
      __IM  uint32_t TDRE       : 1;            /*!< [23..23] Transmit Data Register Empty Flag                                */
      __IM  uint32_t RAF        : 1;            /*!< [24..24] Receiver Active Flag                                             */
      __IOM uint32_t LBKDE      : 1;            /*!< [25..25] LIN Break Detection Enable                                       */
      __IOM uint32_t BRK13      : 1;            /*!< [26..26] Break Character Generation Length                                */
      __IOM uint32_t RWUID      : 1;            /*!< [27..27] Receive Wake Up Idle Detect                                      */
      __IOM uint32_t RXINV      : 1;            /*!< [28..28] Receive Data Inversion                                           */
      __IOM uint32_t MSBF       : 1;            /*!< [29..29] MSB First                                                        */
      __IOM uint32_t RXEDGIF    : 1;            /*!< [30..30] RXD Pin Active Edge Interrupt Flag                               */
      __IOM uint32_t LBKDIF     : 1;            /*!< [31..31] LIN Break Detect Interrupt Flag                                  */
    } LPUART0_STAT_b;
  } ;

  union {
    __IOM uint32_t LPUART0_CTRL;                /*!< (@ 0x00000018) LPUART Control Register                                    */

