nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t PT         : 1;            /*!< [0..0] Parity Type                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Parity Enable                                                      */
      __IOM uint32_t ILT        : 1;            /*!< [2..2] Idle Line Type Select                                              */
      __IOM uint32_t WAKE       : 1;            /*!< [3..3] Receiver Wakeup Method Select                                      */
      __IOM uint32_t M          : 1;            /*!< [4..4] 9-Bit or 8-Bit Mode Select                                         */
      __IOM uint32_t RSRC       : 1;            /*!< [5..5] Receiver Source Select                                             */
      __IOM uint32_t DOZEEN     : 1;            /*!< [6..6] Doze Enable                                                        */
      __IOM uint32_t LOOPS      : 1;            /*!< [7..7] Loop Mode Select                                                   */
      __IOM uint32_t IDLECFG    : 3;            /*!< [10..8] Idle Configuration                                                */
      __IOM uint32_t M7         : 1;            /*!< [11..11] 7-Bit Mode Select                                                */
            uint32_t            : 2;
      __IOM uint32_t MA2IE      : 1;            /*!< [14..14] Match 2 Interrupt Enable                                         */
      __IOM uint32_t MA1IE      : 1;            /*!< [15..15] Match 1 Interrupt Enable                                         */
      __IOM uint32_t SBK        : 1;            /*!< [16..16] Send Break                                                       */
      __IOM uint32_t RWU        : 1;            /*!< [17..17] Receiver Wakeup Control                                          */
      __IOM uint32_t RE         : 1;            /*!< [18..18] Receiver Enable                                                  */
      __IOM uint32_t TE         : 1;            /*!< [19..19] Transmitter Enable                                               */
      __IOM uint32_t ILIE       : 1;            /*!< [20..20] Idle Line Interrupt Enable                                       */
      __IOM uint32_t RIE        : 1;            /*!< [21..21] Receiver Interrupt Enable                                        */
      __IOM uint32_t TCIE       : 1;            /*!< [22..22] Transmission Complete Interrupt Enable for                       */
      __IOM uint32_t TIE        : 1;            /*!< [23..23] Transmit Interrupt Enable                                        */
      __IOM uint32_t PEIE       : 1;            /*!< [24..24] Parity Error Interrupt Enable                                    */
      __IOM uint32_t FEIE       : 1;            /*!< [25..25] Framing Error Interrupt Enable                                   */
      __IOM uint32_t NEIE       : 1;            /*!< [26..26] Noise Error Interrupt Enable                                     */
      __IOM uint32_t ORIE       : 1;            /*!< [27..27] Overrun Interrupt Enable                                         */
      __IOM uint32_t TXINV      : 1;            /*!< [28..28] Transmit Data Inversion                                          */
      __IOM uint32_t TXDIR      : 1;            /*!< [29..29] TXD Pin Direction in Single-Wire Mode                            */
      __IOM uint32_t R9T8       : 1;            /*!< [30..30] Receive Bit 9 / Transmit Bit 8                                   */
      __IOM uint32_t R8T9       : 1;            /*!< [31..31] Receive Bit 8 / Transmit Bit 9                                   */
    } LPUART0_CTRL_b;
  } ;

  union {
    __IOM uint32_t LPUART0_DATA;                /*!< (@ 0x0000001C) LPUART Data Register                                       */

    struct {
      __IOM uint32_t R0T0       : 1;            /*!< [0..0] R0T0                                                               */
      __IOM uint32_t R1T1       : 1;            /*!< [1..1] R1T1                                                               */
      __IOM uint32_t R2T2       : 1;            /*!< [2..2] R2T2                                                               */
      __IOM uint32_t R3T3       : 1;            /*!< [3..3] R3T3                                                               */
      __IOM uint32_t R4T4       : 1;            /*!< [4..4] R4T4                                                               */
      __IOM uint32_t R5T5       : 1;            /*!< [5..5] R5T5                                                               */
      __IOM uint32_t R6T6       : 1;            /*!< [6..6] R6T6                                                               */
      __IOM uint32_t R7T7       : 1;            /*!< [7..7] R7T7                                                               */
      __IOM uint32_t R8T8       : 1;            /*!< [8..8] R8T8                                                               */
      __IOM uint32_t R9T9       : 1;            /*!< [9..9] R9T9                                                               */
            uint32_t            : 1;
      __IM  uint32_t IDLINE     : 1;            /*!< [11..11] Idle Line                                                        */
      __IM  uint32_t RXEMPT     : 1;            /*!< [12..12] Receive Buffer Empty                                             */
      __IOM uint32_t FRETSC     : 1;            /*!< [13..13] Frame Error / Transmit Special Character                         */
      __IM  uint32_t PARITYE    : 1;            /*!< [14..14] PARITYE                                                          */
      __IM  uint32_t NOISY      : 1;            /*!< [15..15] NOISY                                                            */
            uint32_t            : 16;
    } LPUART0_DATA_b;
  } ;

  union {
    __IOM uint32_t LPUART0_MATCH;               /*!< (@ 0x00000020) LPUART Match Address Register                              */

