nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t R0T0       : 1;            /*!< [0..0] R0T0                                                               */
      __IOM uint32_t R1T1       : 1;            /*!< [1..1] R1T1                                                               */
      __IOM uint32_t R2T2       : 1;            /*!< [2..2] R2T2                                                               */
      __IOM uint32_t R3T3       : 1;            /*!< [3..3] R3T3                                                               */
      __IOM uint32_t R4T4       : 1;            /*!< [4..4] R4T4                                                               */
      __IOM uint32_t R5T5       : 1;            /*!< [5..5] R5T5                                                               */
      __IOM uint32_t R6T6       : 1;            /*!< [6..6] R6T6                                                               */
      __IOM uint32_t R7T7       : 1;            /*!< [7..7] R7T7                                                               */
      __IOM uint32_t R8T8       : 1;            /*!< [8..8] R8T8                                                               */
      __IOM uint32_t R9T9       : 1;            /*!< [9..9] R9T9                                                               */
            uint32_t            : 1;
      __IM  uint32_t IDLINE     : 1;            /*!< [11..11] Idle Line                                                        */
      __IM  uint32_t RXEMPT     : 1;            /*!< [12..12] Receive Buffer Empty                                             */
      __IOM uint32_t FRETSC     : 1;            /*!< [13..13] Frame Error / Transmit Special Character                         */
      __IM  uint32_t PARITYE    : 1;            /*!< [14..14] PARITYE                                                          */
      __IM  uint32_t NOISY      : 1;            /*!< [15..15] NOISY                                                            */
            uint32_t            : 16;
    } LPUART1_DATA_b;
  } ;

  union {
    __IOM uint32_t LPUART1_MATCH;               /*!< (@ 0x00000020) LPUART Match Address Register                              */

    struct {
      __IOM uint32_t MA1        : 10;           /*!< [9..0] Match Address 1                                                    */
            uint32_t            : 6;
      __IOM uint32_t MA2        : 10;           /*!< [25..16] Match Address 2                                                  */
            uint32_t            : 6;
    } LPUART1_MATCH_b;
  } ;

  union {
    __IOM uint32_t LPUART1_MODIR;               /*!< (@ 0x00000024) LPUART Modem IrDA Register                                 */

    struct {
      __IOM uint32_t TXCTSE     : 1;            /*!< [0..0] Transmitter clear-to-send enable                                   */
      __IOM uint32_t TXRTSE     : 1;            /*!< [1..1] Transmitter request-to-send enable                                 */
      __IOM uint32_t TXRTSPOL   : 1;            /*!< [2..2] Transmitter request-to-send polarity                               */
      __IOM uint32_t RXRTSE     : 1;            /*!< [3..3] Receiver request-to-send enable                                    */
      __IOM uint32_t TXCTSC     : 1;            /*!< [4..4] Transmit CTS Configuration                                         */
      __IOM uint32_t TXCTSSRC   : 1;            /*!< [5..5] Transmit CTS Source                                                */
            uint32_t            : 2;
      __IOM uint32_t RTSWATER   : 2;            /*!< [9..8] Receive RTS Configuration                                          */
            uint32_t            : 6;
      __IOM uint32_t TNP        : 2;            /*!< [17..16] Transmitter narrow pulse                                         */
      __IOM uint32_t IREN       : 1;            /*!< [18..18] Infrared enable                                                  */
            uint32_t            : 13;
    } LPUART1_MODIR_b;
  } ;

  union {
    __IOM uint32_t LPUART1_FIFO;                /*!< (@ 0x00000028) LPUART FIFO Register                                       */

    struct {
      __IM  uint32_t RXFIFOSIZE : 3;            /*!< [2..0] Receive FIFO. Buffer Depth                                         */
      __IOM uint32_t RXFE       : 1;            /*!< [3..3] Receive FIFO Enable                                                */
      __IM  uint32_t TXFIFOSIZE : 3;            /*!< [6..4] Transmit FIFO. Buffer Depth                                        */
      __IOM uint32_t TXFE       : 1;            /*!< [7..7] Transmit FIFO Enable                                               */
      __IOM uint32_t RXUFE      : 1;            /*!< [8..8] Receive FIFO Underflow Interrupt Enable                            */
      __IOM uint32_t TXOFE      : 1;            /*!< [9..9] Transmit FIFO Overflow Interrupt Enable                            */
      __IOM uint32_t RXIDEN     : 3;            /*!< [12..10] Receiver Idle Empty Enable                                       */
            uint32_t            : 1;
      __OM  uint32_t RXFLUSH    : 1;            /*!< [14..14] Receive FIFO/Buffer Flush                                        */
      __OM  uint32_t TXFLUSH    : 1;            /*!< [15..15] Transmit FIFO/Buffer Flush                                       */
      __IOM uint32_t RXUF       : 1;            /*!< [16..16] Receiver Buffer Underflow Flag                                   */
      __IOM uint32_t TXOF       : 1;            /*!< [17..17] Transmitter Buffer Overflow Flag                                 */
            uint32_t            : 4;
      __IM  uint32_t RXEMPT     : 1;            /*!< [22..22] Receive Buffer/FIFO Empty                                        */
      __IM  uint32_t TXEMPT     : 1;            /*!< [23..23] Transmit Buffer/FIFO Empty                                       */
            uint32_t            : 8;
    } LPUART1_FIFO_b;
  } ;

  union {
    __IOM uint32_t LPUART1_WATER;               /*!< (@ 0x0000002C) LPUART Watermark Register                                  */

