nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t TXWATER    : 2;            /*!< [1..0] Transmit Watermark                                                 */
            uint32_t            : 6;
      __IM  uint32_t TXCOUNT    : 3;            /*!< [10..8] Transmit Counter                                                  */
            uint32_t            : 5;
      __IOM uint32_t RXWATER    : 2;            /*!< [17..16] Receive Watermark                                                */
            uint32_t            : 6;
      __IM  uint32_t RXCOUNT    : 3;            /*!< [26..24] Receive Counter                                                  */
            uint32_t            : 5;
    } LPUART1_WATER_b;
  } ;
} LPUART1_Type;                                 /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           CMP0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief High-Speed Comparator (CMP), Voltage Reference (VREF) Digital-to-Analog Converter (DAC), and Analog Mux (ANMUX) (CMP0)
  */

typedef struct {                                /*!< (@ 0x40073000) CMP0 Structure                                             */

  union {
    __IOM uint32_t CMP0_C0;                     /*!< (@ 0x00000000) CMP Control Register 0                                     */

    struct {
      __IOM uint32_t HYSTCTR    : 2;            /*!< [1..0] Comparator hard block hysteresis control. See chip data
                                                     sheet to get the actual hysteresis value with each level                  */
      __IOM uint32_t OFFSET     : 1;            /*!< [2..2] Comparator hard block offset control. See chip data sheet
                                                     to get the actual offset value with each level                            */
            uint32_t            : 1;
      __IOM uint32_t FILTER_CNT : 3;            /*!< [6..4] Filter Sample Count                                                */
            uint32_t            : 1;
      __IOM uint32_t EN         : 1;            /*!< [8..8] Comparator Module Enable                                           */
      __IOM uint32_t OPE        : 1;            /*!< [9..9] Comparator Output Pin Enable                                       */
      __IOM uint32_t COS        : 1;            /*!< [10..10] Comparator Output Select                                         */
      __IOM uint32_t INVT       : 1;            /*!< [11..11] Comparator invert                                                */
      __IOM uint32_t PMODE      : 1;            /*!< [12..12] Power Mode Select                                                */
            uint32_t            : 1;
      __IOM uint32_t WE         : 1;            /*!< [14..14] Windowing Enable                                                 */
      __IOM uint32_t SE         : 1;            /*!< [15..15] Sample Enable                                                    */
      __IOM uint32_t FPR        : 8;            /*!< [23..16] Filter Sample Period                                             */
      __IM  uint32_t COUT       : 1;            /*!< [24..24] Analog Comparator Output                                         */
      __IOM uint32_t CFF        : 1;            /*!< [25..25] Analog Comparator Flag Falling                                   */
      __IOM uint32_t CFR        : 1;            /*!< [26..26] Analog Comparator Flag Rising                                    */
      __IOM uint32_t IEF        : 1;            /*!< [27..27] Comparator Interrupt Enable Falling                              */
      __IOM uint32_t IER        : 1;            /*!< [28..28] Comparator Interrupt Enable Rising                               */
            uint32_t            : 1;
      __IOM uint32_t DMAEN      : 1;            /*!< [30..30] DMA Enable                                                       */
            uint32_t            : 1;
    } CMP0_C0_b;
  } ;

  union {
    __IOM uint32_t CMP0_C1;                     /*!< (@ 0x00000004) CMP Control Register 1                                     */

    struct {
      __IOM uint32_t VOSEL      : 8;            /*!< [7..0] DAC Output Voltage Select                                          */
      __IOM uint32_t MSEL       : 3;            /*!< [10..8] Minus Input MUX Control                                           */
      __IOM uint32_t PSEL       : 3;            /*!< [13..11] Plus Input MUX Control                                           */
      __IOM uint32_t VRSEL      : 1;            /*!< [14..14] Supply Voltage Reference Source Select                           */
      __IOM uint32_t DACEN      : 1;            /*!< [15..15] DAC Enable                                                       */
      __IOM uint32_t CHN0       : 1;            /*!< [16..16] Channel 0 input enable                                           */
      __IOM uint32_t CHN1       : 1;            /*!< [17..17] Channel 1 input enable                                           */
      __IOM uint32_t CHN2       : 1;            /*!< [18..18] Channel 2 input enable                                           */
      __IOM uint32_t CHN3       : 1;            /*!< [19..19] Channel 3 input enable                                           */
      __IOM uint32_t CHN4       : 1;            /*!< [20..20] Channel 4 input enable                                           */
      __IOM uint32_t CHN5       : 1;            /*!< [21..21] Channel 5 input enable                                           */
      __IOM uint32_t CHN6       : 1;            /*!< [22..22] Channel 6 input enable                                           */
      __IOM uint32_t CHN7       : 1;            /*!< [23..23] Channel 7 input enable                                           */
      __IOM uint32_t INNSEL     : 2;            /*!< [25..24] Selection of the input to the negative port of the
                                                     comparator                                                                */
            uint32_t            : 1;
      __IOM uint32_t INPSEL     : 2;            /*!< [28..27] Selection of the input to the positive port of the
                                                     comparator                                                                */
            uint32_t            : 3;
    } CMP0_C1_b;
  } ;

  union {
    __IOM uint32_t CMP0_C2;                     /*!< (@ 0x00000008) CMP Control Register 2                                     */

