nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t ACOn       : 8;            /*!< [7..0] The result of the input comparison for channel n                   */
      __IOM uint32_t INITMOD    : 6;            /*!< [13..8] Comparator and DAC initialization delay modulus.                  */
      __IOM uint32_t NSAM       : 2;            /*!< [15..14] Number of sample clocks                                          */
      __IOM uint32_t CH0F       : 1;            /*!< [16..16] Channel 0 input changed flag                                     */
      __IOM uint32_t CH1F       : 1;            /*!< [17..17] Channel 1 input changed flag                                     */
      __IOM uint32_t CH2F       : 1;            /*!< [18..18] Channel 2 input changed flag                                     */
      __IOM uint32_t CH3F       : 1;            /*!< [19..19] Channel 3 input changed flag                                     */
      __IOM uint32_t CH4F       : 1;            /*!< [20..20] Channel 4 input changed flag                                     */
      __IOM uint32_t CH5F       : 1;            /*!< [21..21] Channel 5 input changed flag                                     */
      __IOM uint32_t CH6F       : 1;            /*!< [22..22] Channel 6 input changed flag                                     */
      __IOM uint32_t CH7F       : 1;            /*!< [23..23] Channel 7 input changed flag                                     */
            uint32_t            : 1;
      __IOM uint32_t FXMXCH     : 3;            /*!< [27..25] Fixed channel selection                                          */
            uint32_t            : 1;
      __IOM uint32_t FXMP       : 1;            /*!< [29..29] Fixed MUX Port                                                   */
      __IOM uint32_t RRIE       : 1;            /*!< [30..30] Round-Robin interrupt enable                                     */
      __IOM uint32_t RRE        : 1;            /*!< [31..31] Round-Robin Enable                                               */
    } CMP0_C2_b;
  } ;
} CMP0_Type;                                    /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                            PMC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PMC (PMC)
  */

typedef struct {                                /*!< (@ 0x4007D000) PMC Structure                                              */

  union {
    __IOM uint8_t PMC_LVDSC1;                   /*!< (@ 0x00000000) Low Voltage Detect Status and Control 1 Register           */

    struct {
            uint8_t             : 4;
      __IOM uint8_t LVDRE       : 1;            /*!< [4..4] Low Voltage Detect Reset Enable                                    */
      __IOM uint8_t LVDIE       : 1;            /*!< [5..5] Low Voltage Detect Interrupt Enable                                */
      __OM  uint8_t LVDACK      : 1;            /*!< [6..6] Low Voltage Detect Acknowledge                                     */
      __IM  uint8_t LVDF        : 1;            /*!< [7..7] Low Voltage Detect Flag                                            */
    } PMC_LVDSC1_b;
  } ;

  union {
    __IOM uint8_t PMC_LVDSC2;                   /*!< (@ 0x00000001) Low Voltage Detect Status and Control 2 Register           */

    struct {
            uint8_t             : 5;
      __IOM uint8_t LVWIE       : 1;            /*!< [5..5] Low-Voltage Warning Interrupt Enable                               */
      __OM  uint8_t LVWACK      : 1;            /*!< [6..6] Low-Voltage Warning Acknowledge                                    */
      __IM  uint8_t LVWF        : 1;            /*!< [7..7] Low-Voltage Warning Flag                                           */
    } PMC_LVDSC2_b;
  } ;

  union {
    __IOM uint8_t PMC_REGSC;                    /*!< (@ 0x00000002) Regulator Status and Control Register                      */

    struct {
      __IOM uint8_t BIASEN      : 1;            /*!< [0..0] Bias Enable Bit                                                    */
      __IOM uint8_t CLKBIASDIS  : 1;            /*!< [1..1] Clock Bias Disable Bit                                             */
      __IM  uint8_t REGFPM      : 1;            /*!< [2..2] Regulator in Full Performance Mode Status Bit                      */
            uint8_t             : 3;
      __IM  uint8_t LPOSTAT     : 1;            /*!< [6..6] LPO Status Bit                                                     */
      __IOM uint8_t LPODIS      : 1;            /*!< [7..7] LPO Disable Bit                                                    */
    } PMC_REGSC_b;
  } ;
  __IM  uint8_t   RESERVED;

  union {
    __IOM uint8_t PMC_LPOTRIM;                  /*!< (@ 0x00000004) Low Power Oscillator Trim Register                         */

    struct {
      __IOM uint8_t LPOTRIM     : 5;            /*!< [4..0] LPO trimming bits                                                  */
            uint8_t             : 3;
    } PMC_LPOTRIM_b;
  } ;
} PMC_Type;                                     /*!< Size = 5 (0x5)                                                            */



/* =========================================================================================================================== */
/* ================                                            SMC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief System Mode Controller (SMC)
  */

typedef struct {                                /*!< (@ 0x4007E000) SMC Structure                                              */

  union {
    __IM  uint32_t SMC_VERID;                   /*!< (@ 0x00000000) SMC Version ID Register                                    */

