nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
            uint32_t            : 1;
      __IM  uint32_t LVD        : 1;            /*!< [1..1] Low-Voltage Detect Reset or High-Voltage Detect Reset              */
      __IM  uint32_t LOC        : 1;            /*!< [2..2] Loss-of-Clock Reset                                                */
      __IM  uint32_t LOL        : 1;            /*!< [3..3] Loss-of-Lock Reset                                                 */
      __IM  uint32_t CMU_LOC    : 1;            /*!< [4..4] CMU Loss-of-Clock Reset                                            */
      __IM  uint32_t WDOG       : 1;            /*!< [5..5] Watchdog                                                           */
      __IM  uint32_t PIN        : 1;            /*!< [6..6] External Reset Pin                                                 */
      __IM  uint32_t POR        : 1;            /*!< [7..7] Power-On Reset                                                     */
      __IM  uint32_t JTAG       : 1;            /*!< [8..8] JTAG generated reset                                               */
      __IM  uint32_t LOCKUP     : 1;            /*!< [9..9] Core Lockup                                                        */
      __IM  uint32_t SW         : 1;            /*!< [10..10] Software                                                         */
      __IM  uint32_t MDM_AP     : 1;            /*!< [11..11] MDM-AP System Reset Request                                      */
            uint32_t            : 1;
      __IM  uint32_t SACKERR    : 1;            /*!< [13..13] Stop Acknowledge Error                                           */
            uint32_t            : 18;
    } RCM_SRS_b;
  } ;

  union {
    __IOM uint32_t RCM_RPC;                     /*!< (@ 0x0000000C) Reset Pin Control register                                 */

    struct {
      __IOM uint32_t RSTFLTSRW  : 2;            /*!< [1..0] Reset Pin Filter Select in Run and Wait Modes                      */
      __IOM uint32_t RSTFLTSS   : 1;            /*!< [2..2] Reset Pin Filter Select in Stop Mode                               */
            uint32_t            : 5;
      __IOM uint32_t RSTFLTSEL  : 5;            /*!< [12..8] Reset Pin Filter Bus Clock Select                                 */
            uint32_t            : 19;
    } RCM_RPC_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t RCM_SSRS;                    /*!< (@ 0x00000018) Sticky System Reset Status Register                        */

    struct {
            uint32_t            : 1;
      __IOM uint32_t SLVD       : 1;            /*!< [1..1] Sticky Low-Voltage Detect Reset                                    */
      __IOM uint32_t SLOC       : 1;            /*!< [2..2] Sticky Loss-of-Clock Reset                                         */
      __IOM uint32_t SLOL       : 1;            /*!< [3..3] Sticky Loss-of-Lock Reset                                          */
      __IOM uint32_t SCMU_LOC   : 1;            /*!< [4..4] Sticky CMU Loss-of-Clock Reset                                     */
      __IOM uint32_t SWDOG      : 1;            /*!< [5..5] Sticky Watchdog                                                    */
      __IOM uint32_t SPIN       : 1;            /*!< [6..6] Sticky External Reset Pin                                          */
      __IOM uint32_t SPOR       : 1;            /*!< [7..7] Sticky Power-On Reset                                              */
      __IOM uint32_t SJTAG      : 1;            /*!< [8..8] Sticky JTAG generated reset                                        */
      __IOM uint32_t SLOCKUP    : 1;            /*!< [9..9] Sticky Core Lockup                                                 */
      __IOM uint32_t SSW        : 1;            /*!< [10..10] Sticky Software                                                  */
      __IOM uint32_t SMDM_AP    : 1;            /*!< [11..11] Sticky MDM-AP System Reset Request                               */
            uint32_t            : 1;
      __IOM uint32_t SSACKERR   : 1;            /*!< [13..13] Sticky Stop Acknowledge Error                                    */
            uint32_t            : 18;
    } RCM_SSRS_b;
  } ;

  union {
    __IOM uint32_t RCM_SRIE;                    /*!< (@ 0x0000001C) System Reset Interrupt Enable Register                     */

    struct {
      __IOM uint32_t DELAY      : 2;            /*!< [1..0] Reset Delay Time                                                   */
      __IOM uint32_t LOC        : 1;            /*!< [2..2] Loss-of-Clock Interrupt                                            */
      __IOM uint32_t LOL        : 1;            /*!< [3..3] Loss-of-Lock Interrupt                                             */
      __IOM uint32_t CMU_LOC    : 1;            /*!< [4..4] CMU Loss-of-Clock Interrupt                                        */
      __IOM uint32_t WDOG       : 1;            /*!< [5..5] Watchdog Interrupt                                                 */
      __IOM uint32_t PIN        : 1;            /*!< [6..6] External Reset Pin Interrupt                                       */
      __IOM uint32_t GIE        : 1;            /*!< [7..7] Global Interrupt Enable                                            */
      __IOM uint32_t JTAG       : 1;            /*!< [8..8] JTAG generated reset                                               */
      __IOM uint32_t LOCKUP     : 1;            /*!< [9..9] Core Lockup Interrupt                                              */
      __IOM uint32_t SW         : 1;            /*!< [10..10] Software Interrupt                                               */
      __IOM uint32_t MDM_AP     : 1;            /*!< [11..11] MDM-AP System Reset Request                                      */
            uint32_t            : 1;
      __IOM uint32_t SACKERR    : 1;            /*!< [13..13] Stop Acknowledge Error Interrupt                                 */
            uint32_t            : 18;
    } RCM_SRIE_b;
  } ;
} RCM_Type;                                     /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                            PTA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General Purpose Input/Output (PTA)
  */

typedef struct {                                /*!< (@ 0x400FF000) PTA Structure                                              */

  union {
    __IOM uint32_t GPIOA_PDOR;                  /*!< (@ 0x00000000) Port Data Output Register                                  */

