nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t PDO        : 32;           /*!< [31..0] Port Data Output                                                  */
    } GPIOA_PDOR_b;
  } ;

  union {
    __OM  uint32_t GPIOA_PSOR;                  /*!< (@ 0x00000004) Port Set Output Register                                   */

    struct {
      __OM  uint32_t PTSO       : 32;           /*!< [31..0] Port Set Output                                                   */
    } GPIOA_PSOR_b;
  } ;

  union {
    __OM  uint32_t GPIOA_PCOR;                  /*!< (@ 0x00000008) Port Clear Output Register                                 */

    struct {
      __OM  uint32_t PTCO       : 32;           /*!< [31..0] Port Clear Output                                                 */
    } GPIOA_PCOR_b;
  } ;

  union {
    __OM  uint32_t GPIOA_PTOR;                  /*!< (@ 0x0000000C) Port Toggle Output Register                                */

    struct {
      __OM  uint32_t PTTO       : 32;           /*!< [31..0] Port Toggle Output                                                */
    } GPIOA_PTOR_b;
  } ;

  union {
    __IM  uint32_t GPIOA_PDIR;                  /*!< (@ 0x00000010) Port Data Input Register                                   */

    struct {
      __IM  uint32_t PDI        : 32;           /*!< [31..0] Port Data Input                                                   */
    } GPIOA_PDIR_b;
  } ;

  union {
    __IOM uint32_t GPIOA_PDDR;                  /*!< (@ 0x00000014) Port Data Direction Register                               */

    struct {
      __IOM uint32_t PDD        : 32;           /*!< [31..0] Port Data Direction                                               */
    } GPIOA_PDDR_b;
  } ;

  union {
    __IOM uint32_t GPIOA_PIDR;                  /*!< (@ 0x00000018) Port Input Disable Register                                */

    struct {
      __IOM uint32_t PID        : 32;           /*!< [31..0] Port Input Disable                                                */
    } GPIOA_PIDR_b;
  } ;
} PTA_Type;                                     /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                            PTB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General Purpose Input/Output (PTB)
  */

typedef struct {                                /*!< (@ 0x400FF040) PTB Structure                                              */

  union {
    __IOM uint32_t GPIOB_PDOR;                  /*!< (@ 0x00000000) Port Data Output Register                                  */

    struct {
      __IOM uint32_t PDO        : 32;           /*!< [31..0] Port Data Output                                                  */
    } GPIOB_PDOR_b;
  } ;

  union {
    __OM  uint32_t GPIOB_PSOR;                  /*!< (@ 0x00000004) Port Set Output Register                                   */

    struct {
      __OM  uint32_t PTSO       : 32;           /*!< [31..0] Port Set Output                                                   */
    } GPIOB_PSOR_b;
  } ;

  union {
    __OM  uint32_t GPIOB_PCOR;                  /*!< (@ 0x00000008) Port Clear Output Register                                 */

    struct {
      __OM  uint32_t PTCO       : 32;           /*!< [31..0] Port Clear Output                                                 */
    } GPIOB_PCOR_b;
  } ;

  union {
    __OM  uint32_t GPIOB_PTOR;                  /*!< (@ 0x0000000C) Port Toggle Output Register                                */

    struct {
      __OM  uint32_t PTTO       : 32;           /*!< [31..0] Port Toggle Output                                                */
    } GPIOB_PTOR_b;
  } ;

  union {
    __IM  uint32_t GPIOB_PDIR;                  /*!< (@ 0x00000010) Port Data Input Register                                   */

    struct {
      __IM  uint32_t PDI        : 32;           /*!< [31..0] Port Data Input                                                   */
    } GPIOB_PDIR_b;
  } ;

  union {
    __IOM uint32_t GPIOB_PDDR;                  /*!< (@ 0x00000014) Port Data Direction Register                               */

    struct {
      __IOM uint32_t PDD        : 32;           /*!< [31..0] Port Data Direction                                               */
    } GPIOB_PDDR_b;
  } ;

  union {
    __IOM uint32_t GPIOB_PIDR;                  /*!< (@ 0x00000018) Port Input Disable Register                                */

    struct {
      __IOM uint32_t PID        : 32;           /*!< [31..0] Port Input Disable                                                */
    } GPIOB_PIDR_b;
  } ;
} PTB_Type;                                     /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                            PTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General Purpose Input/Output (PTC)
  */

typedef struct {                                /*!< (@ 0x400FF080) PTC Structure                                              */

  union {
    __IOM uint32_t GPIOC_PDOR;                  /*!< (@ 0x00000000) Port Data Output Register                                  */

    struct {
      __IOM uint32_t PDO        : 32;           /*!< [31..0] Port Data Output                                                  */
    } GPIOC_PDOR_b;
  } ;

  union {
    __OM  uint32_t GPIOC_PSOR;                  /*!< (@ 0x00000004) Port Set Output Register                                   */

