nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __OM  uint32_t PTSO       : 32;           /*!< [31..0] Port Set Output                                                   */
    } GPIOC_PSOR_b;
  } ;

  union {
    __OM  uint32_t GPIOC_PCOR;                  /*!< (@ 0x00000008) Port Clear Output Register                                 */

    struct {
      __OM  uint32_t PTCO       : 32;           /*!< [31..0] Port Clear Output                                                 */
    } GPIOC_PCOR_b;
  } ;

  union {
    __OM  uint32_t GPIOC_PTOR;                  /*!< (@ 0x0000000C) Port Toggle Output Register                                */

    struct {
      __OM  uint32_t PTTO       : 32;           /*!< [31..0] Port Toggle Output                                                */
    } GPIOC_PTOR_b;
  } ;

  union {
    __IM  uint32_t GPIOC_PDIR;                  /*!< (@ 0x00000010) Port Data Input Register                                   */

    struct {
      __IM  uint32_t PDI        : 32;           /*!< [31..0] Port Data Input                                                   */
    } GPIOC_PDIR_b;
  } ;

  union {
    __IOM uint32_t GPIOC_PDDR;                  /*!< (@ 0x00000014) Port Data Direction Register                               */

    struct {
      __IOM uint32_t PDD        : 32;           /*!< [31..0] Port Data Direction                                               */
    } GPIOC_PDDR_b;
  } ;

  union {
    __IOM uint32_t GPIOC_PIDR;                  /*!< (@ 0x00000018) Port Input Disable Register                                */

    struct {
      __IOM uint32_t PID        : 32;           /*!< [31..0] Port Input Disable                                                */
    } GPIOC_PIDR_b;
  } ;
} PTC_Type;                                     /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                            PTD                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General Purpose Input/Output (PTD)
  */

typedef struct {                                /*!< (@ 0x400FF0C0) PTD Structure                                              */

  union {
    __IOM uint32_t GPIOD_PDOR;                  /*!< (@ 0x00000000) Port Data Output Register                                  */

    struct {
      __IOM uint32_t PDO        : 32;           /*!< [31..0] Port Data Output                                                  */
    } GPIOD_PDOR_b;
  } ;

  union {
    __OM  uint32_t GPIOD_PSOR;                  /*!< (@ 0x00000004) Port Set Output Register                                   */

    struct {
      __OM  uint32_t PTSO       : 32;           /*!< [31..0] Port Set Output                                                   */
    } GPIOD_PSOR_b;
  } ;

  union {
    __OM  uint32_t GPIOD_PCOR;                  /*!< (@ 0x00000008) Port Clear Output Register                                 */

    struct {
      __OM  uint32_t PTCO       : 32;           /*!< [31..0] Port Clear Output                                                 */
    } GPIOD_PCOR_b;
  } ;

  union {
    __OM  uint32_t GPIOD_PTOR;                  /*!< (@ 0x0000000C) Port Toggle Output Register                                */

    struct {
      __OM  uint32_t PTTO       : 32;           /*!< [31..0] Port Toggle Output                                                */
    } GPIOD_PTOR_b;
  } ;

  union {
    __IM  uint32_t GPIOD_PDIR;                  /*!< (@ 0x00000010) Port Data Input Register                                   */

    struct {
      __IM  uint32_t PDI        : 32;           /*!< [31..0] Port Data Input                                                   */
    } GPIOD_PDIR_b;
  } ;

  union {
    __IOM uint32_t GPIOD_PDDR;                  /*!< (@ 0x00000014) Port Data Direction Register                               */

    struct {
      __IOM uint32_t PDD        : 32;           /*!< [31..0] Port Data Direction                                               */
    } GPIOD_PDDR_b;
  } ;

  union {
    __IOM uint32_t GPIOD_PIDR;                  /*!< (@ 0x00000018) Port Input Disable Register                                */

    struct {
      __IOM uint32_t PID        : 32;           /*!< [31..0] Port Input Disable                                                */
    } GPIOD_PIDR_b;
  } ;
} PTD_Type;                                     /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                            PTE                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General Purpose Input/Output (PTE)
  */

typedef struct {                                /*!< (@ 0x400FF100) PTE Structure                                              */

  union {
    __IOM uint32_t GPIOE_PDOR;                  /*!< (@ 0x00000000) Port Data Output Register                                  */

    struct {
      __IOM uint32_t PDO        : 32;           /*!< [31..0] Port Data Output                                                  */
    } GPIOE_PDOR_b;
  } ;

  union {
    __OM  uint32_t GPIOE_PSOR;                  /*!< (@ 0x00000004) Port Set Output Register                                   */

    struct {
      __OM  uint32_t PTSO       : 32;           /*!< [31..0] Port Set Output                                                   */
    } GPIOE_PSOR_b;
  } ;

  union {
    __OM  uint32_t GPIOE_PCOR;                  /*!< (@ 0x00000008) Port Clear Output Register                                 */

