nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
            uint32_t            : 1;
      __IOM uint32_t SLEEPONEXIT : 1;           /*!< [1..1] Indicates sleep-on-exit when returning from Handler mode
                                                     to Thread mode                                                            */
      __IOM uint32_t SLEEPDEEP  : 1;            /*!< [2..2] Controls whether the processor uses sleep or deep sleep
                                                     as its low power mode                                                     */
            uint32_t            : 1;
      __IOM uint32_t SEVONPEND  : 1;            /*!< [4..4] Send Event on Pending bit                                          */
            uint32_t            : 27;
    } SCB_SCR_b;
  } ;

  union {
    __IM  uint32_t SCB_CCR;                     /*!< (@ 0x00000D14) Configuration and Control Register                         */

    struct {
            uint32_t            : 3;
      __IM  uint32_t UNALIGN_TRP : 1;           /*!< [3..3] Always reads as one, indicates that all unaligned accesses
                                                     generate a HardFault                                                      */
            uint32_t            : 5;
      __IM  uint32_t STKALIGN   : 1;            /*!< [9..9] Indicates stack alignment on exception entry                       */
            uint32_t            : 22;
    } SCB_CCR_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t SCB_SHPR2;                   /*!< (@ 0x00000D1C) System Handler Priority Register 2                         */

    struct {
            uint32_t            : 24;
      __IOM uint32_t PRI_11     : 8;            /*!< [31..24] Priority of system handler 11, SVCall                            */
    } SCB_SHPR2_b;
  } ;

  union {
    __IOM uint32_t SCB_SHPR3;                   /*!< (@ 0x00000D20) System Handler Priority Register 3                         */

    struct {
            uint32_t            : 16;
      __IOM uint32_t PRI_14     : 8;            /*!< [23..16] Priority of system handler 14, PendSV                            */
      __IOM uint32_t PRI_15     : 8;            /*!< [31..24] Priority of system handler 15, SysTick exception                 */
    } SCB_SHPR3_b;
  } ;

  union {
    __IOM uint32_t SCB_SHCSR;                   /*!< (@ 0x00000D24) System Handler Control and State Register                  */

    struct {
            uint32_t            : 15;
      __IOM uint32_t SVCALLPENDED : 1;          /*!< [15..15] SVCall pending bit, reads as 1 if exception is pending           */
            uint32_t            : 16;
    } SCB_SHCSR_b;
  } ;
  __IM  uint32_t  RESERVED3[2];

  union {
    __IOM uint32_t SCB_DFSR;                    /*!< (@ 0x00000D30) Debug Fault Status Register                                */

    struct {
      __IOM uint32_t HALTED     : 1;            /*!< [0..0] HALTED                                                             */
      __IOM uint32_t BKPT       : 1;            /*!< [1..1] BKPT                                                               */
      __IOM uint32_t DWTTRAP    : 1;            /*!< [2..2] DWTTRAP                                                            */
      __IOM uint32_t VCATCH     : 1;            /*!< [3..3] VCATCH                                                             */
      __IOM uint32_t EXTERNAL   : 1;            /*!< [4..4] EXTERNAL                                                           */
            uint32_t            : 27;
    } SCB_DFSR_b;
  } ;
} S32_SCB_Type;                                 /*!< Size = 3380 (0xd34)                                                       */



/* =========================================================================================================================== */
/* ================                                        S32_SysTick                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief System timer (S32_SysTick)
  */

typedef struct {                                /*!< (@ 0xE000E010) S32_SysTick Structure                                      */

  union {
    __IOM uint32_t SYST_CSR;                    /*!< (@ 0x00000000) SysTick Control and Status Register                        */

    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< [0..0] Enables the counter                                                */
      __IOM uint32_t TICKINT    : 1;            /*!< [1..1] Enables SysTick exception request                                  */
      __IOM uint32_t CLKSOURCE  : 1;            /*!< [2..2] Indicates the clock source                                         */
            uint32_t            : 13;
      __IOM uint32_t COUNTFLAG  : 1;            /*!< [16..16] Returns 1 if timer counted to 0 since last time this
                                                     was read                                                                  */
            uint32_t            : 15;
    } SYST_CSR_b;
  } ;

  union {
    __IOM uint32_t SYST_RVR;                    /*!< (@ 0x00000004) SysTick Reload Value Register                              */

    struct {
      __IOM uint32_t RELOAD     : 24;           /*!< [23..0] Value to load into the SysTick Current Value Register
                                                     when the counter reaches 0                                                */
            uint32_t            : 8;
    } SYST_RVR_b;
  } ;

  union {
    __IOM uint32_t SYST_CVR;                    /*!< (@ 0x00000008) SysTick Current Value Register                             */

    struct {
      __IOM uint32_t CURRENT    : 24;           /*!< [23..0] Current value at the time the register is accessed                */
            uint32_t            : 8;
    } SYST_CVR_b;
  } ;

  union {
    __IM  uint32_t SYST_CALIB;                  /*!< (@ 0x0000000C) SysTick Calibration Value Register                         */

