nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint32_t TENMS      : 24;           /*!< [23..0] Reload value to use for 10ms timing                               */
            uint32_t            : 6;
      __IM  uint32_t SKEW       : 1;            /*!< [30..30] Indicates whether the TENMS value is exact                       */
      __IM  uint32_t NOREF      : 1;            /*!< [31..31] Indicates whether the device provides a reference clock
                                                     to the processor                                                          */
    } SYST_CALIB_b;
  } ;
} S32_SysTick_Type;                             /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                         S32_NVIC                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Nested Vectored Interrupt Controller (S32_NVIC)
  */

typedef struct {                                /*!< (@ 0xE000E100) S32_NVIC Structure                                         */

  union {
    __IOM uint32_t S32_NVIC_ISER;               /*!< (@ 0x00000000) Interrupt Set Enable Register                              */

    struct {
      __IOM uint32_t SETENA     : 32;           /*!< [31..0] Interrupt set enable bits                                         */
    } S32_NVIC_ISER_b;
  } ;
  __IM  uint32_t  RESERVED[31];

  union {
    __IOM uint32_t S32_NVIC_ICER;               /*!< (@ 0x00000080) Interrupt Clear Enable Register                            */

    struct {
      __IOM uint32_t CLRENA     : 32;           /*!< [31..0] Interrupt clear-enable bits                                       */
    } S32_NVIC_ICER_b;
  } ;
  __IM  uint32_t  RESERVED1[31];

  union {
    __IOM uint32_t S32_NVIC_ISPR;               /*!< (@ 0x00000100) Interrupt Set Pending Register                             */

    struct {
      __IOM uint32_t SETPEND    : 32;           /*!< [31..0] Interrupt set-pending bits                                        */
    } S32_NVIC_ISPR_b;
  } ;
  __IM  uint32_t  RESERVED2[31];

  union {
    __IOM uint32_t S32_NVIC_ICPR;               /*!< (@ 0x00000180) Interrupt Clear Pending Register                           */

    struct {
      __IOM uint32_t CLRPEND    : 32;           /*!< [31..0] Interrupt clear-pending bits                                      */
    } S32_NVIC_ICPR_b;
  } ;
  __IM  uint32_t  RESERVED3[95];

  union {
    __IOM uint32_t S32_NVIC_IPR0;               /*!< (@ 0x00000300) Interrupt Priority Register n                              */

    struct {
      __IOM uint32_t PRI_0      : 8;            /*!< [7..0] Priority of interrupt 0                                            */
      __IOM uint32_t PRI_1      : 8;            /*!< [15..8] Priority of interrupt 1                                           */
      __IOM uint32_t PRI_2      : 8;            /*!< [23..16] Priority of interrupt 2                                          */
      __IOM uint32_t PRI_3      : 8;            /*!< [31..24] Priority of interrupt 3                                          */
    } S32_NVIC_IPR0_b;
  } ;

  union {
    __IOM uint32_t S32_NVIC_IPR1;               /*!< (@ 0x00000304) Interrupt Priority Register n                              */

    struct {
      __IOM uint32_t PRI_0      : 8;            /*!< [7..0] Priority of interrupt 0                                            */
      __IOM uint32_t PRI_1      : 8;            /*!< [15..8] Priority of interrupt 1                                           */
      __IOM uint32_t PRI_2      : 8;            /*!< [23..16] Priority of interrupt 2                                          */
      __IOM uint32_t PRI_3      : 8;            /*!< [31..24] Priority of interrupt 3                                          */
    } S32_NVIC_IPR1_b;
  } ;

  union {
    __IOM uint32_t S32_NVIC_IPR2;               /*!< (@ 0x00000308) Interrupt Priority Register n                              */

    struct {
      __IOM uint32_t PRI_0      : 8;            /*!< [7..0] Priority of interrupt 0                                            */
      __IOM uint32_t PRI_1      : 8;            /*!< [15..8] Priority of interrupt 1                                           */
      __IOM uint32_t PRI_2      : 8;            /*!< [23..16] Priority of interrupt 2                                          */
      __IOM uint32_t PRI_3      : 8;            /*!< [31..24] Priority of interrupt 3                                          */
    } S32_NVIC_IPR2_b;
  } ;

  union {
    __IOM uint32_t S32_NVIC_IPR3;               /*!< (@ 0x0000030C) Interrupt Priority Register n                              */

    struct {
      __IOM uint32_t PRI_0      : 8;            /*!< [7..0] Priority of interrupt 0                                            */
      __IOM uint32_t PRI_1      : 8;            /*!< [15..8] Priority of interrupt 1                                           */
      __IOM uint32_t PRI_2      : 8;            /*!< [23..16] Priority of interrupt 2                                          */
      __IOM uint32_t PRI_3      : 8;            /*!< [31..24] Priority of interrupt 3                                          */
    } S32_NVIC_IPR3_b;
  } ;

  union {
    __IOM uint32_t S32_NVIC_IPR4;               /*!< (@ 0x00000310) Interrupt Priority Register n                              */

    struct {
      __IOM uint32_t PRI_0      : 8;            /*!< [7..0] Priority of interrupt 0                                            */
      __IOM uint32_t PRI_1      : 8;            /*!< [15..8] Priority of interrupt 1                                           */
      __IOM uint32_t PRI_2      : 8;            /*!< [23..16] Priority of interrupt 2                                          */
      __IOM uint32_t PRI_3      : 8;            /*!< [31..24] Priority of interrupt 3                                          */
    } S32_NVIC_IPR4_b;
  } ;

  union {
    __IOM uint32_t S32_NVIC_IPR5;               /*!< (@ 0x00000314) Interrupt Priority Register n                              */

