nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t DATA       : 32;           /*!< [31..0] Cache read/write Data                                             */
    } LMEM_LMEM_PCCCVR_b;
  } ;
  __IM  uint32_t  RESERVED[4];

  union {
    __IOM uint32_t LMEM_PCCRMR;                 /*!< (@ 0x00000020) Cache regions mode register                                */

    struct {
      __IOM uint32_t R15        : 2;            /*!< [1..0] Region 15 mode                                                     */
      __IOM uint32_t R14        : 2;            /*!< [3..2] Region 14 mode                                                     */
      __IOM uint32_t R13        : 2;            /*!< [5..4] Region 13 mode                                                     */
      __IOM uint32_t R12        : 2;            /*!< [7..6] Region 12 mode                                                     */
      __IOM uint32_t R11        : 2;            /*!< [9..8] Region 11 mode                                                     */
      __IOM uint32_t R10        : 2;            /*!< [11..10] Region 10 mode                                                   */
      __IOM uint32_t R9         : 2;            /*!< [13..12] Region 9 mode                                                    */
      __IOM uint32_t R8         : 2;            /*!< [15..14] Region 8 mode                                                    */
      __IOM uint32_t R7         : 2;            /*!< [17..16] Region 7 mode                                                    */
      __IOM uint32_t R6         : 2;            /*!< [19..18] Region 6 mode                                                    */
      __IOM uint32_t R5         : 2;            /*!< [21..20] Region 5 mode                                                    */
      __IOM uint32_t R4         : 2;            /*!< [23..22] Region 4 mode                                                    */
      __IOM uint32_t R3         : 2;            /*!< [25..24] Region 3 mode                                                    */
      __IOM uint32_t R2         : 2;            /*!< [27..26] Region 2 mode                                                    */
      __IOM uint32_t R1         : 2;            /*!< [29..28] Region 1 mode                                                    */
      __IOM uint32_t R0         : 2;            /*!< [31..30] Region 0 mode                                                    */
    } LMEM_PCCRMR_b;
  } ;
} LMEM_Type;                                    /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                          MTB_DWT                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief MTB data watchpoint and trace (MTB_DWT)
  */

typedef struct {                                /*!< (@ 0xF0001000) MTB_DWT Structure                                          */

  union {
    __IM  uint32_t MTB_DWT_CTRL;                /*!< (@ 0x00000000) MTB DWT Control Register                                   */

    struct {
      __IM  uint32_t DWTCFGCTRL : 28;           /*!< [27..0] DWT configuration controls                                        */
      __IM  uint32_t NUMCMP     : 4;            /*!< [31..28] Number of comparators                                            */
    } MTB_DWT_CTRL_b;
  } ;
  __IM  uint32_t  RESERVED[7];

  union {
    __IOM uint32_t MTB_DWT_COMP0;               /*!< (@ 0x00000020) MTB_DWT Comparator Register                                */

    struct {
      __IOM uint32_t COMP       : 32;           /*!< [31..0] Reference value for comparison                                    */
    } MTB_DWT_COMP0_b;
  } ;

  union {
    __IOM uint32_t MTB_DWT_MASK0;               /*!< (@ 0x00000024) MTB_DWT Comparator Mask Register                           */

    struct {
      __IOM uint32_t MASK       : 5;            /*!< [4..0] MASK                                                               */
            uint32_t            : 27;
    } MTB_DWT_MASK0_b;
  } ;

  union {
    __IOM uint32_t MTB_DWT_FCT0;                /*!< (@ 0x00000028) MTB_DWT Comparator Function Register 0                     */

    struct {
      __IOM uint32_t FUNCTION   : 4;            /*!< [3..0] Function                                                           */
            uint32_t            : 4;
      __IOM uint32_t DATAVMATCH : 1;            /*!< [8..8] Data Value Match                                                   */
            uint32_t            : 1;
      __IOM uint32_t DATAVSIZE  : 2;            /*!< [11..10] Data Value Size                                                  */
      __IOM uint32_t DATAVADDR0 : 4;            /*!< [15..12] Data Value Address 0                                             */
            uint32_t            : 8;
      __IM  uint32_t MATCHED    : 1;            /*!< [24..24] Comparator match                                                 */
            uint32_t            : 7;
    } MTB_DWT_FCT0_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t MTB_DWT_COMP1;               /*!< (@ 0x00000030) MTB_DWT Comparator Register                                */

    struct {
      __IOM uint32_t COMP       : 32;           /*!< [31..0] Reference value for comparison                                    */
    } MTB_DWT_COMP1_b;
  } ;

  union {
    __IOM uint32_t MTB_DWT_MASK1;               /*!< (@ 0x00000034) MTB_DWT Comparator Mask Register                           */

    struct {
      __IOM uint32_t MASK       : 5;            /*!< [4..0] MASK                                                               */
            uint32_t            : 27;
    } MTB_DWT_MASK1_b;
  } ;

  union {
    __IOM uint32_t MTB_DWT_FCT1;                /*!< (@ 0x00000038) MTB_DWT Comparator Function Register 1                     */

