nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t FUNCTION   : 4;            /*!< [3..0] Function                                                           */
            uint32_t            : 20;
      __IM  uint32_t MATCHED    : 1;            /*!< [24..24] Comparator match                                                 */
            uint32_t            : 7;
    } MTB_DWT_FCT1_b;
  } ;
  __IM  uint32_t  RESERVED2[113];

  union {
    __IOM uint32_t MTB_DWT_TBCTRL;              /*!< (@ 0x00000200) MTB_DWT Trace Buffer Control Register                      */

    struct {
      __IOM uint32_t ACOMP0     : 1;            /*!< [0..0] Action based on Comparator 0 match                                 */
      __IOM uint32_t ACOMP1     : 1;            /*!< [1..1] Action based on Comparator 1 match                                 */
            uint32_t            : 26;
      __IM  uint32_t NUMCOMP    : 4;            /*!< [31..28] Number of Comparators                                            */
    } MTB_DWT_TBCTRL_b;
  } ;
  __IM  uint32_t  RESERVED3[881];

  union {
    __IM  uint32_t MTB_DWT_DEVICECFG;           /*!< (@ 0x00000FC8) Device Configuration Register                              */

    struct {
      __IM  uint32_t DEVICECFG  : 32;           /*!< [31..0] DEVICECFG                                                         */
    } MTB_DWT_DEVICECFG_b;
  } ;

  union {
    __IM  uint32_t MTB_DWT_DEVICETYPID;         /*!< (@ 0x00000FCC) Device Type Identifier Register                            */

    struct {
      __IM  uint32_t DEVICETYPID : 32;          /*!< [31..0] DEVICETYPID                                                       */
    } MTB_DWT_DEVICETYPID_b;
  } ;

  union {
    __IM  uint32_t MTB_DWT_PERIPHID4;           /*!< (@ 0x00000FD0) Peripheral ID Register                                     */

    struct {
      __IM  uint32_t PERIPHID   : 32;           /*!< [31..0] PERIPHID                                                          */
    } MTB_DWT_PERIPHID4_b;
  } ;

  union {
    __IM  uint32_t MTB_DWT_PERIPHID5;           /*!< (@ 0x00000FD4) Peripheral ID Register                                     */

    struct {
      __IM  uint32_t PERIPHID   : 32;           /*!< [31..0] PERIPHID                                                          */
    } MTB_DWT_PERIPHID5_b;
  } ;

  union {
    __IM  uint32_t MTB_DWT_PERIPHID6;           /*!< (@ 0x00000FD8) Peripheral ID Register                                     */

    struct {
      __IM  uint32_t PERIPHID   : 32;           /*!< [31..0] PERIPHID                                                          */
    } MTB_DWT_PERIPHID6_b;
  } ;

  union {
    __IM  uint32_t MTB_DWT_PERIPHID7;           /*!< (@ 0x00000FDC) Peripheral ID Register                                     */

    struct {
      __IM  uint32_t PERIPHID   : 32;           /*!< [31..0] PERIPHID                                                          */
    } MTB_DWT_PERIPHID7_b;
  } ;

  union {
    __IM  uint32_t MTB_DWT_PERIPHID0;           /*!< (@ 0x00000FE0) Peripheral ID Register                                     */

    struct {
      __IM  uint32_t PERIPHID   : 32;           /*!< [31..0] PERIPHID                                                          */
    } MTB_DWT_PERIPHID0_b;
  } ;

  union {
    __IM  uint32_t MTB_DWT_PERIPHID1;           /*!< (@ 0x00000FE4) Peripheral ID Register                                     */

    struct {
      __IM  uint32_t PERIPHID   : 32;           /*!< [31..0] PERIPHID                                                          */
    } MTB_DWT_PERIPHID1_b;
  } ;

  union {
    __IM  uint32_t MTB_DWT_PERIPHID2;           /*!< (@ 0x00000FE8) Peripheral ID Register                                     */

    struct {
      __IM  uint32_t PERIPHID   : 32;           /*!< [31..0] PERIPHID                                                          */
    } MTB_DWT_PERIPHID2_b;
  } ;

  union {
    __IM  uint32_t MTB_DWT_PERIPHID3;           /*!< (@ 0x00000FEC) Peripheral ID Register                                     */

    struct {
      __IM  uint32_t PERIPHID   : 32;           /*!< [31..0] PERIPHID                                                          */
    } MTB_DWT_PERIPHID3_b;
  } ;

  union {
    __IM  uint32_t MTB_DWT_COMPID0;             /*!< (@ 0x00000FF0) Component ID Register                                      */

    struct {
      __IM  uint32_t COMPID     : 32;           /*!< [31..0] Component ID                                                      */
    } MTB_DWT_COMPID0_b;
  } ;

  union {
    __IM  uint32_t MTB_DWT_COMPID1;             /*!< (@ 0x00000FF4) Component ID Register                                      */

    struct {
      __IM  uint32_t COMPID     : 32;           /*!< [31..0] Component ID                                                      */
    } MTB_DWT_COMPID1_b;
  } ;

  union {
    __IM  uint32_t MTB_DWT_COMPID2;             /*!< (@ 0x00000FF8) Component ID Register                                      */

    struct {
      __IM  uint32_t COMPID     : 32;           /*!< [31..0] Component ID                                                      */
    } MTB_DWT_COMPID2_b;
  } ;

  union {
    __IM  uint32_t MTB_DWT_COMPID3;             /*!< (@ 0x00000FFC) Component ID Register                                      */

    struct {
      __IM  uint32_t COMPID     : 32;           /*!< [31..0] Component ID                                                      */
    } MTB_DWT_COMPID3_b;
  } ;
} MTB_DWT_Type;                                 /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                            MCM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Core Platform Miscellaneous Control Module (MCM)
  */

typedef struct {                                /*!< (@ 0xF0003000) MCM Structure                                              */
  __IM  uint32_t  RESERVED[2];

  union {
    __IM  uint16_t MCM_PLASC;                   /*!< (@ 0x00000008) Crossbar Switch (AXBS) Slave Configuration                 */

