nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint16_t ASC        : 8;            /*!< [7..0] Each bit in the ASC field indicates whether there is
                                                     a corresponding connection to the crossbar switchs slave
                                                     input port.                                                               */
            uint16_t            : 8;
    } MCM_PLASC_b;
  } ;

  union {
    __IM  uint16_t MCM_PLAMC;                   /*!< (@ 0x0000000A) Crossbar Switch (AXBS) Master Configuration                */

    struct {
      __IM  uint16_t AMC        : 8;            /*!< [7..0] Each bit in the AMC field indicates whether there is
                                                     a corresponding connection to the AXBS master input port.                 */
            uint16_t            : 8;
    } MCM_PLAMC_b;
  } ;

  union {
    __IOM uint32_t MCM_CPCR;                    /*!< (@ 0x0000000C) Core Platform Control Register                             */

    struct {
      __IM  uint32_t HLT_FSM_ST : 2;            /*!< [1..0] AXBS Halt State Machine Status                                     */
      __IM  uint32_t AXBS_HLT_REQ : 1;          /*!< [2..2] AXBS Halt Request                                                  */
      __IM  uint32_t AXBS_HLTD  : 1;            /*!< [3..3] AXBS Halted                                                        */
      __IM  uint32_t FMC_PF_IDLE : 1;           /*!< [4..4] Flash Memory Controller Program Flash Idle                         */
            uint32_t            : 1;
      __IM  uint32_t PBRIDGE_IDLE : 1;          /*!< [6..6] Peripheral Bridge Idle                                             */
            uint32_t            : 2;
      __IOM uint32_t CBRR       : 1;            /*!< [9..9] Crossbar Round-robin Arbitration Enable                            */
            uint32_t            : 22;
    } MCM_CPCR_b;
  } ;
  __IM  uint32_t  RESERVED1[8];

  union {
    __IOM uint32_t MCM_PID;                     /*!< (@ 0x00000030) Process ID Register                                        */

    struct {
      __IOM uint32_t PID        : 8;            /*!< [7..0] M0_PID and M1_PID for MPU                                          */
            uint32_t            : 24;
    } MCM_PID_b;
  } ;
  __IM  uint32_t  RESERVED2[3];

  union {
    __IOM uint32_t MCM_CPO;                     /*!< (@ 0x00000040) Compute Operation Control Register                         */

    struct {
      __IOM uint32_t CPOREQ     : 1;            /*!< [0..0] Compute Operation Request                                          */
      __IM  uint32_t CPOACK     : 1;            /*!< [1..1] Compute Operation Acknowledge                                      */
      __IOM uint32_t CPOWOI     : 1;            /*!< [2..2] Compute Operation Wakeup On Interrupt                              */
            uint32_t            : 29;
    } MCM_CPO_b;
  } ;
  __IM  uint32_t  RESERVED3[239];

  union {
    __IOM uint32_t MCM_LMDR0;                   /*!< (@ 0x00000400) Local Memory Descriptor Register                           */

    struct {
      __IOM uint32_t CF0        : 4;            /*!< [3..0] Control Field 0 LMDR0[CF0] bit field is Reserved and
                                                     Read-Only 0 for S32K11x variants.                                         */
            uint32_t            : 9;
      __IM  uint32_t MT         : 3;            /*!< [15..13] Memory Type                                                      */
            uint32_t            : 1;
      __IM  uint32_t DPW        : 3;            /*!< [19..17] LMEM Data Path Width. This field defines the width
                                                     of the local memory.                                                      */
      __IM  uint32_t WY         : 4;            /*!< [23..20] Level 1 Cache Ways                                               */
      __IM  uint32_t LMSZ       : 4;            /*!< [27..24] LMEM Size                                                        */
      __IM  uint32_t LMSZH      : 1;            /*!< [28..28] LMEM Size Hole                                                   */
            uint32_t            : 2;
      __IM  uint32_t V          : 1;            /*!< [31..31] Local Memory Valid                                               */
    } MCM_LMDR0_b;
  } ;

  union {
    __IOM uint32_t MCM_LMDR1;                   /*!< (@ 0x00000404) Local Memory Descriptor Register                           */

    struct {
      __IOM uint32_t CF0        : 4;            /*!< [3..0] Control Field 0 LMDR0[CF0] bit field is Reserved and
                                                     Read-Only 0 for S32K11x variants.                                         */
            uint32_t            : 9;
      __IM  uint32_t MT         : 3;            /*!< [15..13] Memory Type                                                      */
            uint32_t            : 1;
      __IM  uint32_t DPW        : 3;            /*!< [19..17] LMEM Data Path Width. This field defines the width
                                                     of the local memory.                                                      */
      __IM  uint32_t WY         : 4;            /*!< [23..20] Level 1 Cache Ways                                               */
      __IM  uint32_t LMSZ       : 4;            /*!< [27..24] LMEM Size                                                        */
      __IM  uint32_t LMSZH      : 1;            /*!< [28..28] LMEM Size Hole                                                   */
            uint32_t            : 2;
      __IM  uint32_t V          : 1;            /*!< [31..31] Local Memory Valid                                               */
    } MCM_LMDR1_b;
  } ;
  __IM  uint32_t  RESERVED4[30];
  __IM  uint32_t  MCM_LMPECR;                   /*!< (@ 0x00000480) LMEM Parity and ECC Control Register                       */
  __IM  uint32_t  RESERVED5;

  union {
    __IOM uint32_t MCM_LMPEIR;                  /*!< (@ 0x00000488) LMEM Parity and ECC Interrupt Register                     */

