nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t ENC        : 8;            /*!< [7..0] ENCn = ECC Noncorrectable Error n                                  */
      __IOM uint32_t E1B        : 8;            /*!< [15..8] E1Bn = ECC 1-bit Error n                                          */
            uint32_t            : 8;
      __IM  uint32_t PEELOC     : 5;            /*!< [28..24] Parity or ECC Error Location                                     */
            uint32_t            : 2;
      __IM  uint32_t V          : 1;            /*!< [31..31] Valid Bit                                                        */
    } MCM_LMPEIR_b;
  } ;
  __IM  uint32_t  RESERVED6;

  union {
    __IM  uint32_t MCM_LMFAR;                   /*!< (@ 0x00000490) LMEM Fault Address Register                                */

    struct {
      __IM  uint32_t EFADD      : 32;           /*!< [31..0] ECC Fault Address                                                 */
    } MCM_LMFAR_b;
  } ;

  union {
    __IM  uint32_t MCM_LMFATR;                  /*!< (@ 0x00000494) LMEM Fault Attribute Register                              */

    struct {
      __IM  uint32_t PEFPRT     : 4;            /*!< [3..0] Parity/ECC Fault Protection                                        */
      __IM  uint32_t PEFSIZE    : 3;            /*!< [6..4] Parity/ECC Fault Master Size                                       */
      __IM  uint32_t PEFW       : 1;            /*!< [7..7] Parity/ECC Fault Write                                             */
      __IM  uint32_t PEFMST     : 8;            /*!< [15..8] Parity/ECC Fault Master Number                                    */
            uint32_t            : 15;
      __IM  uint32_t OVR        : 1;            /*!< [31..31] Overrun                                                          */
    } MCM_LMFATR_b;
  } ;
  __IM  uint32_t  RESERVED7[2];

  union {
    __IM  uint32_t MCM_LMFDHR;                  /*!< (@ 0x000004A0) LMEM Fault Data High Register                              */

    struct {
      __IM  uint32_t PEFDH      : 32;           /*!< [31..0] Parity or ECC Fault Data High                                     */
    } MCM_LMFDHR_b;
  } ;

  union {
    __IM  uint32_t MCM_LMFDLR;                  /*!< (@ 0x000004A4) LMEM Fault Data Low Register                               */

    struct {
      __IM  uint32_t PEFDL      : 32;           /*!< [31..0] Parity or ECC Fault Data Low                                      */
    } MCM_LMFDLR_b;
  } ;
} MCM_Type;                                     /*!< Size = 1192 (0x4a8)                                                       */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define CSE_PRAM_BASE               0x14000800UL
#define AIPS_BASE                   0x40000000UL
#define MSCM_BASE                   0x40001000UL
#define DMA_BASE                    0x40008000UL
#define MPU_BASE                    0x4000D000UL
#define ERM_BASE                    0x40018000UL
#define EIM_BASE                    0x40019000UL
#define FTFC_BASE                   0x40020000UL
#define DMAMUX_BASE                 0x40021000UL
#define CAN0_BASE                   0x40024000UL
#define LPSPI0_BASE                 0x4002C000UL
#define LPSPI1_BASE                 0x4002D000UL
#define CRC_BASE                    0x40032000UL
#define PDB0_BASE                   0x40036000UL
#define LPIT0_BASE                  0x40037000UL
#define FTM0_BASE                   0x40038000UL
#define FTM1_BASE                   0x40039000UL
#define ADC0_BASE                   0x4003B000UL
#define RTC_BASE                    0x4003D000UL
#define CMU_FC_0_BASE               0x4003E000UL
#define CMU_FC_1_BASE               0x4003F000UL
#define LPTMR0_BASE                 0x40040000UL
#define SIM_BASE                    0x40048000UL
#define PORTA_BASE                  0x40049000UL
#define PORTB_BASE                  0x4004A000UL
#define PORTC_BASE                  0x4004B000UL
#define PORTD_BASE                  0x4004C000UL
#define PORTE_BASE                  0x4004D000UL
#define WDOG_BASE                   0x40052000UL
#define FLEXIO_BASE                 0x4005A000UL
#define TRGMUX_BASE                 0x40063000UL
#define SCG_BASE                    0x40064000UL
#define PCC_BASE                    0x40065000UL
#define LPI2C0_BASE                 0x40066000UL
#define LPUART0_BASE                0x4006A000UL
#define LPUART1_BASE                0x4006B000UL
#define CMP0_BASE                   0x40073000UL
#define PMC_BASE                    0x4007D000UL
#define SMC_BASE                    0x4007E000UL
#define RCM_BASE                    0x4007F000UL
#define PTA_BASE                    0x400FF000UL
#define PTB_BASE                    0x400FF040UL
#define PTC_BASE                    0x400FF080UL
#define PTD_BASE                    0x400FF0C0UL
#define PTE_BASE                    0x400FF100UL
#define S32_SCB_BASE                0xE000E000UL
#define S32_SysTick_BASE            0xE000E010UL
#define S32_NVIC_BASE               0xE000E100UL
#define LMEM_BASE                   0xE0082000UL
#define MTB_DWT_BASE                0xF0001000UL
#define MCM_BASE                    0xF0003000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define CSE_PRAM                    ((CSE_PRAM_Type*)          CSE_PRAM_BASE)
#define AIPS                        ((AIPS_Type*)              AIPS_BASE)
#define MSCM                        ((MSCM_Type*)              MSCM_BASE)
#define DMA                         ((DMA_Type*)               DMA_BASE)
#define MPU                         ((MPU_Type*)               MPU_BASE)
#define ERM                         ((ERM_Type*)               ERM_BASE)
#define EIM                         ((EIM_Type*)               EIM_BASE)
#define FTFC                        ((FTFC_Type*)              FTFC_BASE)
#define DMAMUX                      ((DMAMUX_Type*)            DMAMUX_BASE)
#define CAN0                        ((CAN0_Type*)              CAN0_BASE)
#define LPSPI0                      ((LPSPI0_Type*)            LPSPI0_BASE)
#define LPSPI1                      ((LPSPI1_Type*)            LPSPI1_BASE)
#define CRC                         ((CRC_Type*)               CRC_BASE)
#define PDB0                        ((PDB0_Type*)              PDB0_BASE)
#define LPIT0                       ((LPIT0_Type*)             LPIT0_BASE)
#define FTM0                        ((FTM0_Type*)              FTM0_BASE)
#define FTM1                        ((FTM1_Type*)              FTM1_BASE)
#define ADC0                        ((ADC0_Type*)              ADC0_BASE)
#define RTC                         ((RTC_Type*)               RTC_BASE)
#define CMU_FC_0                    ((CMU_FC_0_Type*)          CMU_FC_0_BASE)
#define CMU_FC_1                    ((CMU_FC_1_Type*)          CMU_FC_1_BASE)
#define LPTMR0                      ((LPTMR0_Type*)            LPTMR0_BASE)
#define SIM                         ((SIM_Type*)               SIM_BASE)
#define PORTA                       ((PORTA_Type*)             PORTA_BASE)
#define PORTB                       ((PORTB_Type*)             PORTB_BASE)
#define PORTC                       ((PORTC_Type*)             PORTC_BASE)
#define PORTD                       ((PORTD_Type*)             PORTD_BASE)
#define PORTE                       ((PORTE_Type*)             PORTE_BASE)
#define WDOG                        ((WDOG_Type*)              WDOG_BASE)
#define FLEXIO                      ((FLEXIO_Type*)            FLEXIO_BASE)
#define TRGMUX                      ((TRGMUX_Type*)            TRGMUX_BASE)
#define SCG                         ((SCG_Type*)               SCG_BASE)
#define PCC                         ((PCC_Type*)               PCC_BASE)
#define LPI2C0                      ((LPI2C0_Type*)            LPI2C0_BASE)
#define LPUART0                     ((LPUART0_Type*)           LPUART0_BASE)
#define LPUART1                     ((LPUART1_Type*)           LPUART1_BASE)
#define CMP0                        ((CMP0_Type*)              CMP0_BASE)
#define PMC                         ((PMC_Type*)               PMC_BASE)
#define SMC                         ((SMC_Type*)               SMC_BASE)
#define RCM                         ((RCM_Type*)               RCM_BASE)
#define PTA                         ((PTA_Type*)               PTA_BASE)
#define PTB                         ((PTB_Type*)               PTB_BASE)
#define PTC                         ((PTC_Type*)               PTC_BASE)
#define PTD                         ((PTD_Type*)               PTD_BASE)
#define PTE                         ((PTE_Type*)               PTE_BASE)
#define S32_SCB                     ((S32_SCB_Type*)           S32_SCB_BASE)
#define S32_SysTick                 ((S32_SysTick_Type*)       S32_SysTick_BASE)
#define S32_NVIC                    ((S32_NVIC_Type*)          S32_NVIC_BASE)
#define LMEM                        ((LMEM_Type*)              LMEM_BASE)
#define MTB_DWT                     ((MTB_DWT_Type*)           MTB_DWT_BASE)
#define MCM                         ((MCM_Type*)               MCM_BASE)

