nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  AIPS AIPS_OPACRF SP3 [18..18]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_SP3                                                           */
  AIPS_OPACRF_SP3_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRF_SP3_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRF_SP3_Enum;

/* =============================================  AIPS AIPS_OPACRF TP2 [20..20]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_TP2                                                           */
  AIPS_OPACRF_TP2_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRF_TP2_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRF_TP2_Enum;

/* =============================================  AIPS AIPS_OPACRF WP2 [21..21]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_WP2                                                           */
  AIPS_OPACRF_WP2_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRF_WP2_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRF_WP2_Enum;

/* =============================================  AIPS AIPS_OPACRF SP2 [22..22]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_SP2                                                           */
  AIPS_OPACRF_SP2_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRF_SP2_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRF_SP2_Enum;

/* =============================================  AIPS AIPS_OPACRF TP1 [24..24]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_TP1                                                           */
  AIPS_OPACRF_TP1_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRF_TP1_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRF_TP1_Enum;

/* =============================================  AIPS AIPS_OPACRF WP1 [25..25]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_WP1                                                           */
  AIPS_OPACRF_WP1_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRF_WP1_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRF_WP1_Enum;

/* =============================================  AIPS AIPS_OPACRF SP1 [26..26]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_SP1                                                           */
  AIPS_OPACRF_SP1_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRF_SP1_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRF_SP1_Enum;

/* =============================================  AIPS AIPS_OPACRF TP0 [28..28]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_TP0                                                           */
  AIPS_OPACRF_TP0_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRF_TP0_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRF_TP0_Enum;

/* =============================================  AIPS AIPS_OPACRF WP0 [29..29]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_WP0                                                           */
  AIPS_OPACRF_WP0_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRF_WP0_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRF_WP0_Enum;

/* =============================================  AIPS AIPS_OPACRF SP0 [30..30]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_SP0                                                           */
  AIPS_OPACRF_SP0_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRF_SP0_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRF_SP0_Enum;

/* ======================================================  AIPS_OPACRG  ====================================================== */
/* =============================================  AIPS AIPS_OPACRG TP2 [20..20]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRG_TP2                                                           */
  AIPS_OPACRG_TP2_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRG_TP2_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRG_TP2_Enum;

/* =============================================  AIPS AIPS_OPACRG WP2 [21..21]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRG_WP2                                                           */
  AIPS_OPACRG_WP2_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRG_WP2_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRG_WP2_Enum;

/* =============================================  AIPS AIPS_OPACRG SP2 [22..22]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRG_SP2                                                           */
  AIPS_OPACRG_SP2_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRG_SP2_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRG_SP2_Enum;

