nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  MSCM MSCM_OCMDR1 V [31..31]  ============================================== */
typedef enum {                                  /*!< MSCM_OCMDR1_V                                                             */
  MSCM_OCMDR1_V_0                      = 0,     /*!< 0 : OCMEMn is not present.                                                */
  MSCM_OCMDR1_V_1                      = 1,     /*!< 1 : OCMEMn is present.                                                    */
} MSCM_OCMDR1_V_Enum;

/* ======================================================  MSCM_OCMDR2  ====================================================== */
/* ============================================  MSCM MSCM_OCMDR2 OCMT [13..15]  ============================================= */
typedef enum {                                  /*!< MSCM_OCMDR2_OCMT                                                          */
  MSCM_OCMDR2_OCMT_100                 = 4,     /*!< 100 : OCMEMn is a Program Flash.                                          */
  MSCM_OCMDR2_OCMT_101                 = 5,     /*!< 101 : OCMEMn is a Data Flash.                                             */
  MSCM_OCMDR2_OCMT_110                 = 6,     /*!< 110 : OCMEMn is an EEE.                                                   */
} MSCM_OCMDR2_OCMT_Enum;

/* =============================================  MSCM MSCM_OCMDR2 RO [16..16]  ============================================== */
typedef enum {                                  /*!< MSCM_OCMDR2_RO                                                            */
  MSCM_OCMDR2_RO_0                     = 0,     /*!< 0 : Writes to the OCMDRn[11:0] are allowed                                */
  MSCM_OCMDR2_RO_1                     = 1,     /*!< 1 : Writes to the OCMDRn[11:0] are ignored                                */
} MSCM_OCMDR2_RO_Enum;

/* ============================================  MSCM MSCM_OCMDR2 OCMW [17..19]  ============================================= */
typedef enum {                                  /*!< MSCM_OCMDR2_OCMW                                                          */
  MSCM_OCMDR2_OCMW_010                 = 2,     /*!< 010 : OCMEMn 32-bits wide                                                 */
  MSCM_OCMDR2_OCMW_011                 = 3,     /*!< 011 : OCMEMn 64-bits wide                                                 */
  MSCM_OCMDR2_OCMW_100                 = 4,     /*!< 100 : OCMEMn 128-bits wide                                                */
  MSCM_OCMDR2_OCMW_101                 = 5,     /*!< 101 : OCMEMn 256-bits wide                                                */
} MSCM_OCMDR2_OCMW_Enum;

/* ============================================  MSCM MSCM_OCMDR2 OCMSZ [24..27]  ============================================ */
typedef enum {                                  /*!< MSCM_OCMDR2_OCMSZ                                                         */
  MSCM_OCMDR2_OCMSZ_0000               = 0,     /*!< 0000 : no OCMEMn                                                          */
  MSCM_OCMDR2_OCMSZ_0001               = 1,     /*!< 0001 : 1KB OCMEMn                                                         */
  MSCM_OCMDR2_OCMSZ_0010               = 2,     /*!< 0010 : 2KB OCMEMn                                                         */
  MSCM_OCMDR2_OCMSZ_0011               = 3,     /*!< 0011 : 4KB OCMEMn                                                         */
  MSCM_OCMDR2_OCMSZ_0100               = 4,     /*!< 0100 : 8KB OCMEMn                                                         */
  MSCM_OCMDR2_OCMSZ_0101               = 5,     /*!< 0101 : 16KB OCMEMn                                                        */
  MSCM_OCMDR2_OCMSZ_0110               = 6,     /*!< 0110 : 32KB OCMEMn                                                        */
  MSCM_OCMDR2_OCMSZ_0111               = 7,     /*!< 0111 : 64KB OCMEMn                                                        */
  MSCM_OCMDR2_OCMSZ_1000               = 8,     /*!< 1000 : 128KB OCMEMn                                                       */
  MSCM_OCMDR2_OCMSZ_1001               = 9,     /*!< 1001 : 256KB OCMEMn                                                       */
  MSCM_OCMDR2_OCMSZ_1010               = 10,    /*!< 1010 : 512KB OCMEMn                                                       */
  MSCM_OCMDR2_OCMSZ_1011               = 11,    /*!< 1011 : 1MB OCMEMn                                                         */
  MSCM_OCMDR2_OCMSZ_1100               = 12,    /*!< 1100 : 2MB OCMEMn                                                         */
  MSCM_OCMDR2_OCMSZ_1101               = 13,    /*!< 1101 : 4MB OCMEMn                                                         */
  MSCM_OCMDR2_OCMSZ_1110               = 14,    /*!< 1110 : 8MB OCMEMn                                                         */
  MSCM_OCMDR2_OCMSZ_1111               = 15,    /*!< 1111 : 16MB OCMEMn                                                        */
} MSCM_OCMDR2_OCMSZ_Enum;

/* ===========================================  MSCM MSCM_OCMDR2 OCMSZH [28..28]  ============================================ */
typedef enum {                                  /*!< MSCM_OCMDR2_OCMSZH                                                        */
  MSCM_OCMDR2_OCMSZH_0                 = 0,     /*!< 0 : OCMEMn is a power-of-2 capacity.                                      */
  MSCM_OCMDR2_OCMSZH_1                 = 1,     /*!< 1 : OCMEMn is not a power-of-2, with a capacity is 0.75 * OCMSZ.          */
} MSCM_OCMDR2_OCMSZH_Enum;

/* ==============================================  MSCM MSCM_OCMDR2 V [31..31]  ============================================== */
typedef enum {                                  /*!< MSCM_OCMDR2_V                                                             */
  MSCM_OCMDR2_V_0                      = 0,     /*!< 0 : OCMEMn is not present.                                                */
  MSCM_OCMDR2_V_1                      = 1,     /*!< 1 : OCMEMn is present.                                                    */
} MSCM_OCMDR2_V_Enum;



/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  DMA_CR  ========================================================= */
/* =================================================  DMA DMA_CR HOE [4..4]  ================================================= */
typedef enum {                                  /*!< DMA_CR_HOE                                                                */
  DMA_CR_HOE_0                         = 0,     /*!< 0 : Normal operation                                                      */
  DMA_CR_HOE_1                         = 1,     /*!< 1 : Any error causes the HALT bit to set. Subsequently, all
                                                     service requests are ignored until the HALT bit is cleared.               */
} DMA_CR_HOE_Enum;

/* ================================================  DMA DMA_CR HALT [5..5]  ================================================= */
typedef enum {                                  /*!< DMA_CR_HALT                                                               */
  DMA_CR_HALT_0                        = 0,     /*!< 0 : Normal operation                                                      */
  DMA_CR_HALT_1                        = 1,     /*!< 1 : Stall the start of any new channels. Executing channels
                                                     are allowed to complete. Channel execution resumes when
                                                     this bit is cleared.                                                      */
} DMA_CR_HALT_Enum;

/* =================================================  DMA DMA_CR CLM [6..6]  ================================================= */
typedef enum {                                  /*!< DMA_CR_CLM                                                                */
  DMA_CR_CLM_0                         = 0,     /*!< 0 : A minor loop channel link made to itself goes through channel
                                                     arbitration before being activated again.                                 */
  DMA_CR_CLM_1                         = 1,     /*!< 1 : A minor loop channel link made to itself does not go through
                                                     channel arbitration before being activated again. Upon
                                                     minor loop completion, the channel activates again if that
                                                     channel has a minor loop channel link enabled and the link
                                                     channel is itself. This effectively applies the minor loop
                                                     offsets and restarts the next minor loop.                                 */
} DMA_CR_CLM_Enum;

/* ================================================  DMA DMA_CR EMLM [7..7]  ================================================= */
typedef enum {                                  /*!< DMA_CR_EMLM                                                               */
  DMA_CR_EMLM_0                        = 0,     /*!< 0 : Disabled. TCDn.word2 is defined as a 32-bit NBYTES field.             */
  DMA_CR_EMLM_1                        = 1,     /*!< 1 : Enabled. TCDn.word2 is redefined to include individual enable
                                                     fields, an offset field, and the NBYTES field. The individual
                                                     enable fields allow the minor loop offset to be applied
                                                     to the source address, the destination address, or both.
                                                     The NBYTES field is reduced when either offset is enabled.                */
} DMA_CR_EMLM_Enum;

/* ================================================  DMA DMA_CR ECX [16..16]  ================================================ */
typedef enum {                                  /*!< DMA_CR_ECX                                                                */
  DMA_CR_ECX_0                         = 0,     /*!< 0 : Normal operation                                                      */
  DMA_CR_ECX_1                         = 1,     /*!< 1 : Cancel the remaining data transfer in the same fashion as
                                                     the CX bit. Stop the executing channel and force the minor
                                                     loop to finish. The cancel takes effect after the last
                                                     write of the current read/write sequence. The ECX bit clears
                                                     itself after the cancel is honored. In addition to cancelling
                                                     the transfer, ECX treats the cancel as an error condition,
                                                     thus updating the Error Status register (DMAx_ES) and generating
                                                     an optional error interrupt.                                              */
} DMA_CR_ECX_Enum;

/* ================================================  DMA DMA_CR CX [17..17]  ================================================= */
typedef enum {                                  /*!< DMA_CR_CX                                                                 */
  DMA_CR_CX_0                          = 0,     /*!< 0 : Normal operation                                                      */
  DMA_CR_CX_1                          = 1,     /*!< 1 : Cancel the remaining data transfer. Stop the executing channel
                                                     and force the minor loop to finish. The cancel takes effect
                                                     after the last write of the current read/write sequence.
                                                     The CX bit clears itself after the cancel has been honored.
                                                     This cancel retires the channel normally as if the minor
                                                     loop was completed.                                                       */
} DMA_CR_CX_Enum;

/* ==============================================  DMA DMA_CR ACTIVE [31..31]  =============================================== */
typedef enum {                                  /*!< DMA_CR_ACTIVE                                                             */
  DMA_CR_ACTIVE_0                      = 0,     /*!< 0 : eDMA is idle.                                                         */
  DMA_CR_ACTIVE_1                      = 1,     /*!< 1 : eDMA is executing a channel.                                          */
} DMA_CR_ACTIVE_Enum;

/* ========================================================  DMA_ES  ========================================================= */
/* =================================================  DMA DMA_ES DBE [0..0]  ================================================= */
typedef enum {                                  /*!< DMA_ES_DBE                                                                */
  DMA_ES_DBE_0                         = 0,     /*!< 0 : No destination bus error                                              */
  DMA_ES_DBE_1                         = 1,     /*!< 1 : The last recorded error was a bus error on a destination
                                                     write                                                                     */
} DMA_ES_DBE_Enum;

/* =================================================  DMA DMA_ES SBE [1..1]  ================================================= */
typedef enum {                                  /*!< DMA_ES_SBE                                                                */
  DMA_ES_SBE_0                         = 0,     /*!< 0 : No source bus error                                                   */
  DMA_ES_SBE_1                         = 1,     /*!< 1 : The last recorded error was a bus error on a source read              */
} DMA_ES_SBE_Enum;

/* =================================================  DMA DMA_ES SGE [2..2]  ================================================= */
typedef enum {                                  /*!< DMA_ES_SGE                                                                */
  DMA_ES_SGE_0                         = 0,     /*!< 0 : No scatter/gather configuration error                                 */
  DMA_ES_SGE_1                         = 1,     /*!< 1 : The last recorded error was a configuration error detected
                                                     in the TCDn_DLASTSGA field. This field is checked at the
                                                     beginning of a scatter/gather operation after major loop
                                                     completion if TCDn_CSR[ESG] is enabled. TCDn_DLASTSGA is
                                                     not on a 32 byte boundary.                                                */
} DMA_ES_SGE_Enum;

