nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =================================================  DMA DMA_ES NCE [3..3]  ================================================= */
typedef enum {                                  /*!< DMA_ES_NCE                                                                */
  DMA_ES_NCE_0                         = 0,     /*!< 0 : No NBYTES/CITER configuration error                                   */
} DMA_ES_NCE_Enum;

/* =================================================  DMA DMA_ES DOE [4..4]  ================================================= */
typedef enum {                                  /*!< DMA_ES_DOE                                                                */
  DMA_ES_DOE_0                         = 0,     /*!< 0 : No destination offset configuration error                             */
  DMA_ES_DOE_1                         = 1,     /*!< 1 : The last recorded error was a configuration error detected
                                                     in the TCDn_DOFF field. TCDn_DOFF is inconsistent with
                                                     TCDn_ATTR[DSIZE].                                                         */
} DMA_ES_DOE_Enum;

/* =================================================  DMA DMA_ES DAE [5..5]  ================================================= */
typedef enum {                                  /*!< DMA_ES_DAE                                                                */
  DMA_ES_DAE_0                         = 0,     /*!< 0 : No destination address configuration error                            */
  DMA_ES_DAE_1                         = 1,     /*!< 1 : The last recorded error was a configuration error detected
                                                     in the TCDn_DADDR field. TCDn_DADDR is inconsistent with
                                                     TCDn_ATTR[DSIZE].                                                         */
} DMA_ES_DAE_Enum;

/* =================================================  DMA DMA_ES SOE [6..6]  ================================================= */
typedef enum {                                  /*!< DMA_ES_SOE                                                                */
  DMA_ES_SOE_0                         = 0,     /*!< 0 : No source offset configuration error                                  */
  DMA_ES_SOE_1                         = 1,     /*!< 1 : The last recorded error was a configuration error detected
                                                     in the TCDn_SOFF field. TCDn_SOFF is inconsistent with
                                                     TCDn_ATTR[SSIZE].                                                         */
} DMA_ES_SOE_Enum;

/* =================================================  DMA DMA_ES SAE [7..7]  ================================================= */
typedef enum {                                  /*!< DMA_ES_SAE                                                                */
  DMA_ES_SAE_0                         = 0,     /*!< 0 : No source address configuration error.                                */
  DMA_ES_SAE_1                         = 1,     /*!< 1 : The last recorded error was a configuration error detected
                                                     in the TCDn_SADDR field. TCDn_SADDR is inconsistent with
                                                     TCDn_ATTR[SSIZE].                                                         */
} DMA_ES_SAE_Enum;

/* ================================================  DMA DMA_ES CPE [14..14]  ================================================ */
typedef enum {                                  /*!< DMA_ES_CPE                                                                */
  DMA_ES_CPE_0                         = 0,     /*!< 0 : No channel priority error                                             */
} DMA_ES_CPE_Enum;

/* ================================================  DMA DMA_ES ECX [16..16]  ================================================ */
typedef enum {                                  /*!< DMA_ES_ECX                                                                */
  DMA_ES_ECX_0                         = 0,     /*!< 0 : No canceled transfers                                                 */
  DMA_ES_ECX_1                         = 1,     /*!< 1 : The last recorded entry was a canceled transfer by the error
                                                     cancel transfer input                                                     */
} DMA_ES_ECX_Enum;

/* ================================================  DMA DMA_ES VLD [31..31]  ================================================ */
typedef enum {                                  /*!< DMA_ES_VLD                                                                */
  DMA_ES_VLD_0                         = 0,     /*!< 0 : No ERR bits are set.                                                  */
  DMA_ES_VLD_1                         = 1,     /*!< 1 : At least one ERR bit is set indicating a valid error exists
                                                     that has not been cleared.                                                */
} DMA_ES_VLD_Enum;

/* ========================================================  DMA_ERQ  ======================================================== */
/* ================================================  DMA DMA_ERQ ERQ0 [0..0]  ================================================ */
typedef enum {                                  /*!< DMA_ERQ_ERQ0                                                              */
  DMA_ERQ_ERQ0_0                       = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ0_1                       = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ0_Enum;

/* ================================================  DMA DMA_ERQ ERQ1 [1..1]  ================================================ */
typedef enum {                                  /*!< DMA_ERQ_ERQ1                                                              */
  DMA_ERQ_ERQ1_0                       = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ1_1                       = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ1_Enum;

/* ================================================  DMA DMA_ERQ ERQ2 [2..2]  ================================================ */
typedef enum {                                  /*!< DMA_ERQ_ERQ2                                                              */
  DMA_ERQ_ERQ2_0                       = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ2_1                       = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ2_Enum;

/* ================================================  DMA DMA_ERQ ERQ3 [3..3]  ================================================ */
typedef enum {                                  /*!< DMA_ERQ_ERQ3                                                              */
  DMA_ERQ_ERQ3_0                       = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ3_1                       = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ3_Enum;

/* ================================================  DMA DMA_ERQ ERQ4 [4..4]  ================================================ */
typedef enum {                                  /*!< DMA_ERQ_ERQ4                                                              */
  DMA_ERQ_ERQ4_0                       = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ4_1                       = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ4_Enum;

/* ================================================  DMA DMA_ERQ ERQ5 [5..5]  ================================================ */
typedef enum {                                  /*!< DMA_ERQ_ERQ5                                                              */
  DMA_ERQ_ERQ5_0                       = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ5_1                       = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ5_Enum;

/* ================================================  DMA DMA_ERQ ERQ6 [6..6]  ================================================ */
typedef enum {                                  /*!< DMA_ERQ_ERQ6                                                              */
  DMA_ERQ_ERQ6_0                       = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ6_1                       = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ6_Enum;

/* ================================================  DMA DMA_ERQ ERQ7 [7..7]  ================================================ */
typedef enum {                                  /*!< DMA_ERQ_ERQ7                                                              */
  DMA_ERQ_ERQ7_0                       = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ7_1                       = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ7_Enum;

/* ================================================  DMA DMA_ERQ ERQ8 [8..8]  ================================================ */
typedef enum {                                  /*!< DMA_ERQ_ERQ8                                                              */
  DMA_ERQ_ERQ8_0                       = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ8_1                       = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ8_Enum;

/* ================================================  DMA DMA_ERQ ERQ9 [9..9]  ================================================ */
typedef enum {                                  /*!< DMA_ERQ_ERQ9                                                              */
  DMA_ERQ_ERQ9_0                       = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ9_1                       = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ9_Enum;

/* ==============================================  DMA DMA_ERQ ERQ10 [10..10]  =============================================== */
typedef enum {                                  /*!< DMA_ERQ_ERQ10                                                             */
  DMA_ERQ_ERQ10_0                      = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ10_1                      = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ10_Enum;

