nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  DMA DMA_ERQ ERQ11 [11..11]  =============================================== */
typedef enum {                                  /*!< DMA_ERQ_ERQ11                                                             */
  DMA_ERQ_ERQ11_0                      = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ11_1                      = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ11_Enum;

/* ==============================================  DMA DMA_ERQ ERQ12 [12..12]  =============================================== */
typedef enum {                                  /*!< DMA_ERQ_ERQ12                                                             */
  DMA_ERQ_ERQ12_0                      = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ12_1                      = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ12_Enum;

/* ==============================================  DMA DMA_ERQ ERQ13 [13..13]  =============================================== */
typedef enum {                                  /*!< DMA_ERQ_ERQ13                                                             */
  DMA_ERQ_ERQ13_0                      = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ13_1                      = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ13_Enum;

/* ==============================================  DMA DMA_ERQ ERQ14 [14..14]  =============================================== */
typedef enum {                                  /*!< DMA_ERQ_ERQ14                                                             */
  DMA_ERQ_ERQ14_0                      = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ14_1                      = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ14_Enum;

/* ==============================================  DMA DMA_ERQ ERQ15 [15..15]  =============================================== */
typedef enum {                                  /*!< DMA_ERQ_ERQ15                                                             */
  DMA_ERQ_ERQ15_0                      = 0,     /*!< 0 : The DMA request signal for the corresponding channel is
                                                     disabled                                                                  */
  DMA_ERQ_ERQ15_1                      = 1,     /*!< 1 : The DMA request signal for the corresponding channel is
                                                     enabled                                                                   */
} DMA_ERQ_ERQ15_Enum;

/* ========================================================  DMA_EEI  ======================================================== */
/* ================================================  DMA DMA_EEI EEI0 [0..0]  ================================================ */
typedef enum {                                  /*!< DMA_EEI_EEI0                                                              */
  DMA_EEI_EEI0_0                       = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI0_1                       = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI0_Enum;

/* ================================================  DMA DMA_EEI EEI1 [1..1]  ================================================ */
typedef enum {                                  /*!< DMA_EEI_EEI1                                                              */
  DMA_EEI_EEI1_0                       = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI1_1                       = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI1_Enum;

/* ================================================  DMA DMA_EEI EEI2 [2..2]  ================================================ */
typedef enum {                                  /*!< DMA_EEI_EEI2                                                              */
  DMA_EEI_EEI2_0                       = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI2_1                       = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI2_Enum;

/* ================================================  DMA DMA_EEI EEI3 [3..3]  ================================================ */
typedef enum {                                  /*!< DMA_EEI_EEI3                                                              */
  DMA_EEI_EEI3_0                       = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI3_1                       = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI3_Enum;

/* ================================================  DMA DMA_EEI EEI4 [4..4]  ================================================ */
typedef enum {                                  /*!< DMA_EEI_EEI4                                                              */
  DMA_EEI_EEI4_0                       = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI4_1                       = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI4_Enum;

/* ================================================  DMA DMA_EEI EEI5 [5..5]  ================================================ */
typedef enum {                                  /*!< DMA_EEI_EEI5                                                              */
  DMA_EEI_EEI5_0                       = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI5_1                       = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI5_Enum;

/* ================================================  DMA DMA_EEI EEI6 [6..6]  ================================================ */
typedef enum {                                  /*!< DMA_EEI_EEI6                                                              */
  DMA_EEI_EEI6_0                       = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI6_1                       = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI6_Enum;

/* ================================================  DMA DMA_EEI EEI7 [7..7]  ================================================ */
typedef enum {                                  /*!< DMA_EEI_EEI7                                                              */
  DMA_EEI_EEI7_0                       = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI7_1                       = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI7_Enum;

/* ================================================  DMA DMA_EEI EEI8 [8..8]  ================================================ */
typedef enum {                                  /*!< DMA_EEI_EEI8                                                              */
  DMA_EEI_EEI8_0                       = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI8_1                       = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI8_Enum;

/* ================================================  DMA DMA_EEI EEI9 [9..9]  ================================================ */
typedef enum {                                  /*!< DMA_EEI_EEI9                                                              */
  DMA_EEI_EEI9_0                       = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI9_1                       = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI9_Enum;

/* ==============================================  DMA DMA_EEI EEI10 [10..10]  =============================================== */
typedef enum {                                  /*!< DMA_EEI_EEI10                                                             */
  DMA_EEI_EEI10_0                      = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI10_1                      = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI10_Enum;

