nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ================================================  DMA DMA_CDNE NOP [7..7]  ================================================ */
typedef enum {                                  /*!< DMA_CDNE_NOP                                                              */
  DMA_CDNE_NOP_0                       = 0,     /*!< 0 : Normal operation                                                      */
  DMA_CDNE_NOP_1                       = 1,     /*!< 1 : No operation, ignore the other bits in this register                  */
} DMA_CDNE_NOP_Enum;

/* =======================================================  DMA_SSRT  ======================================================== */
/* ===============================================  DMA DMA_SSRT SAST [6..6]  ================================================ */
typedef enum {                                  /*!< DMA_SSRT_SAST                                                             */
  DMA_SSRT_SAST_0                      = 0,     /*!< 0 : Set only the TCDn_CSR[START] bit specified in the SSRT field          */
  DMA_SSRT_SAST_1                      = 1,     /*!< 1 : Set all bits in TCDn_CSR[START]                                       */
} DMA_SSRT_SAST_Enum;

/* ================================================  DMA DMA_SSRT NOP [7..7]  ================================================ */
typedef enum {                                  /*!< DMA_SSRT_NOP                                                              */
  DMA_SSRT_NOP_0                       = 0,     /*!< 0 : Normal operation                                                      */
  DMA_SSRT_NOP_1                       = 1,     /*!< 1 : No operation, ignore the other bits in this register                  */
} DMA_SSRT_NOP_Enum;

/* =======================================================  DMA_CERR  ======================================================== */
/* ================================================  DMA DMA_CERR NOP [7..7]  ================================================ */
typedef enum {                                  /*!< DMA_CERR_NOP                                                              */
  DMA_CERR_NOP_0                       = 0,     /*!< 0 : Normal operation                                                      */
  DMA_CERR_NOP_1                       = 1,     /*!< 1 : No operation, ignore the other bits in this register                  */
} DMA_CERR_NOP_Enum;

/* =======================================================  DMA_CINT  ======================================================== */
/* ================================================  DMA DMA_CINT NOP [7..7]  ================================================ */
typedef enum {                                  /*!< DMA_CINT_NOP                                                              */
  DMA_CINT_NOP_0                       = 0,     /*!< 0 : Normal operation                                                      */
  DMA_CINT_NOP_1                       = 1,     /*!< 1 : No operation, ignore the other bits in this register                  */
} DMA_CINT_NOP_Enum;

/* ========================================================  DMA_INT  ======================================================== */
/* ================================================  DMA DMA_INT INT0 [0..0]  ================================================ */
typedef enum {                                  /*!< DMA_INT_INT0                                                              */
  DMA_INT_INT0_0                       = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT0_1                       = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT0_Enum;

/* ================================================  DMA DMA_INT INT1 [1..1]  ================================================ */
typedef enum {                                  /*!< DMA_INT_INT1                                                              */
  DMA_INT_INT1_0                       = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT1_1                       = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT1_Enum;

/* ================================================  DMA DMA_INT INT2 [2..2]  ================================================ */
typedef enum {                                  /*!< DMA_INT_INT2                                                              */
  DMA_INT_INT2_0                       = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT2_1                       = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT2_Enum;

/* ================================================  DMA DMA_INT INT3 [3..3]  ================================================ */
typedef enum {                                  /*!< DMA_INT_INT3                                                              */
  DMA_INT_INT3_0                       = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT3_1                       = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT3_Enum;

/* ================================================  DMA DMA_INT INT4 [4..4]  ================================================ */
typedef enum {                                  /*!< DMA_INT_INT4                                                              */
  DMA_INT_INT4_0                       = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT4_1                       = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT4_Enum;

/* ================================================  DMA DMA_INT INT5 [5..5]  ================================================ */
typedef enum {                                  /*!< DMA_INT_INT5                                                              */
  DMA_INT_INT5_0                       = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT5_1                       = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT5_Enum;

