nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ================================================  DMA DMA_INT INT6 [6..6]  ================================================ */
typedef enum {                                  /*!< DMA_INT_INT6                                                              */
  DMA_INT_INT6_0                       = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT6_1                       = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT6_Enum;

/* ================================================  DMA DMA_INT INT7 [7..7]  ================================================ */
typedef enum {                                  /*!< DMA_INT_INT7                                                              */
  DMA_INT_INT7_0                       = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT7_1                       = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT7_Enum;

/* ================================================  DMA DMA_INT INT8 [8..8]  ================================================ */
typedef enum {                                  /*!< DMA_INT_INT8                                                              */
  DMA_INT_INT8_0                       = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT8_1                       = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT8_Enum;

/* ================================================  DMA DMA_INT INT9 [9..9]  ================================================ */
typedef enum {                                  /*!< DMA_INT_INT9                                                              */
  DMA_INT_INT9_0                       = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT9_1                       = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT9_Enum;

/* ==============================================  DMA DMA_INT INT10 [10..10]  =============================================== */
typedef enum {                                  /*!< DMA_INT_INT10                                                             */
  DMA_INT_INT10_0                      = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT10_1                      = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT10_Enum;

/* ==============================================  DMA DMA_INT INT11 [11..11]  =============================================== */
typedef enum {                                  /*!< DMA_INT_INT11                                                             */
  DMA_INT_INT11_0                      = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT11_1                      = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT11_Enum;

/* ==============================================  DMA DMA_INT INT12 [12..12]  =============================================== */
typedef enum {                                  /*!< DMA_INT_INT12                                                             */
  DMA_INT_INT12_0                      = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT12_1                      = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT12_Enum;

/* ==============================================  DMA DMA_INT INT13 [13..13]  =============================================== */
typedef enum {                                  /*!< DMA_INT_INT13                                                             */
  DMA_INT_INT13_0                      = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT13_1                      = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT13_Enum;

/* ==============================================  DMA DMA_INT INT14 [14..14]  =============================================== */
typedef enum {                                  /*!< DMA_INT_INT14                                                             */
  DMA_INT_INT14_0                      = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT14_1                      = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT14_Enum;

/* ==============================================  DMA DMA_INT INT15 [15..15]  =============================================== */
typedef enum {                                  /*!< DMA_INT_INT15                                                             */
  DMA_INT_INT15_0                      = 0,     /*!< 0 : The interrupt request for corresponding channel is cleared            */
  DMA_INT_INT15_1                      = 1,     /*!< 1 : The interrupt request for corresponding channel is active             */
} DMA_INT_INT15_Enum;

/* ========================================================  DMA_ERR  ======================================================== */
/* ================================================  DMA DMA_ERR ERR0 [0..0]  ================================================ */
typedef enum {                                  /*!< DMA_ERR_ERR0                                                              */
  DMA_ERR_ERR0_0                       = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR0_1                       = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR0_Enum;

/* ================================================  DMA DMA_ERR ERR1 [1..1]  ================================================ */
typedef enum {                                  /*!< DMA_ERR_ERR1                                                              */
  DMA_ERR_ERR1_0                       = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR1_1                       = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR1_Enum;

/* ================================================  DMA DMA_ERR ERR2 [2..2]  ================================================ */
typedef enum {                                  /*!< DMA_ERR_ERR2                                                              */
  DMA_ERR_ERR2_0                       = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR2_1                       = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR2_Enum;

/* ================================================  DMA DMA_ERR ERR3 [3..3]  ================================================ */
typedef enum {                                  /*!< DMA_ERR_ERR3                                                              */
  DMA_ERR_ERR3_0                       = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR3_1                       = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR3_Enum;

/* ================================================  DMA DMA_ERR ERR4 [4..4]  ================================================ */
typedef enum {                                  /*!< DMA_ERR_ERR4                                                              */
  DMA_ERR_ERR4_0                       = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR4_1                       = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR4_Enum;

/* ================================================  DMA DMA_ERR ERR5 [5..5]  ================================================ */
typedef enum {                                  /*!< DMA_ERR_ERR5                                                              */
  DMA_ERR_ERR5_0                       = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR5_1                       = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR5_Enum;

/* ================================================  DMA DMA_ERR ERR6 [6..6]  ================================================ */
typedef enum {                                  /*!< DMA_ERR_ERR6                                                              */
  DMA_ERR_ERR6_0                       = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR6_1                       = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR6_Enum;

/* ================================================  DMA DMA_ERR ERR7 [7..7]  ================================================ */
typedef enum {                                  /*!< DMA_ERR_ERR7                                                              */
  DMA_ERR_ERR7_0                       = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR7_1                       = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR7_Enum;

/* ================================================  DMA DMA_ERR ERR8 [8..8]  ================================================ */
typedef enum {                                  /*!< DMA_ERR_ERR8                                                              */
  DMA_ERR_ERR8_0                       = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR8_1                       = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR8_Enum;

/* ================================================  DMA DMA_ERR ERR9 [9..9]  ================================================ */
typedef enum {                                  /*!< DMA_ERR_ERR9                                                              */
  DMA_ERR_ERR9_0                       = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR9_1                       = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR9_Enum;

/* ==============================================  DMA DMA_ERR ERR10 [10..10]  =============================================== */
typedef enum {                                  /*!< DMA_ERR_ERR10                                                             */
  DMA_ERR_ERR10_0                      = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR10_1                      = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR10_Enum;

