nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  DMA DMA_ERR ERR11 [11..11]  =============================================== */
typedef enum {                                  /*!< DMA_ERR_ERR11                                                             */
  DMA_ERR_ERR11_0                      = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR11_1                      = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR11_Enum;

/* ==============================================  DMA DMA_ERR ERR12 [12..12]  =============================================== */
typedef enum {                                  /*!< DMA_ERR_ERR12                                                             */
  DMA_ERR_ERR12_0                      = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR12_1                      = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR12_Enum;

/* ==============================================  DMA DMA_ERR ERR13 [13..13]  =============================================== */
typedef enum {                                  /*!< DMA_ERR_ERR13                                                             */
  DMA_ERR_ERR13_0                      = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR13_1                      = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR13_Enum;

/* ==============================================  DMA DMA_ERR ERR14 [14..14]  =============================================== */
typedef enum {                                  /*!< DMA_ERR_ERR14                                                             */
  DMA_ERR_ERR14_0                      = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR14_1                      = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR14_Enum;

/* ==============================================  DMA DMA_ERR ERR15 [15..15]  =============================================== */
typedef enum {                                  /*!< DMA_ERR_ERR15                                                             */
  DMA_ERR_ERR15_0                      = 0,     /*!< 0 : An error in this channel has not occurred                             */
  DMA_ERR_ERR15_1                      = 1,     /*!< 1 : An error in this channel has occurred                                 */
} DMA_ERR_ERR15_Enum;

/* ========================================================  DMA_HRS  ======================================================== */
/* ================================================  DMA DMA_HRS HRS0 [0..0]  ================================================ */
typedef enum {                                  /*!< DMA_HRS_HRS0                                                              */
  DMA_HRS_HRS0_0                       = 0,     /*!< 0 : A hardware service request for channel 0 is not present               */
  DMA_HRS_HRS0_1                       = 1,     /*!< 1 : A hardware service request for channel 0 is present                   */
} DMA_HRS_HRS0_Enum;

/* ================================================  DMA DMA_HRS HRS1 [1..1]  ================================================ */
typedef enum {                                  /*!< DMA_HRS_HRS1                                                              */
  DMA_HRS_HRS1_0                       = 0,     /*!< 0 : A hardware service request for channel 1 is not present               */
  DMA_HRS_HRS1_1                       = 1,     /*!< 1 : A hardware service request for channel 1 is present                   */
} DMA_HRS_HRS1_Enum;

/* ================================================  DMA DMA_HRS HRS2 [2..2]  ================================================ */
typedef enum {                                  /*!< DMA_HRS_HRS2                                                              */
  DMA_HRS_HRS2_0                       = 0,     /*!< 0 : A hardware service request for channel 2 is not present               */
  DMA_HRS_HRS2_1                       = 1,     /*!< 1 : A hardware service request for channel 2 is present                   */
} DMA_HRS_HRS2_Enum;

/* ================================================  DMA DMA_HRS HRS3 [3..3]  ================================================ */
typedef enum {                                  /*!< DMA_HRS_HRS3                                                              */
  DMA_HRS_HRS3_0                       = 0,     /*!< 0 : A hardware service request for channel 3 is not present               */
  DMA_HRS_HRS3_1                       = 1,     /*!< 1 : A hardware service request for channel 3 is present                   */
} DMA_HRS_HRS3_Enum;

/* ================================================  DMA DMA_HRS HRS4 [4..4]  ================================================ */
typedef enum {                                  /*!< DMA_HRS_HRS4                                                              */
  DMA_HRS_HRS4_0                       = 0,     /*!< 0 : A hardware service request for channel 4 is not present               */
  DMA_HRS_HRS4_1                       = 1,     /*!< 1 : A hardware service request for channel 4 is present                   */
} DMA_HRS_HRS4_Enum;

/* ================================================  DMA DMA_HRS HRS5 [5..5]  ================================================ */
typedef enum {                                  /*!< DMA_HRS_HRS5                                                              */
  DMA_HRS_HRS5_0                       = 0,     /*!< 0 : A hardware service request for channel 5 is not present               */
  DMA_HRS_HRS5_1                       = 1,     /*!< 1 : A hardware service request for channel 5 is present                   */
} DMA_HRS_HRS5_Enum;

