nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ================================================  DMA DMA_HRS HRS6 [6..6]  ================================================ */
typedef enum {                                  /*!< DMA_HRS_HRS6                                                              */
  DMA_HRS_HRS6_0                       = 0,     /*!< 0 : A hardware service request for channel 6 is not present               */
  DMA_HRS_HRS6_1                       = 1,     /*!< 1 : A hardware service request for channel 6 is present                   */
} DMA_HRS_HRS6_Enum;

/* ================================================  DMA DMA_HRS HRS7 [7..7]  ================================================ */
typedef enum {                                  /*!< DMA_HRS_HRS7                                                              */
  DMA_HRS_HRS7_0                       = 0,     /*!< 0 : A hardware service request for channel 7 is not present               */
  DMA_HRS_HRS7_1                       = 1,     /*!< 1 : A hardware service request for channel 7 is present                   */
} DMA_HRS_HRS7_Enum;

/* ================================================  DMA DMA_HRS HRS8 [8..8]  ================================================ */
typedef enum {                                  /*!< DMA_HRS_HRS8                                                              */
  DMA_HRS_HRS8_0                       = 0,     /*!< 0 : A hardware service request for channel 8 is not present               */
  DMA_HRS_HRS8_1                       = 1,     /*!< 1 : A hardware service request for channel 8 is present                   */
} DMA_HRS_HRS8_Enum;

/* ================================================  DMA DMA_HRS HRS9 [9..9]  ================================================ */
typedef enum {                                  /*!< DMA_HRS_HRS9                                                              */
  DMA_HRS_HRS9_0                       = 0,     /*!< 0 : A hardware service request for channel 9 is not present               */
  DMA_HRS_HRS9_1                       = 1,     /*!< 1 : A hardware service request for channel 9 is present                   */
} DMA_HRS_HRS9_Enum;

/* ==============================================  DMA DMA_HRS HRS10 [10..10]  =============================================== */
typedef enum {                                  /*!< DMA_HRS_HRS10                                                             */
  DMA_HRS_HRS10_0                      = 0,     /*!< 0 : A hardware service request for channel 10 is not present              */
  DMA_HRS_HRS10_1                      = 1,     /*!< 1 : A hardware service request for channel 10 is present                  */
} DMA_HRS_HRS10_Enum;

/* ==============================================  DMA DMA_HRS HRS11 [11..11]  =============================================== */
typedef enum {                                  /*!< DMA_HRS_HRS11                                                             */
  DMA_HRS_HRS11_0                      = 0,     /*!< 0 : A hardware service request for channel 11 is not present              */
  DMA_HRS_HRS11_1                      = 1,     /*!< 1 : A hardware service request for channel 11 is present                  */
} DMA_HRS_HRS11_Enum;

/* ==============================================  DMA DMA_HRS HRS12 [12..12]  =============================================== */
typedef enum {                                  /*!< DMA_HRS_HRS12                                                             */
  DMA_HRS_HRS12_0                      = 0,     /*!< 0 : A hardware service request for channel 12 is not present              */
  DMA_HRS_HRS12_1                      = 1,     /*!< 1 : A hardware service request for channel 12 is present                  */
} DMA_HRS_HRS12_Enum;

/* ==============================================  DMA DMA_HRS HRS13 [13..13]  =============================================== */
typedef enum {                                  /*!< DMA_HRS_HRS13                                                             */
  DMA_HRS_HRS13_0                      = 0,     /*!< 0 : A hardware service request for channel 13 is not present              */
  DMA_HRS_HRS13_1                      = 1,     /*!< 1 : A hardware service request for channel 13 is present                  */
} DMA_HRS_HRS13_Enum;

/* ==============================================  DMA DMA_HRS HRS14 [14..14]  =============================================== */
typedef enum {                                  /*!< DMA_HRS_HRS14                                                             */
  DMA_HRS_HRS14_0                      = 0,     /*!< 0 : A hardware service request for channel 14 is not present              */
  DMA_HRS_HRS14_1                      = 1,     /*!< 1 : A hardware service request for channel 14 is present                  */
} DMA_HRS_HRS14_Enum;

/* ==============================================  DMA DMA_HRS HRS15 [15..15]  =============================================== */
typedef enum {                                  /*!< DMA_HRS_HRS15                                                             */
  DMA_HRS_HRS15_0                      = 0,     /*!< 0 : A hardware service request for channel 15 is not present              */
  DMA_HRS_HRS15_1                      = 1,     /*!< 1 : A hardware service request for channel 15 is present                  */
} DMA_HRS_HRS15_Enum;

/* =======================================================  DMA_EARS  ======================================================== */
/* ==============================================  DMA DMA_EARS EDREQ_0 [0..0]  ============================================== */
typedef enum {                                  /*!< DMA_EARS_EDREQ_0                                                          */
  DMA_EARS_EDREQ_0_0                   = 0,     /*!< 0 : Disable asynchronous DMA request for channel 0.                       */
  DMA_EARS_EDREQ_0_1                   = 1,     /*!< 1 : Enable asynchronous DMA request for channel 0.                        */
} DMA_EARS_EDREQ_0_Enum;

/* ==============================================  DMA DMA_EARS EDREQ_1 [1..1]  ============================================== */
typedef enum {                                  /*!< DMA_EARS_EDREQ_1                                                          */
  DMA_EARS_EDREQ_1_0                   = 0,     /*!< 0 : Disable asynchronous DMA request for channel 1                        */
  DMA_EARS_EDREQ_1_1                   = 1,     /*!< 1 : Enable asynchronous DMA request for channel 1.                        */
} DMA_EARS_EDREQ_1_Enum;

/* ==============================================  DMA DMA_EARS EDREQ_2 [2..2]  ============================================== */
typedef enum {                                  /*!< DMA_EARS_EDREQ_2                                                          */
  DMA_EARS_EDREQ_2_0                   = 0,     /*!< 0 : Disable asynchronous DMA request for channel 2.                       */
  DMA_EARS_EDREQ_2_1                   = 1,     /*!< 1 : Enable asynchronous DMA request for channel 2.                        */
} DMA_EARS_EDREQ_2_Enum;

/* ==============================================  DMA DMA_EARS EDREQ_3 [3..3]  ============================================== */
typedef enum {                                  /*!< DMA_EARS_EDREQ_3                                                          */
  DMA_EARS_EDREQ_3_0                   = 0,     /*!< 0 : Disable asynchronous DMA request for channel 3.                       */
  DMA_EARS_EDREQ_3_1                   = 1,     /*!< 1 : Enable asynchronous DMA request for channel 3.                        */
} DMA_EARS_EDREQ_3_Enum;

