nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  DMA DMA_EARS EDREQ_4 [4..4]  ============================================== */
typedef enum {                                  /*!< DMA_EARS_EDREQ_4                                                          */
  DMA_EARS_EDREQ_4_0                   = 0,     /*!< 0 : Disable asynchronous DMA request for channel 4.                       */
  DMA_EARS_EDREQ_4_1                   = 1,     /*!< 1 : Enable asynchronous DMA request for channel 4.                        */
} DMA_EARS_EDREQ_4_Enum;

/* ==============================================  DMA DMA_EARS EDREQ_5 [5..5]  ============================================== */
typedef enum {                                  /*!< DMA_EARS_EDREQ_5                                                          */
  DMA_EARS_EDREQ_5_0                   = 0,     /*!< 0 : Disable asynchronous DMA request for channel 5.                       */
  DMA_EARS_EDREQ_5_1                   = 1,     /*!< 1 : Enable asynchronous DMA request for channel 5.                        */
} DMA_EARS_EDREQ_5_Enum;

/* ==============================================  DMA DMA_EARS EDREQ_6 [6..6]  ============================================== */
typedef enum {                                  /*!< DMA_EARS_EDREQ_6                                                          */
  DMA_EARS_EDREQ_6_0                   = 0,     /*!< 0 : Disable asynchronous DMA request for channel 6.                       */
  DMA_EARS_EDREQ_6_1                   = 1,     /*!< 1 : Enable asynchronous DMA request for channel 6.                        */
} DMA_EARS_EDREQ_6_Enum;

/* ==============================================  DMA DMA_EARS EDREQ_7 [7..7]  ============================================== */
typedef enum {                                  /*!< DMA_EARS_EDREQ_7                                                          */
  DMA_EARS_EDREQ_7_0                   = 0,     /*!< 0 : Disable asynchronous DMA request for channel 7.                       */
  DMA_EARS_EDREQ_7_1                   = 1,     /*!< 1 : Enable asynchronous DMA request for channel 7.                        */
} DMA_EARS_EDREQ_7_Enum;

/* ==============================================  DMA DMA_EARS EDREQ_8 [8..8]  ============================================== */
typedef enum {                                  /*!< DMA_EARS_EDREQ_8                                                          */
  DMA_EARS_EDREQ_8_0                   = 0,     /*!< 0 : Disable asynchronous DMA request for channel 8.                       */
  DMA_EARS_EDREQ_8_1                   = 1,     /*!< 1 : Enable asynchronous DMA request for channel 8.                        */
} DMA_EARS_EDREQ_8_Enum;

/* ==============================================  DMA DMA_EARS EDREQ_9 [9..9]  ============================================== */
typedef enum {                                  /*!< DMA_EARS_EDREQ_9                                                          */
  DMA_EARS_EDREQ_9_0                   = 0,     /*!< 0 : Disable asynchronous DMA request for channel 9.                       */
  DMA_EARS_EDREQ_9_1                   = 1,     /*!< 1 : Enable asynchronous DMA request for channel 9.                        */
} DMA_EARS_EDREQ_9_Enum;

/* ============================================  DMA DMA_EARS EDREQ_10 [10..10]  ============================================= */
typedef enum {                                  /*!< DMA_EARS_EDREQ_10                                                         */
  DMA_EARS_EDREQ_10_0                  = 0,     /*!< 0 : Disable asynchronous DMA request for channel 10.                      */
  DMA_EARS_EDREQ_10_1                  = 1,     /*!< 1 : Enable asynchronous DMA request for channel 10.                       */
} DMA_EARS_EDREQ_10_Enum;

/* ============================================  DMA DMA_EARS EDREQ_11 [11..11]  ============================================= */
typedef enum {                                  /*!< DMA_EARS_EDREQ_11                                                         */
  DMA_EARS_EDREQ_11_0                  = 0,     /*!< 0 : Disable asynchronous DMA request for channel 11.                      */
  DMA_EARS_EDREQ_11_1                  = 1,     /*!< 1 : Enable asynchronous DMA request for channel 11.                       */
} DMA_EARS_EDREQ_11_Enum;

/* ============================================  DMA DMA_EARS EDREQ_12 [12..12]  ============================================= */
typedef enum {                                  /*!< DMA_EARS_EDREQ_12                                                         */
  DMA_EARS_EDREQ_12_0                  = 0,     /*!< 0 : Disable asynchronous DMA request for channel 12.                      */
  DMA_EARS_EDREQ_12_1                  = 1,     /*!< 1 : Enable asynchronous DMA request for channel 12.                       */
} DMA_EARS_EDREQ_12_Enum;

/* ============================================  DMA DMA_EARS EDREQ_13 [13..13]  ============================================= */
typedef enum {                                  /*!< DMA_EARS_EDREQ_13                                                         */
  DMA_EARS_EDREQ_13_0                  = 0,     /*!< 0 : Disable asynchronous DMA request for channel 13.                      */
  DMA_EARS_EDREQ_13_1                  = 1,     /*!< 1 : Enable asynchronous DMA request for channel 13.                       */
} DMA_EARS_EDREQ_13_Enum;

/* ============================================  DMA DMA_EARS EDREQ_14 [14..14]  ============================================= */
typedef enum {                                  /*!< DMA_EARS_EDREQ_14                                                         */
  DMA_EARS_EDREQ_14_0                  = 0,     /*!< 0 : Disable asynchronous DMA request for channel 14.                      */
  DMA_EARS_EDREQ_14_1                  = 1,     /*!< 1 : Enable asynchronous DMA request for channel 14.                       */
} DMA_EARS_EDREQ_14_Enum;

