nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  DMA DMA_EARS EDREQ_15 [15..15]  ============================================= */
typedef enum {                                  /*!< DMA_EARS_EDREQ_15                                                         */
  DMA_EARS_EDREQ_15_0                  = 0,     /*!< 0 : Disable asynchronous DMA request for channel 15.                      */
  DMA_EARS_EDREQ_15_1                  = 1,     /*!< 1 : Enable asynchronous DMA request for channel 15.                       */
} DMA_EARS_EDREQ_15_Enum;

/* ======================================================  DMA_DCHPRI3  ====================================================== */
/* ==============================================  DMA DMA_DCHPRI3 DPA [6..6]  =============================================== */
typedef enum {                                  /*!< DMA_DCHPRI3_DPA                                                           */
  DMA_DCHPRI3_DPA_0                    = 0,     /*!< 0 : Channel n can suspend a lower priority channel.                       */
  DMA_DCHPRI3_DPA_1                    = 1,     /*!< 1 : Channel n cannot suspend any channel, regardless of channel
                                                     priority.                                                                 */
} DMA_DCHPRI3_DPA_Enum;

/* ==============================================  DMA DMA_DCHPRI3 ECP [7..7]  =============================================== */
typedef enum {                                  /*!< DMA_DCHPRI3_ECP                                                           */
  DMA_DCHPRI3_ECP_0                    = 0,     /*!< 0 : Channel n cannot be suspended by a higher priority channels
                                                     service request.                                                          */
  DMA_DCHPRI3_ECP_1                    = 1,     /*!< 1 : Channel n can be temporarily suspended by the service request
                                                     of a higher priority channel.                                             */
} DMA_DCHPRI3_ECP_Enum;

/* ======================================================  DMA_DCHPRI2  ====================================================== */
/* ==============================================  DMA DMA_DCHPRI2 DPA [6..6]  =============================================== */
typedef enum {                                  /*!< DMA_DCHPRI2_DPA                                                           */
  DMA_DCHPRI2_DPA_0                    = 0,     /*!< 0 : Channel n can suspend a lower priority channel.                       */
  DMA_DCHPRI2_DPA_1                    = 1,     /*!< 1 : Channel n cannot suspend any channel, regardless of channel
                                                     priority.                                                                 */
} DMA_DCHPRI2_DPA_Enum;

/* ==============================================  DMA DMA_DCHPRI2 ECP [7..7]  =============================================== */
typedef enum {                                  /*!< DMA_DCHPRI2_ECP                                                           */
  DMA_DCHPRI2_ECP_0                    = 0,     /*!< 0 : Channel n cannot be suspended by a higher priority channels
                                                     service request.                                                          */
  DMA_DCHPRI2_ECP_1                    = 1,     /*!< 1 : Channel n can be temporarily suspended by the service request
                                                     of a higher priority channel.                                             */
} DMA_DCHPRI2_ECP_Enum;

/* ======================================================  DMA_DCHPRI1  ====================================================== */
/* ==============================================  DMA DMA_DCHPRI1 DPA [6..6]  =============================================== */
typedef enum {                                  /*!< DMA_DCHPRI1_DPA                                                           */
  DMA_DCHPRI1_DPA_0                    = 0,     /*!< 0 : Channel n can suspend a lower priority channel.                       */
  DMA_DCHPRI1_DPA_1                    = 1,     /*!< 1 : Channel n cannot suspend any channel, regardless of channel
                                                     priority.                                                                 */
} DMA_DCHPRI1_DPA_Enum;

/* ==============================================  DMA DMA_DCHPRI1 ECP [7..7]  =============================================== */
typedef enum {                                  /*!< DMA_DCHPRI1_ECP                                                           */
  DMA_DCHPRI1_ECP_0                    = 0,     /*!< 0 : Channel n cannot be suspended by a higher priority channels
                                                     service request.                                                          */
  DMA_DCHPRI1_ECP_1                    = 1,     /*!< 1 : Channel n can be temporarily suspended by the service request
                                                     of a higher priority channel.                                             */
} DMA_DCHPRI1_ECP_Enum;

/* ======================================================  DMA_DCHPRI0  ====================================================== */
/* ==============================================  DMA DMA_DCHPRI0 DPA [6..6]  =============================================== */
typedef enum {                                  /*!< DMA_DCHPRI0_DPA                                                           */
  DMA_DCHPRI0_DPA_0                    = 0,     /*!< 0 : Channel n can suspend a lower priority channel.                       */
  DMA_DCHPRI0_DPA_1                    = 1,     /*!< 1 : Channel n cannot suspend any channel, regardless of channel
                                                     priority.                                                                 */
} DMA_DCHPRI0_DPA_Enum;

