nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  MPU MPU_RGD0_WORD2 M1SM [9..10]  ============================================ */
typedef enum {                                  /*!< MPU_RGD0_WORD2_M1SM                                                       */
  MPU_RGD0_WORD2_M1SM_00               = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGD0_WORD2_M1SM_01               = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGD0_WORD2_M1SM_10               = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGD0_WORD2_M1SM_11               = 3,     /*!< 11 : Same as User mode defined in M1UM                                    */
} MPU_RGD0_WORD2_M1SM_Enum;

/* ===========================================  MPU MPU_RGD0_WORD2 M2SM [15..16]  ============================================ */
typedef enum {                                  /*!< MPU_RGD0_WORD2_M2SM                                                       */
  MPU_RGD0_WORD2_M2SM_00               = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGD0_WORD2_M2SM_01               = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGD0_WORD2_M2SM_10               = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGD0_WORD2_M2SM_11               = 3,     /*!< 11 : Same as User mode defined in M2UM                                    */
} MPU_RGD0_WORD2_M2SM_Enum;

/* ===========================================  MPU MPU_RGD0_WORD2 M3SM [21..22]  ============================================ */
typedef enum {                                  /*!< MPU_RGD0_WORD2_M3SM                                                       */
  MPU_RGD0_WORD2_M3SM_00               = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGD0_WORD2_M3SM_01               = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGD0_WORD2_M3SM_10               = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGD0_WORD2_M3SM_11               = 3,     /*!< 11 : Same as User mode defined in M3UM                                    */
} MPU_RGD0_WORD2_M3SM_Enum;

/* ===========================================  MPU MPU_RGD0_WORD2 M4WE [24..24]  ============================================ */
typedef enum {                                  /*!< MPU_RGD0_WORD2_M4WE                                                       */
  MPU_RGD0_WORD2_M4WE_0                = 0,     /*!< 0 : Bus master 4 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGD0_WORD2_M4WE_1                = 1,     /*!< 1 : Bus master 4 writes allowed                                           */
} MPU_RGD0_WORD2_M4WE_Enum;

/* ===========================================  MPU MPU_RGD0_WORD2 M4RE [25..25]  ============================================ */
typedef enum {                                  /*!< MPU_RGD0_WORD2_M4RE                                                       */
  MPU_RGD0_WORD2_M4RE_0                = 0,     /*!< 0 : Bus master 4 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGD0_WORD2_M4RE_1                = 1,     /*!< 1 : Bus master 4 reads allowed                                            */
} MPU_RGD0_WORD2_M4RE_Enum;

/* ===========================================  MPU MPU_RGD0_WORD2 M5WE [26..26]  ============================================ */
typedef enum {                                  /*!< MPU_RGD0_WORD2_M5WE                                                       */
  MPU_RGD0_WORD2_M5WE_0                = 0,     /*!< 0 : Bus master 5 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGD0_WORD2_M5WE_1                = 1,     /*!< 1 : Bus master 5 writes allowed                                           */
} MPU_RGD0_WORD2_M5WE_Enum;

/* ===========================================  MPU MPU_RGD0_WORD2 M5RE [27..27]  ============================================ */
typedef enum {                                  /*!< MPU_RGD0_WORD2_M5RE                                                       */
  MPU_RGD0_WORD2_M5RE_0                = 0,     /*!< 0 : Bus master 5 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGD0_WORD2_M5RE_1                = 1,     /*!< 1 : Bus master 5 reads allowed                                            */
} MPU_RGD0_WORD2_M5RE_Enum;

/* ===========================================  MPU MPU_RGD0_WORD2 M6WE [28..28]  ============================================ */
typedef enum {                                  /*!< MPU_RGD0_WORD2_M6WE                                                       */
  MPU_RGD0_WORD2_M6WE_0                = 0,     /*!< 0 : Bus master 6 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGD0_WORD2_M6WE_1                = 1,     /*!< 1 : Bus master 6 writes allowed                                           */
} MPU_RGD0_WORD2_M6WE_Enum;

/* ===========================================  MPU MPU_RGD0_WORD2 M6RE [29..29]  ============================================ */
typedef enum {                                  /*!< MPU_RGD0_WORD2_M6RE                                                       */
  MPU_RGD0_WORD2_M6RE_0                = 0,     /*!< 0 : Bus master 6 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGD0_WORD2_M6RE_1                = 1,     /*!< 1 : Bus master 6 reads allowed                                            */
} MPU_RGD0_WORD2_M6RE_Enum;

/* ===========================================  MPU MPU_RGD0_WORD2 M7WE [30..30]  ============================================ */
typedef enum {                                  /*!< MPU_RGD0_WORD2_M7WE                                                       */
  MPU_RGD0_WORD2_M7WE_0                = 0,     /*!< 0 : Bus master 7 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGD0_WORD2_M7WE_1                = 1,     /*!< 1 : Bus master 7 writes allowed                                           */
} MPU_RGD0_WORD2_M7WE_Enum;

