nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===========================================  MPU MPU_RGD0_WORD2 M7RE [31..31]  ============================================ */
typedef enum {                                  /*!< MPU_RGD0_WORD2_M7RE                                                       */
  MPU_RGD0_WORD2_M7RE_0                = 0,     /*!< 0 : Bus master 7 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGD0_WORD2_M7RE_1                = 1,     /*!< 1 : Bus master 7 reads allowed                                            */
} MPU_RGD0_WORD2_M7RE_Enum;

/* ====================================================  MPU_RGD0_WORD3  ===================================================== */
/* =============================================  MPU MPU_RGD0_WORD3 VLD [0..0]  ============================================= */
typedef enum {                                  /*!< MPU_RGD0_WORD3_VLD                                                        */
  MPU_RGD0_WORD3_VLD_0                 = 0,     /*!< 0 : Region descriptor is invalid                                          */
  MPU_RGD0_WORD3_VLD_1                 = 1,     /*!< 1 : Region descriptor is valid                                            */
} MPU_RGD0_WORD3_VLD_Enum;

/* ====================================================  MPU_RGD1_WORD0  ===================================================== */
/* ====================================================  MPU_RGD1_WORD1  ===================================================== */
/* ====================================================  MPU_RGD1_WORD2  ===================================================== */
/* ============================================  MPU MPU_RGD1_WORD2 M0SM [3..4]  ============================================= */
typedef enum {                                  /*!< MPU_RGD1_WORD2_M0SM                                                       */
  MPU_RGD1_WORD2_M0SM_00               = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGD1_WORD2_M0SM_01               = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGD1_WORD2_M0SM_10               = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGD1_WORD2_M0SM_11               = 3,     /*!< 11 : Same as User mode defined in M0UM                                    */
} MPU_RGD1_WORD2_M0SM_Enum;

/* ============================================  MPU MPU_RGD1_WORD2 M0PE [5..5]  ============================================= */
typedef enum {                                  /*!< MPU_RGD1_WORD2_M0PE                                                       */
  MPU_RGD1_WORD2_M0PE_0                = 0,     /*!< 0 : Do not include the process identifier in the evaluation               */
  MPU_RGD1_WORD2_M0PE_1                = 1,     /*!< 1 : Include the process identifier and mask (RGDn.RGDAAC) in
                                                     the region hit evaluation                                                 */
} MPU_RGD1_WORD2_M0PE_Enum;

/* ============================================  MPU MPU_RGD1_WORD2 M1SM [9..10]  ============================================ */
typedef enum {                                  /*!< MPU_RGD1_WORD2_M1SM                                                       */
  MPU_RGD1_WORD2_M1SM_00               = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGD1_WORD2_M1SM_01               = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGD1_WORD2_M1SM_10               = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGD1_WORD2_M1SM_11               = 3,     /*!< 11 : Same as User mode defined in M1UM                                    */
} MPU_RGD1_WORD2_M1SM_Enum;

/* ===========================================  MPU MPU_RGD1_WORD2 M2SM [15..16]  ============================================ */
typedef enum {                                  /*!< MPU_RGD1_WORD2_M2SM                                                       */
  MPU_RGD1_WORD2_M2SM_00               = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGD1_WORD2_M2SM_01               = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGD1_WORD2_M2SM_10               = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGD1_WORD2_M2SM_11               = 3,     /*!< 11 : Same as User mode defined in M2UM                                    */
} MPU_RGD1_WORD2_M2SM_Enum;

/* ===========================================  MPU MPU_RGD1_WORD2 M3SM [21..22]  ============================================ */
typedef enum {                                  /*!< MPU_RGD1_WORD2_M3SM                                                       */
  MPU_RGD1_WORD2_M3SM_00               = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGD1_WORD2_M3SM_01               = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGD1_WORD2_M3SM_10               = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGD1_WORD2_M3SM_11               = 3,     /*!< 11 : Same as User mode defined in M3UM                                    */
} MPU_RGD1_WORD2_M3SM_Enum;

/* ===========================================  MPU MPU_RGD1_WORD2 M4WE [24..24]  ============================================ */
typedef enum {                                  /*!< MPU_RGD1_WORD2_M4WE                                                       */
  MPU_RGD1_WORD2_M4WE_0                = 0,     /*!< 0 : Bus master 4 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGD1_WORD2_M4WE_1                = 1,     /*!< 1 : Bus master 4 writes allowed                                           */
} MPU_RGD1_WORD2_M4WE_Enum;

/* ===========================================  MPU MPU_RGD1_WORD2 M4RE [25..25]  ============================================ */
typedef enum {                                  /*!< MPU_RGD1_WORD2_M4RE                                                       */
  MPU_RGD1_WORD2_M4RE_0                = 0,     /*!< 0 : Bus master 4 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGD1_WORD2_M4RE_1                = 1,     /*!< 1 : Bus master 4 reads allowed                                            */
} MPU_RGD1_WORD2_M4RE_Enum;

