nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  MPU MPU_RGDAAC5 M7WE [30..30]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC5_M7WE                                                          */
  MPU_RGDAAC5_M7WE_0                   = 0,     /*!< 0 : Bus master 7 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGDAAC5_M7WE_1                   = 1,     /*!< 1 : Bus master 7 writes allowed                                           */
} MPU_RGDAAC5_M7WE_Enum;

/* =============================================  MPU MPU_RGDAAC5 M7RE [31..31]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC5_M7RE                                                          */
  MPU_RGDAAC5_M7RE_0                   = 0,     /*!< 0 : Bus master 7 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGDAAC5_M7RE_1                   = 1,     /*!< 1 : Bus master 7 reads allowed                                            */
} MPU_RGDAAC5_M7RE_Enum;

/* ======================================================  MPU_RGDAAC6  ====================================================== */
/* ==============================================  MPU MPU_RGDAAC6 M0SM [3..4]  ============================================== */
typedef enum {                                  /*!< MPU_RGDAAC6_M0SM                                                          */
  MPU_RGDAAC6_M0SM_00                  = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGDAAC6_M0SM_01                  = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGDAAC6_M0SM_10                  = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGDAAC6_M0SM_11                  = 3,     /*!< 11 : Same as User mode defined in M0UM                                    */
} MPU_RGDAAC6_M0SM_Enum;

/* ==============================================  MPU MPU_RGDAAC6 M0PE [5..5]  ============================================== */
typedef enum {                                  /*!< MPU_RGDAAC6_M0PE                                                          */
  MPU_RGDAAC6_M0PE_0                   = 0,     /*!< 0 : Do not include the process identifier in the evaluation               */
  MPU_RGDAAC6_M0PE_1                   = 1,     /*!< 1 : Include the process identifier and mask (RGDn.RGDAAC) in
                                                     the region hit evaluation                                                 */
} MPU_RGDAAC6_M0PE_Enum;

/* =============================================  MPU MPU_RGDAAC6 M1SM [9..10]  ============================================== */
typedef enum {                                  /*!< MPU_RGDAAC6_M1SM                                                          */
  MPU_RGDAAC6_M1SM_00                  = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGDAAC6_M1SM_01                  = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGDAAC6_M1SM_10                  = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGDAAC6_M1SM_11                  = 3,     /*!< 11 : Same as User mode defined in M1UM                                    */
} MPU_RGDAAC6_M1SM_Enum;

/* =============================================  MPU MPU_RGDAAC6 M2SM [15..16]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC6_M2SM                                                          */
  MPU_RGDAAC6_M2SM_00                  = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGDAAC6_M2SM_01                  = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGDAAC6_M2SM_10                  = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGDAAC6_M2SM_11                  = 3,     /*!< 11 : Same as User mode defined in M2UM                                    */
} MPU_RGDAAC6_M2SM_Enum;

/* =============================================  MPU MPU_RGDAAC6 M3SM [21..22]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC6_M3SM                                                          */
  MPU_RGDAAC6_M3SM_00                  = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGDAAC6_M3SM_01                  = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGDAAC6_M3SM_10                  = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGDAAC6_M3SM_11                  = 3,     /*!< 11 : Same as User mode defined in M3UM                                    */
} MPU_RGDAAC6_M3SM_Enum;

/* =============================================  MPU MPU_RGDAAC6 M4WE [24..24]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC6_M4WE                                                          */
  MPU_RGDAAC6_M4WE_0                   = 0,     /*!< 0 : Bus master 4 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGDAAC6_M4WE_1                   = 1,     /*!< 1 : Bus master 4 writes allowed                                           */
} MPU_RGDAAC6_M4WE_Enum;

/* =============================================  MPU MPU_RGDAAC6 M4RE [25..25]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC6_M4RE                                                          */
  MPU_RGDAAC6_M4RE_0                   = 0,     /*!< 0 : Bus master 4 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGDAAC6_M4RE_1                   = 1,     /*!< 1 : Bus master 4 reads allowed                                            */
} MPU_RGDAAC6_M4RE_Enum;

/* =============================================  MPU MPU_RGDAAC6 M5WE [26..26]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC6_M5WE                                                          */
  MPU_RGDAAC6_M5WE_0                   = 0,     /*!< 0 : Bus master 5 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGDAAC6_M5WE_1                   = 1,     /*!< 1 : Bus master 5 writes allowed                                           */
} MPU_RGDAAC6_M5WE_Enum;

/* =============================================  MPU MPU_RGDAAC6 M5RE [27..27]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC6_M5RE                                                          */
  MPU_RGDAAC6_M5RE_0                   = 0,     /*!< 0 : Bus master 5 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGDAAC6_M5RE_1                   = 1,     /*!< 1 : Bus master 5 reads allowed                                            */
} MPU_RGDAAC6_M5RE_Enum;

