nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  CAN0 CAN0_MCR IRMQ [16..16]  ============================================== */
typedef enum {                                  /*!< CAN0_MCR_IRMQ                                                             */
  CAN0_MCR_IRMQ_0                      = 0,     /*!< 0 : Individual Rx masking and queue feature are disabled. For
                                                     backward compatibility with legacy applications, the reading
                                                     of C/S word locks the MB even if it is EMPTY.                             */
  CAN0_MCR_IRMQ_1                      = 1,     /*!< 1 : Individual Rx masking and queue feature are enabled.                  */
} CAN0_MCR_IRMQ_Enum;

/* =============================================  CAN0 CAN0_MCR SRXDIS [17..17]  ============================================= */
typedef enum {                                  /*!< CAN0_MCR_SRXDIS                                                           */
  CAN0_MCR_SRXDIS_0                    = 0,     /*!< 0 : Self reception enabled.                                               */
  CAN0_MCR_SRXDIS_1                    = 1,     /*!< 1 : Self reception disabled.                                              */
} CAN0_MCR_SRXDIS_Enum;

/* =============================================  CAN0 CAN0_MCR LPMACK [20..20]  ============================================= */
typedef enum {                                  /*!< CAN0_MCR_LPMACK                                                           */
  CAN0_MCR_LPMACK_0                    = 0,     /*!< 0 : FlexCAN is not in a low-power mode.                                   */
  CAN0_MCR_LPMACK_1                    = 1,     /*!< 1 : FlexCAN is in a low-power mode.                                       */
} CAN0_MCR_LPMACK_Enum;

/* =============================================  CAN0 CAN0_MCR WRNEN [21..21]  ============================================== */
typedef enum {                                  /*!< CAN0_MCR_WRNEN                                                            */
  CAN0_MCR_WRNEN_0                     = 0,     /*!< 0 : TWRNINT and RWRNINT bits are zero, independent of the values
                                                     in the error counters.                                                    */
  CAN0_MCR_WRNEN_1                     = 1,     /*!< 1 : TWRNINT and RWRNINT bits are set when the respective error
                                                     counter transitions from less than 96 to greater than or
                                                     equal to 96.                                                              */
} CAN0_MCR_WRNEN_Enum;

/* =============================================  CAN0 CAN0_MCR FRZACK [24..24]  ============================================= */
typedef enum {                                  /*!< CAN0_MCR_FRZACK                                                           */
  CAN0_MCR_FRZACK_0                    = 0,     /*!< 0 : FlexCAN not in Freeze mode, prescaler running.                        */
  CAN0_MCR_FRZACK_1                    = 1,     /*!< 1 : FlexCAN in Freeze mode, prescaler stopped.                            */
} CAN0_MCR_FRZACK_Enum;

/* ============================================  CAN0 CAN0_MCR SOFTRST [25..25]  ============================================= */
typedef enum {                                  /*!< CAN0_MCR_SOFTRST                                                          */
  CAN0_MCR_SOFTRST_0                   = 0,     /*!< 0 : No reset request.                                                     */
  CAN0_MCR_SOFTRST_1                   = 1,     /*!< 1 : Resets the registers affected by soft reset.                          */
} CAN0_MCR_SOFTRST_Enum;

/* =============================================  CAN0 CAN0_MCR NOTRDY [27..27]  ============================================= */
typedef enum {                                  /*!< CAN0_MCR_NOTRDY                                                           */
  CAN0_MCR_NOTRDY_0                    = 0,     /*!< 0 : FlexCAN module is either in Normal mode, Listen-Only mode
                                                     or Loop-Back mode.                                                        */
} CAN0_MCR_NOTRDY_Enum;

/* ==============================================  CAN0 CAN0_MCR HALT [28..28]  ============================================== */
typedef enum {                                  /*!< CAN0_MCR_HALT                                                             */
  CAN0_MCR_HALT_0                      = 0,     /*!< 0 : No Freeze mode request.                                               */
  CAN0_MCR_HALT_1                      = 1,     /*!< 1 : Enters Freeze mode if the FRZ bit is asserted.                        */
} CAN0_MCR_HALT_Enum;

/* ==============================================  CAN0 CAN0_MCR RFEN [29..29]  ============================================== */
typedef enum {                                  /*!< CAN0_MCR_RFEN                                                             */
  CAN0_MCR_RFEN_0                      = 0,     /*!< 0 : Rx FIFO not enabled.                                                  */
  CAN0_MCR_RFEN_1                      = 1,     /*!< 1 : Rx FIFO enabled.                                                      */
} CAN0_MCR_RFEN_Enum;

/* ==============================================  CAN0 CAN0_MCR FRZ [30..30]  =============================================== */
typedef enum {                                  /*!< CAN0_MCR_FRZ                                                              */
  CAN0_MCR_FRZ_0                       = 0,     /*!< 0 : Not enabled to enter Freeze mode.                                     */
  CAN0_MCR_FRZ_1                       = 1,     /*!< 1 : Enabled to enter Freeze mode.                                         */
} CAN0_MCR_FRZ_Enum;

/* ==============================================  CAN0 CAN0_MCR MDIS [31..31]  ============================================== */
typedef enum {                                  /*!< CAN0_MCR_MDIS                                                             */
  CAN0_MCR_MDIS_0                      = 0,     /*!< 0 : Enable the FlexCAN module.                                            */
  CAN0_MCR_MDIS_1                      = 1,     /*!< 1 : Disable the FlexCAN module.                                           */
} CAN0_MCR_MDIS_Enum;

/* ======================================================  CAN0_CTRL1  ======================================================= */
/* ==============================================  CAN0 CAN0_CTRL1 LOM [3..3]  =============================================== */
typedef enum {                                  /*!< CAN0_CTRL1_LOM                                                            */
  CAN0_CTRL1_LOM_0                     = 0,     /*!< 0 : Listen-Only mode is deactivated.                                      */
  CAN0_CTRL1_LOM_1                     = 1,     /*!< 1 : FlexCAN module operates in Listen-Only mode.                          */
} CAN0_CTRL1_LOM_Enum;

/* ==============================================  CAN0 CAN0_CTRL1 LBUF [4..4]  ============================================== */
typedef enum {                                  /*!< CAN0_CTRL1_LBUF                                                           */
  CAN0_CTRL1_LBUF_0                    = 0,     /*!< 0 : Buffer with highest priority is transmitted first.                    */
  CAN0_CTRL1_LBUF_1                    = 1,     /*!< 1 : Lowest number buffer is transmitted first.                            */
} CAN0_CTRL1_LBUF_Enum;

/* ==============================================  CAN0 CAN0_CTRL1 TSYN [5..5]  ============================================== */
typedef enum {                                  /*!< CAN0_CTRL1_TSYN                                                           */
  CAN0_CTRL1_TSYN_0                    = 0,     /*!< 0 : Timer Sync feature disabled                                           */
  CAN0_CTRL1_TSYN_1                    = 1,     /*!< 1 : Timer Sync feature enabled                                            */
} CAN0_CTRL1_TSYN_Enum;

/* ============================================  CAN0 CAN0_CTRL1 BOFFREC [6..6]  ============================================= */
typedef enum {                                  /*!< CAN0_CTRL1_BOFFREC                                                        */
  CAN0_CTRL1_BOFFREC_0                 = 0,     /*!< 0 : Automatic recovering from Bus Off state enabled.                      */
  CAN0_CTRL1_BOFFREC_1                 = 1,     /*!< 1 : Automatic recovering from Bus Off state disabled.                     */
} CAN0_CTRL1_BOFFREC_Enum;

/* ==============================================  CAN0 CAN0_CTRL1 SMP [7..7]  =============================================== */
typedef enum {                                  /*!< CAN0_CTRL1_SMP                                                            */
  CAN0_CTRL1_SMP_0                     = 0,     /*!< 0 : Just one sample is used to determine the bit value.                   */
  CAN0_CTRL1_SMP_1                     = 1,     /*!< 1 : Three samples are used to determine the value of the received
                                                     bit: the regular one (sample point) and 2 preceding samples;
                                                     a majority rule is used.                                                  */
} CAN0_CTRL1_SMP_Enum;

