nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===============================================  CAN0 CAN0_ESR1 TX [6..6]  ================================================ */
typedef enum {                                  /*!< CAN0_ESR1_TX                                                              */
  CAN0_ESR1_TX_0                       = 0,     /*!< 0 : FlexCAN is not transmitting a message.                                */
  CAN0_ESR1_TX_1                       = 1,     /*!< 1 : FlexCAN is transmitting a message.                                    */
} CAN0_ESR1_TX_Enum;

/* ==============================================  CAN0 CAN0_ESR1 IDLE [7..7]  =============================================== */
typedef enum {                                  /*!< CAN0_ESR1_IDLE                                                            */
  CAN0_ESR1_IDLE_0                     = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_IDLE_1                     = 1,     /*!< 1 : CAN bus is now IDLE.                                                  */
} CAN0_ESR1_IDLE_Enum;

/* ==============================================  CAN0 CAN0_ESR1 RXWRN [8..8]  ============================================== */
typedef enum {                                  /*!< CAN0_ESR1_RXWRN                                                           */
  CAN0_ESR1_RXWRN_0                    = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_RXWRN_1                    = 1,     /*!< 1 : RXERRCNT is greater than or equal to 96.                              */
} CAN0_ESR1_RXWRN_Enum;

/* ==============================================  CAN0 CAN0_ESR1 TXWRN [9..9]  ============================================== */
typedef enum {                                  /*!< CAN0_ESR1_TXWRN                                                           */
  CAN0_ESR1_TXWRN_0                    = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_TXWRN_1                    = 1,     /*!< 1 : TXERRCNT is greater than or equal to 96.                              */
} CAN0_ESR1_TXWRN_Enum;

/* ============================================  CAN0 CAN0_ESR1 STFERR [10..10]  ============================================= */
typedef enum {                                  /*!< CAN0_ESR1_STFERR                                                          */
  CAN0_ESR1_STFERR_0                   = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_STFERR_1                   = 1,     /*!< 1 : A Stuffing Error occurred since last read of this register.           */
} CAN0_ESR1_STFERR_Enum;

/* ============================================  CAN0 CAN0_ESR1 FRMERR [11..11]  ============================================= */
typedef enum {                                  /*!< CAN0_ESR1_FRMERR                                                          */
  CAN0_ESR1_FRMERR_0                   = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_FRMERR_1                   = 1,     /*!< 1 : A Form Error occurred since last read of this register.               */
} CAN0_ESR1_FRMERR_Enum;

/* ============================================  CAN0 CAN0_ESR1 CRCERR [12..12]  ============================================= */
typedef enum {                                  /*!< CAN0_ESR1_CRCERR                                                          */
  CAN0_ESR1_CRCERR_0                   = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_CRCERR_1                   = 1,     /*!< 1 : A CRC error occurred since last read of this register.                */
} CAN0_ESR1_CRCERR_Enum;

/* ============================================  CAN0 CAN0_ESR1 ACKERR [13..13]  ============================================= */
typedef enum {                                  /*!< CAN0_ESR1_ACKERR                                                          */
  CAN0_ESR1_ACKERR_0                   = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_ACKERR_1                   = 1,     /*!< 1 : An ACK error occurred since last read of this register.               */
} CAN0_ESR1_ACKERR_Enum;

/* ============================================  CAN0 CAN0_ESR1 BIT0ERR [14..14]  ============================================ */
typedef enum {                                  /*!< CAN0_ESR1_BIT0ERR                                                         */
  CAN0_ESR1_BIT0ERR_0                  = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_BIT0ERR_1                  = 1,     /*!< 1 : At least one bit sent as dominant is received as recessive.           */
} CAN0_ESR1_BIT0ERR_Enum;

/* ============================================  CAN0 CAN0_ESR1 BIT1ERR [15..15]  ============================================ */
typedef enum {                                  /*!< CAN0_ESR1_BIT1ERR                                                         */
  CAN0_ESR1_BIT1ERR_0                  = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_BIT1ERR_1                  = 1,     /*!< 1 : At least one bit sent as recessive is received as dominant.           */
} CAN0_ESR1_BIT1ERR_Enum;

/* ============================================  CAN0 CAN0_ESR1 RWRNINT [16..16]  ============================================ */
typedef enum {                                  /*!< CAN0_ESR1_RWRNINT                                                         */
  CAN0_ESR1_RWRNINT_0                  = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_RWRNINT_1                  = 1,     /*!< 1 : The Rx error counter transitioned from less than 96 to greater
                                                     than or equal to 96.                                                      */
} CAN0_ESR1_RWRNINT_Enum;

