nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  CAN0 CAN0_ESR1 TWRNINT [17..17]  ============================================ */
typedef enum {                                  /*!< CAN0_ESR1_TWRNINT                                                         */
  CAN0_ESR1_TWRNINT_0                  = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_TWRNINT_1                  = 1,     /*!< 1 : The Tx error counter transitioned from less than 96 to greater
                                                     than or equal to 96.                                                      */
} CAN0_ESR1_TWRNINT_Enum;

/* =============================================  CAN0 CAN0_ESR1 SYNCH [18..18]  ============================================= */
typedef enum {                                  /*!< CAN0_ESR1_SYNCH                                                           */
  CAN0_ESR1_SYNCH_0                    = 0,     /*!< 0 : FlexCAN is not synchronized to the CAN bus.                           */
  CAN0_ESR1_SYNCH_1                    = 1,     /*!< 1 : FlexCAN is synchronized to the CAN bus.                               */
} CAN0_ESR1_SYNCH_Enum;

/* ==========================================  CAN0 CAN0_ESR1 BOFFDONEINT [19..19]  ========================================== */
typedef enum {                                  /*!< CAN0_ESR1_BOFFDONEINT                                                     */
  CAN0_ESR1_BOFFDONEINT_0              = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_BOFFDONEINT_1              = 1,     /*!< 1 : FlexCAN module has completed Bus Off process.                         */
} CAN0_ESR1_BOFFDONEINT_Enum;

/* ==========================================  CAN0 CAN0_ESR1 ERRINT_FAST [20..20]  ========================================== */
typedef enum {                                  /*!< CAN0_ESR1_ERRINT_FAST                                                     */
  CAN0_ESR1_ERRINT_FAST_0              = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_ERRINT_FAST_1              = 1,     /*!< 1 : Indicates setting of any Error Bit detected in the Data
                                                     Phase of CAN FD frames with the BRS bit set.                              */
} CAN0_ESR1_ERRINT_FAST_Enum;

/* ============================================  CAN0 CAN0_ESR1 ERROVR [21..21]  ============================================= */
typedef enum {                                  /*!< CAN0_ESR1_ERROVR                                                          */
  CAN0_ESR1_ERROVR_0                   = 0,     /*!< 0 : Overrun has not occurred.                                             */
  CAN0_ESR1_ERROVR_1                   = 1,     /*!< 1 : Overrun has occurred.                                                 */
} CAN0_ESR1_ERROVR_Enum;

/* ==========================================  CAN0 CAN0_ESR1 STFERR_FAST [26..26]  ========================================== */
typedef enum {                                  /*!< CAN0_ESR1_STFERR_FAST                                                     */
  CAN0_ESR1_STFERR_FAST_0              = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_STFERR_FAST_1              = 1,     /*!< 1 : A Stuffing Error occurred since last read of this register.           */
} CAN0_ESR1_STFERR_FAST_Enum;

/* ==========================================  CAN0 CAN0_ESR1 FRMERR_FAST [27..27]  ========================================== */
typedef enum {                                  /*!< CAN0_ESR1_FRMERR_FAST                                                     */
  CAN0_ESR1_FRMERR_FAST_0              = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_FRMERR_FAST_1              = 1,     /*!< 1 : A Form Error occurred since last read of this register.               */
} CAN0_ESR1_FRMERR_FAST_Enum;

/* ==========================================  CAN0 CAN0_ESR1 CRCERR_FAST [28..28]  ========================================== */
typedef enum {                                  /*!< CAN0_ESR1_CRCERR_FAST                                                     */
  CAN0_ESR1_CRCERR_FAST_0              = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_CRCERR_FAST_1              = 1,     /*!< 1 : A CRC error occurred since last read of this register.                */
} CAN0_ESR1_CRCERR_FAST_Enum;

/* =========================================  CAN0 CAN0_ESR1 BIT0ERR_FAST [30..30]  ========================================== */
typedef enum {                                  /*!< CAN0_ESR1_BIT0ERR_FAST                                                    */
  CAN0_ESR1_BIT0ERR_FAST_0             = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_BIT0ERR_FAST_1             = 1,     /*!< 1 : At least one bit sent as dominant is received as recessive.           */
} CAN0_ESR1_BIT0ERR_FAST_Enum;

/* =========================================  CAN0 CAN0_ESR1 BIT1ERR_FAST [31..31]  ========================================== */
typedef enum {                                  /*!< CAN0_ESR1_BIT1ERR_FAST                                                    */
  CAN0_ESR1_BIT1ERR_FAST_0             = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_BIT1ERR_FAST_1             = 1,     /*!< 1 : At least one bit sent as recessive is received as dominant.           */
} CAN0_ESR1_BIT1ERR_FAST_Enum;

/* ======================================================  CAN0_IMASK1  ====================================================== */
/* ======================================================  CAN0_IFLAG1  ====================================================== */
/* =============================================  CAN0 CAN0_IFLAG1 BUF0I [0..0]  ============================================= */
typedef enum {                                  /*!< CAN0_IFLAG1_BUF0I                                                         */
  CAN0_IFLAG1_BUF0I_0                  = 0,     /*!< 0 : The corresponding buffer has no occurrence of successfully
                                                     completed transmission or reception when MCR[RFEN]=0.                     */
  CAN0_IFLAG1_BUF0I_1                  = 1,     /*!< 1 : The corresponding buffer has successfully completed transmission
                                                     or reception when MCR[RFEN]=0.                                            */
} CAN0_IFLAG1_BUF0I_Enum;

