nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  CAN0 CAN0_IFLAG1 BUF5I [5..5]  ============================================= */
typedef enum {                                  /*!< CAN0_IFLAG1_BUF5I                                                         */
  CAN0_IFLAG1_BUF5I_0                  = 0,     /*!< 0 : No occurrence of MB5 completing transmission/reception when
                                                     MCR[RFEN]=0, or of frame(s) available in the FIFO, when
                                                     MCR[RFEN]=1                                                               */
  CAN0_IFLAG1_BUF5I_1                  = 1,     /*!< 1 : MB5 completed transmission/reception when MCR[RFEN]=0, or
                                                     frame(s) available in the Rx FIFO when MCR[RFEN]=1. It
                                                     generates a DMA request in case of MCR[RFEN] and MCR[DMA]
                                                     are enabled.                                                              */
} CAN0_IFLAG1_BUF5I_Enum;

/* =============================================  CAN0 CAN0_IFLAG1 BUF6I [6..6]  ============================================= */
typedef enum {                                  /*!< CAN0_IFLAG1_BUF6I                                                         */
  CAN0_IFLAG1_BUF6I_0                  = 0,     /*!< 0 : No occurrence of MB6 completing transmission/reception when
                                                     MCR[RFEN]=0, or of Rx FIFO almost full when MCR[RFEN]=1                   */
  CAN0_IFLAG1_BUF6I_1                  = 1,     /*!< 1 : MB6 completed transmission/reception when MCR[RFEN]=0, or
                                                     Rx FIFO almost full when MCR[RFEN]=1                                      */
} CAN0_IFLAG1_BUF6I_Enum;

/* =============================================  CAN0 CAN0_IFLAG1 BUF7I [7..7]  ============================================= */
typedef enum {                                  /*!< CAN0_IFLAG1_BUF7I                                                         */
  CAN0_IFLAG1_BUF7I_0                  = 0,     /*!< 0 : No occurrence of MB7 completing transmission/reception when
                                                     MCR[RFEN]=0, or of Rx FIFO overflow when MCR[RFEN]=1                      */
  CAN0_IFLAG1_BUF7I_1                  = 1,     /*!< 1 : MB7 completed transmission/reception when MCR[RFEN]=0, or
                                                     Rx FIFO overflow when MCR[RFEN]=1                                         */
} CAN0_IFLAG1_BUF7I_Enum;

/* ======================================================  CAN0_CTRL2  ======================================================= */
/* ===========================================  CAN0 CAN0_CTRL2 EDFLTDIS [11..11]  =========================================== */
typedef enum {                                  /*!< CAN0_CTRL2_EDFLTDIS                                                       */
  CAN0_CTRL2_EDFLTDIS_0                = 0,     /*!< 0 : Edge Filter is enabled.                                               */
  CAN0_CTRL2_EDFLTDIS_1                = 1,     /*!< 1 : Edge Filter is disabled.                                              */
} CAN0_CTRL2_EDFLTDIS_Enum;

/* ==========================================  CAN0 CAN0_CTRL2 ISOCANFDEN [12..12]  ========================================== */
typedef enum {                                  /*!< CAN0_CTRL2_ISOCANFDEN                                                     */
  CAN0_CTRL2_ISOCANFDEN_0              = 0,     /*!< 0 : FlexCAN operates using the non-ISO CAN FD protocol.                   */
  CAN0_CTRL2_ISOCANFDEN_1              = 1,     /*!< 1 : FlexCAN operates using the ISO CAN FD protocol (ISO 11898-1).         */
} CAN0_CTRL2_ISOCANFDEN_Enum;

/* ===========================================  CAN0 CAN0_CTRL2 PREXCEN [14..14]  ============================================ */
typedef enum {                                  /*!< CAN0_CTRL2_PREXCEN                                                        */
  CAN0_CTRL2_PREXCEN_0                 = 0,     /*!< 0 : Protocol Exception is disabled.                                       */
  CAN0_CTRL2_PREXCEN_1                 = 1,     /*!< 1 : Protocol Exception is enabled.                                        */
} CAN0_CTRL2_PREXCEN_Enum;

/* ==========================================  CAN0 CAN0_CTRL2 TIMER_SRC [15..15]  =========================================== */
typedef enum {                                  /*!< CAN0_CTRL2_TIMER_SRC                                                      */
  CAN0_CTRL2_TIMER_SRC_0               = 0,     /*!< 0 : The Free Running Timer is clocked by the CAN bit clock,
                                                     which defines the baud rate on the CAN bus.                               */
  CAN0_CTRL2_TIMER_SRC_1               = 1,     /*!< 1 : The Free Running Timer is clocked by an external time tick.
                                                     The period can be either adjusted to be equal to the baud
                                                     rate on the CAN bus, or a different value as required.
                                                     See the device specific section for details about the external
                                                     time tick.                                                                */
} CAN0_CTRL2_TIMER_SRC_Enum;

/* ============================================  CAN0 CAN0_CTRL2 EACEN [16..16]  ============================================= */
typedef enum {                                  /*!< CAN0_CTRL2_EACEN                                                          */
  CAN0_CTRL2_EACEN_0                   = 0,     /*!< 0 : Rx Mailbox filters IDE bit is always compared and RTR is
                                                     never compared despite mask bits.                                         */
  CAN0_CTRL2_EACEN_1                   = 1,     /*!< 1 : Enables the comparison of both Rx Mailbox filters IDE and
                                                     RTR bit with their corresponding bits within the incoming
                                                     frame. Mask bits do apply.                                                */
} CAN0_CTRL2_EACEN_Enum;

/* =============================================  CAN0 CAN0_CTRL2 RRS [17..17]  ============================================== */
typedef enum {                                  /*!< CAN0_CTRL2_RRS                                                            */
  CAN0_CTRL2_RRS_0                     = 0,     /*!< 0 : Remote Response Frame is generated.                                   */
  CAN0_CTRL2_RRS_1                     = 1,     /*!< 1 : Remote Request Frame is stored.                                       */
} CAN0_CTRL2_RRS_Enum;

/* =============================================  CAN0 CAN0_CTRL2 MRP [18..18]  ============================================== */
typedef enum {                                  /*!< CAN0_CTRL2_MRP                                                            */
  CAN0_CTRL2_MRP_0                     = 0,     /*!< 0 : Matching starts from Rx FIFO and continues on Mailboxes.              */
  CAN0_CTRL2_MRP_1                     = 1,     /*!< 1 : Matching starts from Mailboxes and continues on Rx FIFO.              */
} CAN0_CTRL2_MRP_Enum;

/* =========================================  CAN0 CAN0_CTRL2 BOFFDONEMSK [30..30]  ========================================== */
typedef enum {                                  /*!< CAN0_CTRL2_BOFFDONEMSK                                                    */
  CAN0_CTRL2_BOFFDONEMSK_0             = 0,     /*!< 0 : Bus Off Done interrupt disabled.                                      */
  CAN0_CTRL2_BOFFDONEMSK_1             = 1,     /*!< 1 : Bus Off Done interrupt enabled.                                       */
} CAN0_CTRL2_BOFFDONEMSK_Enum;

/* =========================================  CAN0 CAN0_CTRL2 ERRMSK_FAST [31..31]  ========================================== */
typedef enum {                                  /*!< CAN0_CTRL2_ERRMSK_FAST                                                    */
  CAN0_CTRL2_ERRMSK_FAST_0             = 0,     /*!< 0 : ERRINT_FAST Error interrupt disabled.                                 */
  CAN0_CTRL2_ERRMSK_FAST_1             = 1,     /*!< 1 : ERRINT_FAST Error interrupt enabled.                                  */
} CAN0_CTRL2_ERRMSK_FAST_Enum;

