nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =======================================================  CAN0_ESR2  ======================================================= */
/* ==============================================  CAN0 CAN0_ESR2 IMB [13..13]  ============================================== */
typedef enum {                                  /*!< CAN0_ESR2_IMB                                                             */
  CAN0_ESR2_IMB_0                      = 0,     /*!< 0 : If ESR2[VPS] is asserted, the ESR2[LPTM] is not an inactive
                                                     Mailbox.                                                                  */
  CAN0_ESR2_IMB_1                      = 1,     /*!< 1 : If ESR2[VPS] is asserted, there is at least one inactive
                                                     Mailbox. LPTM content is the number of the first one.                     */
} CAN0_ESR2_IMB_Enum;

/* ==============================================  CAN0 CAN0_ESR2 VPS [14..14]  ============================================== */
typedef enum {                                  /*!< CAN0_ESR2_VPS                                                             */
  CAN0_ESR2_VPS_0                      = 0,     /*!< 0 : Contents of IMB and LPTM are invalid.                                 */
  CAN0_ESR2_VPS_1                      = 1,     /*!< 1 : Contents of IMB and LPTM are valid.                                   */
} CAN0_ESR2_VPS_Enum;

/* =======================================================  CAN0_CRCR  ======================================================= */
/* =====================================================  CAN0_RXFGMASK  ===================================================== */
/* ======================================================  CAN0_RXFIR  ======================================================= */
/* =======================================================  CAN0_CBT  ======================================================== */
/* ==============================================  CAN0 CAN0_CBT BTF [31..31]  =============================================== */
typedef enum {                                  /*!< CAN0_CBT_BTF                                                              */
  CAN0_CBT_BTF_0                       = 0,     /*!< 0 : Extended bit time definitions disabled.                               */
  CAN0_CBT_BTF_1                       = 1,     /*!< 1 : Extended bit time definitions enabled.                                */
} CAN0_CBT_BTF_Enum;

/* ======================================================  CAN0_RAMn0  ======================================================= */
/* ======================================================  CAN0_RAMn1  ======================================================= */
/* ======================================================  CAN0_RAMn2  ======================================================= */
/* ======================================================  CAN0_RAMn3  ======================================================= */
/* ======================================================  CAN0_RAMn4  ======================================================= */
/* ======================================================  CAN0_RAMn5  ======================================================= */
/* ======================================================  CAN0_RAMn6  ======================================================= */
/* ======================================================  CAN0_RAMn7  ======================================================= */
/* ======================================================  CAN0_RAMn8  ======================================================= */
/* ======================================================  CAN0_RAMn9  ======================================================= */
/* ======================================================  CAN0_RAMn10  ====================================================== */
/* ======================================================  CAN0_RAMn11  ====================================================== */
/* ======================================================  CAN0_RAMn12  ====================================================== */
/* ======================================================  CAN0_RAMn13  ====================================================== */
/* ======================================================  CAN0_RAMn14  ====================================================== */
/* ======================================================  CAN0_RAMn15  ====================================================== */
/* ======================================================  CAN0_RAMn16  ====================================================== */
/* ======================================================  CAN0_RAMn17  ====================================================== */
/* ======================================================  CAN0_RAMn18  ====================================================== */
/* ======================================================  CAN0_RAMn19  ====================================================== */
/* ======================================================  CAN0_RAMn20  ====================================================== */
/* ======================================================  CAN0_RAMn21  ====================================================== */
/* ======================================================  CAN0_RAMn22  ====================================================== */
/* ======================================================  CAN0_RAMn23  ====================================================== */
/* ======================================================  CAN0_RAMn24  ====================================================== */
/* ======================================================  CAN0_RAMn25  ====================================================== */
/* ======================================================  CAN0_RAMn26  ====================================================== */
/* ======================================================  CAN0_RAMn27  ====================================================== */
/* ======================================================  CAN0_RAMn28  ====================================================== */
/* ======================================================  CAN0_RAMn29  ====================================================== */
/* ======================================================  CAN0_RAMn30  ====================================================== */
/* ======================================================  CAN0_RAMn31  ====================================================== */
/* ======================================================  CAN0_RAMn32  ====================================================== */
/* ======================================================  CAN0_RAMn33  ====================================================== */
/* ======================================================  CAN0_RAMn34  ====================================================== */
/* ======================================================  CAN0_RAMn35  ====================================================== */
/* ======================================================  CAN0_RAMn36  ====================================================== */
/* ======================================================  CAN0_RAMn37  ====================================================== */
/* ======================================================  CAN0_RAMn38  ====================================================== */
/* ======================================================  CAN0_RAMn39  ====================================================== */
/* ======================================================  CAN0_RAMn40  ====================================================== */
/* ======================================================  CAN0_RAMn41  ====================================================== */
/* ======================================================  CAN0_RAMn42  ====================================================== */
/* ======================================================  CAN0_RAMn43  ====================================================== */
/* ======================================================  CAN0_RAMn44  ====================================================== */
/* ======================================================  CAN0_RAMn45  ====================================================== */
/* ======================================================  CAN0_RAMn46  ====================================================== */
/* ======================================================  CAN0_RAMn47  ====================================================== */
/* ======================================================  CAN0_RAMn48  ====================================================== */
/* ======================================================  CAN0_RAMn49  ====================================================== */
/* ======================================================  CAN0_RAMn50  ====================================================== */
/* ======================================================  CAN0_RAMn51  ====================================================== */
/* ======================================================  CAN0_RAMn52  ====================================================== */
/* ======================================================  CAN0_RAMn53  ====================================================== */
/* ======================================================  CAN0_RAMn54  ====================================================== */
/* ======================================================  CAN0_RAMn55  ====================================================== */
/* ======================================================  CAN0_RAMn56  ====================================================== */
/* ======================================================  CAN0_RAMn57  ====================================================== */
/* ======================================================  CAN0_RAMn58  ====================================================== */
/* ======================================================  CAN0_RAMn59  ====================================================== */
/* ======================================================  CAN0_RAMn60  ====================================================== */
/* ======================================================  CAN0_RAMn61  ====================================================== */
/* ======================================================  CAN0_RAMn62  ====================================================== */
/* ======================================================  CAN0_RAMn63  ====================================================== */
/* ======================================================  CAN0_RAMn64  ====================================================== */
/* ======================================================  CAN0_RAMn65  ====================================================== */
/* ======================================================  CAN0_RAMn66  ====================================================== */
/* ======================================================  CAN0_RAMn67  ====================================================== */
/* ======================================================  CAN0_RAMn68  ====================================================== */
/* ======================================================  CAN0_RAMn69  ====================================================== */
/* ======================================================  CAN0_RAMn70  ====================================================== */
/* ======================================================  CAN0_RAMn71  ====================================================== */
/* ======================================================  CAN0_RAMn72  ====================================================== */
/* ======================================================  CAN0_RAMn73  ====================================================== */
/* ======================================================  CAN0_RAMn74  ====================================================== */
/* ======================================================  CAN0_RAMn75  ====================================================== */
/* ======================================================  CAN0_RAMn76  ====================================================== */
/* ======================================================  CAN0_RAMn77  ====================================================== */
/* ======================================================  CAN0_RAMn78  ====================================================== */
/* ======================================================  CAN0_RAMn79  ====================================================== */
/* ======================================================  CAN0_RAMn80  ====================================================== */
/* ======================================================  CAN0_RAMn81  ====================================================== */
/* ======================================================  CAN0_RAMn82  ====================================================== */
/* ======================================================  CAN0_RAMn83  ====================================================== */
/* ======================================================  CAN0_RAMn84  ====================================================== */
/* ======================================================  CAN0_RAMn85  ====================================================== */
/* ======================================================  CAN0_RAMn86  ====================================================== */
/* ======================================================  CAN0_RAMn87  ====================================================== */
/* ======================================================  CAN0_RAMn88  ====================================================== */
/* ======================================================  CAN0_RAMn89  ====================================================== */
/* ======================================================  CAN0_RAMn90  ====================================================== */
/* ======================================================  CAN0_RAMn91  ====================================================== */
/* ======================================================  CAN0_RAMn92  ====================================================== */
/* ======================================================  CAN0_RAMn93  ====================================================== */
/* ======================================================  CAN0_RAMn94  ====================================================== */
/* ======================================================  CAN0_RAMn95  ====================================================== */
/* ======================================================  CAN0_RAMn96  ====================================================== */
/* ======================================================  CAN0_RAMn97  ====================================================== */
/* ======================================================  CAN0_RAMn98  ====================================================== */
/* ======================================================  CAN0_RAMn99  ====================================================== */
/* =====================================================  CAN0_RAMn100  ====================================================== */
/* =====================================================  CAN0_RAMn101  ====================================================== */
/* =====================================================  CAN0_RAMn102  ====================================================== */
/* =====================================================  CAN0_RAMn103  ====================================================== */
/* =====================================================  CAN0_RAMn104  ====================================================== */
/* =====================================================  CAN0_RAMn105  ====================================================== */
/* =====================================================  CAN0_RAMn106  ====================================================== */
/* =====================================================  CAN0_RAMn107  ====================================================== */
/* =====================================================  CAN0_RAMn108  ====================================================== */
/* =====================================================  CAN0_RAMn109  ====================================================== */
/* =====================================================  CAN0_RAMn110  ====================================================== */
/* =====================================================  CAN0_RAMn111  ====================================================== */
/* =====================================================  CAN0_RAMn112  ====================================================== */
/* =====================================================  CAN0_RAMn113  ====================================================== */
/* =====================================================  CAN0_RAMn114  ====================================================== */
/* =====================================================  CAN0_RAMn115  ====================================================== */
/* =====================================================  CAN0_RAMn116  ====================================================== */
/* =====================================================  CAN0_RAMn117  ====================================================== */
/* =====================================================  CAN0_RAMn118  ====================================================== */
/* =====================================================  CAN0_RAMn119  ====================================================== */
/* =====================================================  CAN0_RAMn120  ====================================================== */
/* =====================================================  CAN0_RAMn121  ====================================================== */
/* =====================================================  CAN0_RAMn122  ====================================================== */
/* =====================================================  CAN0_RAMn123  ====================================================== */
/* =====================================================  CAN0_RAMn124  ====================================================== */
/* =====================================================  CAN0_RAMn125  ====================================================== */
/* =====================================================  CAN0_RAMn126  ====================================================== */
/* =====================================================  CAN0_RAMn127  ====================================================== */
/* ======================================================  CAN0_RXIMR0  ====================================================== */
/* ======================================================  CAN0_RXIMR1  ====================================================== */
/* ======================================================  CAN0_RXIMR2  ====================================================== */
/* ======================================================  CAN0_RXIMR3  ====================================================== */
/* ======================================================  CAN0_RXIMR4  ====================================================== */
/* ======================================================  CAN0_RXIMR5  ====================================================== */
/* ======================================================  CAN0_RXIMR6  ====================================================== */
/* ======================================================  CAN0_RXIMR7  ====================================================== */
/* ======================================================  CAN0_RXIMR8  ====================================================== */
/* ======================================================  CAN0_RXIMR9  ====================================================== */
/* =====================================================  CAN0_RXIMR10  ====================================================== */
/* =====================================================  CAN0_RXIMR11  ====================================================== */
/* =====================================================  CAN0_RXIMR12  ====================================================== */
/* =====================================================  CAN0_RXIMR13  ====================================================== */
/* =====================================================  CAN0_RXIMR14  ====================================================== */
/* =====================================================  CAN0_RXIMR15  ====================================================== */
/* =====================================================  CAN0_RXIMR16  ====================================================== */
/* =====================================================  CAN0_RXIMR17  ====================================================== */
/* =====================================================  CAN0_RXIMR18  ====================================================== */
/* =====================================================  CAN0_RXIMR19  ====================================================== */
/* =====================================================  CAN0_RXIMR20  ====================================================== */
/* =====================================================  CAN0_RXIMR21  ====================================================== */
/* =====================================================  CAN0_RXIMR22  ====================================================== */
/* =====================================================  CAN0_RXIMR23  ====================================================== */
/* =====================================================  CAN0_RXIMR24  ====================================================== */
/* =====================================================  CAN0_RXIMR25  ====================================================== */
/* =====================================================  CAN0_RXIMR26  ====================================================== */
/* =====================================================  CAN0_RXIMR27  ====================================================== */
/* =====================================================  CAN0_RXIMR28  ====================================================== */
/* =====================================================  CAN0_RXIMR29  ====================================================== */
/* =====================================================  CAN0_RXIMR30  ====================================================== */
/* =====================================================  CAN0_RXIMR31  ====================================================== */
/* =====================================================  CAN0_CTRL1_PN  ===================================================== */
/* =============================================  CAN0 CAN0_CTRL1_PN FCS [0..1]  ============================================= */
typedef enum {                                  /*!< CAN0_CTRL1_PN_FCS                                                         */
  CAN0_CTRL1_PN_FCS_00                 = 0,     /*!< 00 : Message ID filtering only                                            */
  CAN0_CTRL1_PN_FCS_01                 = 1,     /*!< 01 : Message ID filtering and payload filtering                           */
