nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==========================================  CAN0 CAN0_FLT_ID1 FLT_IDE [30..30]  =========================================== */
typedef enum {                                  /*!< CAN0_FLT_ID1_FLT_IDE                                                      */
  CAN0_FLT_ID1_FLT_IDE_0               = 0,     /*!< 0 : Accept standard frame format                                          */
  CAN0_FLT_ID1_FLT_IDE_1               = 1,     /*!< 1 : Accept extended frame format                                          */
} CAN0_FLT_ID1_FLT_IDE_Enum;

/* =====================================================  CAN0_FLT_DLC  ====================================================== */
/* ======================================================  CAN0_PL1_LO  ====================================================== */
/* ======================================================  CAN0_PL1_HI  ====================================================== */
/* ==================================================  CAN0_FLT_ID2_IDMASK  ================================================== */
/* =======================================  CAN0 CAN0_FLT_ID2_IDMASK RTR_MSK [29..29]  ======================================= */
typedef enum {                                  /*!< CAN0_FLT_ID2_IDMASK_RTR_MSK                                               */
  CAN0_FLT_ID2_IDMASK_RTR_MSK_0        = 0,     /*!< 0 : The corresponding bit in the filter is 'dont care'                    */
  CAN0_FLT_ID2_IDMASK_RTR_MSK_1        = 1,     /*!< 1 : The corresponding bit in the filter is checked                        */
} CAN0_FLT_ID2_IDMASK_RTR_MSK_Enum;

/* =======================================  CAN0 CAN0_FLT_ID2_IDMASK IDE_MSK [30..30]  ======================================= */
typedef enum {                                  /*!< CAN0_FLT_ID2_IDMASK_IDE_MSK                                               */
  CAN0_FLT_ID2_IDMASK_IDE_MSK_0        = 0,     /*!< 0 : The corresponding bit in the filter is 'dont care'                    */
  CAN0_FLT_ID2_IDMASK_IDE_MSK_1        = 1,     /*!< 1 : The corresponding bit in the filter is checked                        */
} CAN0_FLT_ID2_IDMASK_IDE_MSK_Enum;

/* ==================================================  CAN0_PL2_PLMASK_LO  =================================================== */
/* ==================================================  CAN0_PL2_PLMASK_HI  =================================================== */
/* =====================================================  CAN0_WMB0_CS  ====================================================== */
/* ============================================  CAN0 CAN0_WMB0_CS RTR [20..20]  ============================================= */
typedef enum {                                  /*!< CAN0_WMB0_CS_RTR                                                          */
  CAN0_WMB0_CS_RTR_0                   = 0,     /*!< 0 : Frame is data one (not remote)                                        */
  CAN0_WMB0_CS_RTR_1                   = 1,     /*!< 1 : Frame is a remote one                                                 */
} CAN0_WMB0_CS_RTR_Enum;

/* ============================================  CAN0 CAN0_WMB0_CS IDE [21..21]  ============================================= */
typedef enum {                                  /*!< CAN0_WMB0_CS_IDE                                                          */
  CAN0_WMB0_CS_IDE_0                   = 0,     /*!< 0 : Frame format is standard                                              */
  CAN0_WMB0_CS_IDE_1                   = 1,     /*!< 1 : Frame format is extended                                              */
} CAN0_WMB0_CS_IDE_Enum;

/* =====================================================  CAN0_WMB0_ID  ====================================================== */
/* =====================================================  CAN0_WMB0_D03  ===================================================== */
/* =====================================================  CAN0_WMB0_D47  ===================================================== */
/* =====================================================  CAN0_WMB1_CS  ====================================================== */
/* ============================================  CAN0 CAN0_WMB1_CS RTR [20..20]  ============================================= */
typedef enum {                                  /*!< CAN0_WMB1_CS_RTR                                                          */
  CAN0_WMB1_CS_RTR_0                   = 0,     /*!< 0 : Frame is data one (not remote)                                        */
  CAN0_WMB1_CS_RTR_1                   = 1,     /*!< 1 : Frame is a remote one                                                 */
} CAN0_WMB1_CS_RTR_Enum;

/* ============================================  CAN0 CAN0_WMB1_CS IDE [21..21]  ============================================= */
typedef enum {                                  /*!< CAN0_WMB1_CS_IDE                                                          */
  CAN0_WMB1_CS_IDE_0                   = 0,     /*!< 0 : Frame format is standard                                              */
  CAN0_WMB1_CS_IDE_1                   = 1,     /*!< 1 : Frame format is extended                                              */
} CAN0_WMB1_CS_IDE_Enum;

/* =====================================================  CAN0_WMB1_ID  ====================================================== */
/* =====================================================  CAN0_WMB1_D03  ===================================================== */
/* =====================================================  CAN0_WMB1_D47  ===================================================== */
/* =====================================================  CAN0_WMB2_CS  ====================================================== */
/* ============================================  CAN0 CAN0_WMB2_CS RTR [20..20]  ============================================= */
typedef enum {                                  /*!< CAN0_WMB2_CS_RTR                                                          */
  CAN0_WMB2_CS_RTR_0                   = 0,     /*!< 0 : Frame is data one (not remote)                                        */
  CAN0_WMB2_CS_RTR_1                   = 1,     /*!< 1 : Frame is a remote one                                                 */
} CAN0_WMB2_CS_RTR_Enum;

