nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  CAN0 CAN0_WMB2_CS IDE [21..21]  ============================================= */
typedef enum {                                  /*!< CAN0_WMB2_CS_IDE                                                          */
  CAN0_WMB2_CS_IDE_0                   = 0,     /*!< 0 : Frame format is standard                                              */
  CAN0_WMB2_CS_IDE_1                   = 1,     /*!< 1 : Frame format is extended                                              */
} CAN0_WMB2_CS_IDE_Enum;

/* =====================================================  CAN0_WMB2_ID  ====================================================== */
/* =====================================================  CAN0_WMB2_D03  ===================================================== */
/* =====================================================  CAN0_WMB2_D47  ===================================================== */
/* =====================================================  CAN0_WMB3_CS  ====================================================== */
/* ============================================  CAN0 CAN0_WMB3_CS RTR [20..20]  ============================================= */
typedef enum {                                  /*!< CAN0_WMB3_CS_RTR                                                          */
  CAN0_WMB3_CS_RTR_0                   = 0,     /*!< 0 : Frame is data one (not remote)                                        */
  CAN0_WMB3_CS_RTR_1                   = 1,     /*!< 1 : Frame is a remote one                                                 */
} CAN0_WMB3_CS_RTR_Enum;

/* ============================================  CAN0 CAN0_WMB3_CS IDE [21..21]  ============================================= */
typedef enum {                                  /*!< CAN0_WMB3_CS_IDE                                                          */
  CAN0_WMB3_CS_IDE_0                   = 0,     /*!< 0 : Frame format is standard                                              */
  CAN0_WMB3_CS_IDE_1                   = 1,     /*!< 1 : Frame format is extended                                              */
} CAN0_WMB3_CS_IDE_Enum;

/* =====================================================  CAN0_WMB3_ID  ====================================================== */
/* =====================================================  CAN0_WMB3_D03  ===================================================== */
/* =====================================================  CAN0_WMB3_D47  ===================================================== */
/* ======================================================  CAN0_FDCTRL  ====================================================== */
/* ===========================================  CAN0 CAN0_FDCTRL TDCFAIL [14..14]  =========================================== */
typedef enum {                                  /*!< CAN0_FDCTRL_TDCFAIL                                                       */
  CAN0_FDCTRL_TDCFAIL_0                = 0,     /*!< 0 : Measured loop delay is in range.                                      */
  CAN0_FDCTRL_TDCFAIL_1                = 1,     /*!< 1 : Measured loop delay is out of range.                                  */
} CAN0_FDCTRL_TDCFAIL_Enum;

/* ============================================  CAN0 CAN0_FDCTRL TDCEN [15..15]  ============================================ */
typedef enum {                                  /*!< CAN0_FDCTRL_TDCEN                                                         */
  CAN0_FDCTRL_TDCEN_0                  = 0,     /*!< 0 : TDC is disabled                                                       */
  CAN0_FDCTRL_TDCEN_1                  = 1,     /*!< 1 : TDC is enabled                                                        */
} CAN0_FDCTRL_TDCEN_Enum;

/* ===========================================  CAN0 CAN0_FDCTRL MBDSR0 [16..17]  ============================================ */
typedef enum {                                  /*!< CAN0_FDCTRL_MBDSR0                                                        */
  CAN0_FDCTRL_MBDSR0_00                = 0,     /*!< 00 : Selects 8 bytes per Message Buffer.                                  */
  CAN0_FDCTRL_MBDSR0_01                = 1,     /*!< 01 : Selects 16 bytes per Message Buffer.                                 */
  CAN0_FDCTRL_MBDSR0_10                = 2,     /*!< 10 : Selects 32 bytes per Message Buffer.                                 */
  CAN0_FDCTRL_MBDSR0_11                = 3,     /*!< 11 : Selects 64 bytes per Message Buffer.                                 */
} CAN0_FDCTRL_MBDSR0_Enum;

/* ===========================================  CAN0 CAN0_FDCTRL FDRATE [31..31]  ============================================ */
typedef enum {                                  /*!< CAN0_FDCTRL_FDRATE                                                        */
  CAN0_FDCTRL_FDRATE_0                 = 0,     /*!< 0 : Transmit a frame in nominal rate. The BRS bit in the Tx
                                                     MB has no effect.                                                         */
  CAN0_FDCTRL_FDRATE_1                 = 1,     /*!< 1 : Transmit a frame with bit rate switching if the BRS bit
                                                     in the Tx MB is recessive.                                                */
} CAN0_FDCTRL_FDRATE_Enum;

/* ======================================================  CAN0_FDCBT  ======================================================= */
/* ======================================================  CAN0_FDCRC  ======================================================= */


/* =========================================================================================================================== */
/* ================                                          LPSPI0                                           ================ */
/* =========================================================================================================================== */

