nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =====================================================  LPSPI0_VERID  ====================================================== */
/* ==========================================  LPSPI0 LPSPI0_VERID FEATURE [0..15]  ========================================== */
typedef enum {                                  /*!< LPSPI0_VERID_FEATURE                                                      */
  LPSPI0_VERID_FEATURE_0000000000000100 = 4,    /*!< 0000000000000100 : Standard feature set supporting 32-bit shift
                                                     register.                                                                 */
} LPSPI0_VERID_FEATURE_Enum;

/* =====================================================  LPSPI0_PARAM  ====================================================== */
/* =======================================================  LPSPI0_CR  ======================================================= */
/* ==============================================  LPSPI0 LPSPI0_CR MEN [0..0]  ============================================== */
typedef enum {                                  /*!< LPSPI0_CR_MEN                                                             */
  LPSPI0_CR_MEN_0                      = 0,     /*!< 0 : Module is disabled.                                                   */
  LPSPI0_CR_MEN_1                      = 1,     /*!< 1 : Module is enabled.                                                    */
} LPSPI0_CR_MEN_Enum;

/* ==============================================  LPSPI0 LPSPI0_CR RST [1..1]  ============================================== */
typedef enum {                                  /*!< LPSPI0_CR_RST                                                             */
  LPSPI0_CR_RST_0                      = 0,     /*!< 0 : Master logic is not reset.                                            */
  LPSPI0_CR_RST_1                      = 1,     /*!< 1 : Master logic is reset.                                                */
} LPSPI0_CR_RST_Enum;

/* =============================================  LPSPI0 LPSPI0_CR DOZEN [2..2]  ============================================= */
typedef enum {                                  /*!< LPSPI0_CR_DOZEN                                                           */
  LPSPI0_CR_DOZEN_0                    = 0,     /*!< 0 : Module is enabled in Doze mode.                                       */
  LPSPI0_CR_DOZEN_1                    = 1,     /*!< 1 : Module is disabled in Doze mode.                                      */
} LPSPI0_CR_DOZEN_Enum;

/* =============================================  LPSPI0 LPSPI0_CR DBGEN [3..3]  ============================================= */
typedef enum {                                  /*!< LPSPI0_CR_DBGEN                                                           */
  LPSPI0_CR_DBGEN_0                    = 0,     /*!< 0 : Module is disabled in debug mode.                                     */
  LPSPI0_CR_DBGEN_1                    = 1,     /*!< 1 : Module is enabled in debug mode.                                      */
} LPSPI0_CR_DBGEN_Enum;

/* ==============================================  LPSPI0 LPSPI0_CR RTF [8..8]  ============================================== */
typedef enum {                                  /*!< LPSPI0_CR_RTF                                                             */
  LPSPI0_CR_RTF_0                      = 0,     /*!< 0 : No effect.                                                            */
  LPSPI0_CR_RTF_1                      = 1,     /*!< 1 : Transmit FIFO is reset.                                               */
} LPSPI0_CR_RTF_Enum;

/* ==============================================  LPSPI0 LPSPI0_CR RRF [9..9]  ============================================== */
typedef enum {                                  /*!< LPSPI0_CR_RRF                                                             */
  LPSPI0_CR_RRF_0                      = 0,     /*!< 0 : No effect.                                                            */
  LPSPI0_CR_RRF_1                      = 1,     /*!< 1 : Receive FIFO is reset.                                                */
} LPSPI0_CR_RRF_Enum;

/* =======================================================  LPSPI0_SR  ======================================================= */
/* ==============================================  LPSPI0 LPSPI0_SR TDF [0..0]  ============================================== */
typedef enum {                                  /*!< LPSPI0_SR_TDF                                                             */
  LPSPI0_SR_TDF_0                      = 0,     /*!< 0 : Transmit data not requested.                                          */
  LPSPI0_SR_TDF_1                      = 1,     /*!< 1 : Transmit data is requested.                                           */
} LPSPI0_SR_TDF_Enum;

/* ==============================================  LPSPI0 LPSPI0_SR RDF [1..1]  ============================================== */
typedef enum {                                  /*!< LPSPI0_SR_RDF                                                             */
  LPSPI0_SR_RDF_0                      = 0,     /*!< 0 : Receive Data is not ready.                                            */
  LPSPI0_SR_RDF_1                      = 1,     /*!< 1 : Receive data is ready.                                                */
} LPSPI0_SR_RDF_Enum;

/* ==============================================  LPSPI0 LPSPI0_SR WCF [8..8]  ============================================== */
typedef enum {                                  /*!< LPSPI0_SR_WCF                                                             */
  LPSPI0_SR_WCF_0                      = 0,     /*!< 0 : Transfer word not completed.                                          */
  LPSPI0_SR_WCF_1                      = 1,     /*!< 1 : Transfer word completed.                                              */
} LPSPI0_SR_WCF_Enum;

/* ==============================================  LPSPI0 LPSPI0_SR FCF [9..9]  ============================================== */
typedef enum {                                  /*!< LPSPI0_SR_FCF                                                             */
  LPSPI0_SR_FCF_0                      = 0,     /*!< 0 : Frame transfer has not completed.                                     */
  LPSPI0_SR_FCF_1                      = 1,     /*!< 1 : Frame transfer has completed.                                         */
} LPSPI0_SR_FCF_Enum;

/* =============================================  LPSPI0 LPSPI0_SR TCF [10..10]  ============================================= */
typedef enum {                                  /*!< LPSPI0_SR_TCF                                                             */
  LPSPI0_SR_TCF_0                      = 0,     /*!< 0 : All transfers have not completed.                                     */
  LPSPI0_SR_TCF_1                      = 1,     /*!< 1 : All transfers have completed.                                         */
} LPSPI0_SR_TCF_Enum;

/* =============================================  LPSPI0 LPSPI0_SR TEF [11..11]  ============================================= */
typedef enum {                                  /*!< LPSPI0_SR_TEF                                                             */
  LPSPI0_SR_TEF_0                      = 0,     /*!< 0 : Transmit FIFO underrun has not occurred.                              */
  LPSPI0_SR_TEF_1                      = 1,     /*!< 1 : Transmit FIFO underrun has occurred                                   */
} LPSPI0_SR_TEF_Enum;

/* =============================================  LPSPI0 LPSPI0_SR REF [12..12]  ============================================= */
typedef enum {                                  /*!< LPSPI0_SR_REF                                                             */
  LPSPI0_SR_REF_0                      = 0,     /*!< 0 : Receive FIFO has not overflowed.                                      */
  LPSPI0_SR_REF_1                      = 1,     /*!< 1 : Receive FIFO has overflowed.                                          */
} LPSPI0_SR_REF_Enum;

/* =============================================  LPSPI0 LPSPI0_SR DMF [13..13]  ============================================= */
typedef enum {                                  /*!< LPSPI0_SR_DMF                                                             */
  LPSPI0_SR_DMF_0                      = 0,     /*!< 0 : Have not received matching data.                                      */
  LPSPI0_SR_DMF_1                      = 1,     /*!< 1 : Have received matching data.                                          */
} LPSPI0_SR_DMF_Enum;

/* =============================================  LPSPI0 LPSPI0_SR MBF [24..24]  ============================================= */
typedef enum {                                  /*!< LPSPI0_SR_MBF                                                             */
  LPSPI0_SR_MBF_0                      = 0,     /*!< 0 : LPSPI is idle.                                                        */
  LPSPI0_SR_MBF_1                      = 1,     /*!< 1 : LPSPI is busy.                                                        */
} LPSPI0_SR_MBF_Enum;

/* ======================================================  LPSPI0_IER  ======================================================= */
/* =============================================  LPSPI0 LPSPI0_IER TDIE [0..0]  ============================================= */
typedef enum {                                  /*!< LPSPI0_IER_TDIE                                                           */
  LPSPI0_IER_TDIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI0_IER_TDIE_1                    = 1,     /*!< 1 : Interrupt enabled                                                     */
} LPSPI0_IER_TDIE_Enum;

/* =============================================  LPSPI0 LPSPI0_IER RDIE [1..1]  ============================================= */
typedef enum {                                  /*!< LPSPI0_IER_RDIE                                                           */
  LPSPI0_IER_RDIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI0_IER_RDIE_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPSPI0_IER_RDIE_Enum;

