nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  LPSPI0 LPSPI0_IER WCIE [8..8]  ============================================= */
typedef enum {                                  /*!< LPSPI0_IER_WCIE                                                           */
  LPSPI0_IER_WCIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI0_IER_WCIE_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPSPI0_IER_WCIE_Enum;

/* =============================================  LPSPI0 LPSPI0_IER FCIE [9..9]  ============================================= */
typedef enum {                                  /*!< LPSPI0_IER_FCIE                                                           */
  LPSPI0_IER_FCIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI0_IER_FCIE_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPSPI0_IER_FCIE_Enum;

/* ============================================  LPSPI0 LPSPI0_IER TCIE [10..10]  ============================================ */
typedef enum {                                  /*!< LPSPI0_IER_TCIE                                                           */
  LPSPI0_IER_TCIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI0_IER_TCIE_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPSPI0_IER_TCIE_Enum;

/* ============================================  LPSPI0 LPSPI0_IER TEIE [11..11]  ============================================ */
typedef enum {                                  /*!< LPSPI0_IER_TEIE                                                           */
  LPSPI0_IER_TEIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI0_IER_TEIE_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPSPI0_IER_TEIE_Enum;

/* ============================================  LPSPI0 LPSPI0_IER REIE [12..12]  ============================================ */
typedef enum {                                  /*!< LPSPI0_IER_REIE                                                           */
  LPSPI0_IER_REIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI0_IER_REIE_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPSPI0_IER_REIE_Enum;

/* ============================================  LPSPI0 LPSPI0_IER DMIE [13..13]  ============================================ */
typedef enum {                                  /*!< LPSPI0_IER_DMIE                                                           */
  LPSPI0_IER_DMIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI0_IER_DMIE_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPSPI0_IER_DMIE_Enum;

/* ======================================================  LPSPI0_DER  ======================================================= */
/* =============================================  LPSPI0 LPSPI0_DER TDDE [0..0]  ============================================= */
typedef enum {                                  /*!< LPSPI0_DER_TDDE                                                           */
  LPSPI0_DER_TDDE_0                    = 0,     /*!< 0 : DMA request disabled.                                                 */
  LPSPI0_DER_TDDE_1                    = 1,     /*!< 1 : DMA request enabled                                                   */
} LPSPI0_DER_TDDE_Enum;

/* =============================================  LPSPI0 LPSPI0_DER RDDE [1..1]  ============================================= */
typedef enum {                                  /*!< LPSPI0_DER_RDDE                                                           */
  LPSPI0_DER_RDDE_0                    = 0,     /*!< 0 : DMA request disabled.                                                 */
  LPSPI0_DER_RDDE_1                    = 1,     /*!< 1 : DMA request enabled.                                                  */
} LPSPI0_DER_RDDE_Enum;

/* =====================================================  LPSPI0_CFGR0  ====================================================== */
/* ============================================  LPSPI0 LPSPI0_CFGR0 HREN [0..0]  ============================================ */
typedef enum {                                  /*!< LPSPI0_CFGR0_HREN                                                         */
  LPSPI0_CFGR0_HREN_0                  = 0,     /*!< 0 : Host request is disabled.                                             */
  LPSPI0_CFGR0_HREN_1                  = 1,     /*!< 1 : Host request is enabled.                                              */
} LPSPI0_CFGR0_HREN_Enum;

/* ===========================================  LPSPI0 LPSPI0_CFGR0 HRPOL [1..1]  ============================================ */
typedef enum {                                  /*!< LPSPI0_CFGR0_HRPOL                                                        */
  LPSPI0_CFGR0_HRPOL_0                 = 0,     /*!< 0 : Active low.                                                           */
  LPSPI0_CFGR0_HRPOL_1                 = 1,     /*!< 1 : Active high.                                                          */
} LPSPI0_CFGR0_HRPOL_Enum;

/* ===========================================  LPSPI0 LPSPI0_CFGR0 HRSEL [2..2]  ============================================ */
typedef enum {                                  /*!< LPSPI0_CFGR0_HRSEL                                                        */
  LPSPI0_CFGR0_HRSEL_0                 = 0,     /*!< 0 : Host request input is pin LPSPI_HREQ.                                 */
  LPSPI0_CFGR0_HRSEL_1                 = 1,     /*!< 1 : Host request input is input trigger.                                  */
} LPSPI0_CFGR0_HRSEL_Enum;

