nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==========================================  LPSPI0 LPSPI0_CFGR1 OUTCFG [26..26]  ========================================== */
typedef enum {                                  /*!< LPSPI0_CFGR1_OUTCFG                                                       */
  LPSPI0_CFGR1_OUTCFG_0                = 0,     /*!< 0 : Output data retains last value when chip select is negated.           */
  LPSPI0_CFGR1_OUTCFG_1                = 1,     /*!< 1 : Output data is tristated when chip select is negated.                 */
} LPSPI0_CFGR1_OUTCFG_Enum;

/* ==========================================  LPSPI0 LPSPI0_CFGR1 PCSCFG [27..27]  ========================================== */
typedef enum {                                  /*!< LPSPI0_CFGR1_PCSCFG                                                       */
  LPSPI0_CFGR1_PCSCFG_0                = 0,     /*!< 0 : PCS[3:2] are enabled.                                                 */
  LPSPI0_CFGR1_PCSCFG_1                = 1,     /*!< 1 : PCS[3:2] are disabled.                                                */
} LPSPI0_CFGR1_PCSCFG_Enum;

/* ======================================================  LPSPI0_DMR0  ====================================================== */
/* ======================================================  LPSPI0_DMR1  ====================================================== */
/* ======================================================  LPSPI0_CCR  ======================================================= */
/* ======================================================  LPSPI0_FCR  ======================================================= */
/* ======================================================  LPSPI0_FSR  ======================================================= */
/* ======================================================  LPSPI0_TCR  ======================================================= */
/* ===========================================  LPSPI0 LPSPI0_TCR WIDTH [16..17]  ============================================ */
typedef enum {                                  /*!< LPSPI0_TCR_WIDTH                                                          */
  LPSPI0_TCR_WIDTH_00                  = 0,     /*!< 00 : Single bit transfer.                                                 */
  LPSPI0_TCR_WIDTH_01                  = 1,     /*!< 01 : Two bit transfer.                                                    */
  LPSPI0_TCR_WIDTH_10                  = 2,     /*!< 10 : Four bit transfer.                                                   */
} LPSPI0_TCR_WIDTH_Enum;

/* ===========================================  LPSPI0 LPSPI0_TCR TXMSK [18..18]  ============================================ */
typedef enum {                                  /*!< LPSPI0_TCR_TXMSK                                                          */
  LPSPI0_TCR_TXMSK_0                   = 0,     /*!< 0 : Normal transfer.                                                      */
  LPSPI0_TCR_TXMSK_1                   = 1,     /*!< 1 : Mask transmit data.                                                   */
} LPSPI0_TCR_TXMSK_Enum;

/* ===========================================  LPSPI0 LPSPI0_TCR RXMSK [19..19]  ============================================ */
typedef enum {                                  /*!< LPSPI0_TCR_RXMSK                                                          */
  LPSPI0_TCR_RXMSK_0                   = 0,     /*!< 0 : Normal transfer.                                                      */
  LPSPI0_TCR_RXMSK_1                   = 1,     /*!< 1 : Receive data is masked.                                               */
} LPSPI0_TCR_RXMSK_Enum;

/* ===========================================  LPSPI0 LPSPI0_TCR CONTC [20..20]  ============================================ */
typedef enum {                                  /*!< LPSPI0_TCR_CONTC                                                          */
  LPSPI0_TCR_CONTC_0                   = 0,     /*!< 0 : Command word for start of new transfer.                               */
  LPSPI0_TCR_CONTC_1                   = 1,     /*!< 1 : Command word for continuing transfer.                                 */
} LPSPI0_TCR_CONTC_Enum;

/* ============================================  LPSPI0 LPSPI0_TCR CONT [21..21]  ============================================ */
typedef enum {                                  /*!< LPSPI0_TCR_CONT                                                           */
  LPSPI0_TCR_CONT_0                    = 0,     /*!< 0 : Continuous transfer disabled.                                         */
  LPSPI0_TCR_CONT_1                    = 1,     /*!< 1 : Continuous transfer enabled.                                          */
} LPSPI0_TCR_CONT_Enum;

/* ============================================  LPSPI0 LPSPI0_TCR BYSW [22..22]  ============================================ */
typedef enum {                                  /*!< LPSPI0_TCR_BYSW                                                           */
  LPSPI0_TCR_BYSW_0                    = 0,     /*!< 0 : Byte swap disabled.                                                   */
  LPSPI0_TCR_BYSW_1                    = 1,     /*!< 1 : Byte swap enabled.                                                    */
} LPSPI0_TCR_BYSW_Enum;

/* ============================================  LPSPI0 LPSPI0_TCR LSBF [23..23]  ============================================ */
typedef enum {                                  /*!< LPSPI0_TCR_LSBF                                                           */
  LPSPI0_TCR_LSBF_0                    = 0,     /*!< 0 : Data is transferred MSB first.                                        */
  LPSPI0_TCR_LSBF_1                    = 1,     /*!< 1 : Data is transferred LSB first.                                        */
} LPSPI0_TCR_LSBF_Enum;

/* ============================================  LPSPI0 LPSPI0_TCR PCS [24..25]  ============================================= */
typedef enum {                                  /*!< LPSPI0_TCR_PCS                                                            */
  LPSPI0_TCR_PCS_00                    = 0,     /*!< 00 : Transfer using LPSPI_PCS[0]                                          */
  LPSPI0_TCR_PCS_01                    = 1,     /*!< 01 : Transfer using LPSPI_PCS[1]                                          */
  LPSPI0_TCR_PCS_10                    = 2,     /*!< 10 : Transfer using LPSPI_PCS[2]                                          */
  LPSPI0_TCR_PCS_11                    = 3,     /*!< 11 : Transfer using LPSPI_PCS[3]                                          */
} LPSPI0_TCR_PCS_Enum;

/* ==========================================  LPSPI0 LPSPI0_TCR PRESCALE [27..29]  ========================================== */
typedef enum {                                  /*!< LPSPI0_TCR_PRESCALE                                                       */
  LPSPI0_TCR_PRESCALE_000              = 0,     /*!< 000 : Divide by 1.                                                        */
  LPSPI0_TCR_PRESCALE_001              = 1,     /*!< 001 : Divide by 2.                                                        */
  LPSPI0_TCR_PRESCALE_010              = 2,     /*!< 010 : Divide by 4.                                                        */
  LPSPI0_TCR_PRESCALE_011              = 3,     /*!< 011 : Divide by 8.                                                        */
  LPSPI0_TCR_PRESCALE_100              = 4,     /*!< 100 : Divide by 16.                                                       */
  LPSPI0_TCR_PRESCALE_101              = 5,     /*!< 101 : Divide by 32.                                                       */
  LPSPI0_TCR_PRESCALE_110              = 6,     /*!< 110 : Divide by 64.                                                       */
  LPSPI0_TCR_PRESCALE_111              = 7,     /*!< 111 : Divide by 128.                                                      */
} LPSPI0_TCR_PRESCALE_Enum;

/* ============================================  LPSPI0 LPSPI0_TCR CPHA [30..30]  ============================================ */
typedef enum {                                  /*!< LPSPI0_TCR_CPHA                                                           */
  LPSPI0_TCR_CPHA_0                    = 0,     /*!< 0 : Data is captured on the leading edge of SCK and changed
                                                     on the following edge.                                                    */
  LPSPI0_TCR_CPHA_1                    = 1,     /*!< 1 : Data is changed on the leading edge of SCK and captured
                                                     on the following edge.                                                    */
} LPSPI0_TCR_CPHA_Enum;

/* ============================================  LPSPI0 LPSPI0_TCR CPOL [31..31]  ============================================ */
typedef enum {                                  /*!< LPSPI0_TCR_CPOL                                                           */
  LPSPI0_TCR_CPOL_0                    = 0,     /*!< 0 : The inactive state value of SCK is low.                               */
  LPSPI0_TCR_CPOL_1                    = 1,     /*!< 1 : The inactive state value of SCK is high.                              */
} LPSPI0_TCR_CPOL_Enum;

/* ======================================================  LPSPI0_TDR  ======================================================= */
/* ======================================================  LPSPI0_RSR  ======================================================= */
/* =============================================  LPSPI0 LPSPI0_RSR SOF [0..0]  ============================================== */
typedef enum {                                  /*!< LPSPI0_RSR_SOF                                                            */
  LPSPI0_RSR_SOF_0                     = 0,     /*!< 0 : Subsequent data word received after LPSPI_PCS assertion.              */
  LPSPI0_RSR_SOF_1                     = 1,     /*!< 1 : First data word received after LPSPI_PCS assertion.                   */
} LPSPI0_RSR_SOF_Enum;

/* ===========================================  LPSPI0 LPSPI0_RSR RXEMPTY [1..1]  ============================================ */
typedef enum {                                  /*!< LPSPI0_RSR_RXEMPTY                                                        */
  LPSPI0_RSR_RXEMPTY_0                 = 0,     /*!< 0 : RX FIFO is not empty.                                                 */
  LPSPI0_RSR_RXEMPTY_1                 = 1,     /*!< 1 : RX FIFO is empty.                                                     */
} LPSPI0_RSR_RXEMPTY_Enum;

/* ======================================================  LPSPI0_RDR  ======================================================= */


/* =========================================================================================================================== */
/* ================                                          LPSPI1                                           ================ */
/* =========================================================================================================================== */

/* =====================================================  LPSPI1_VERID  ====================================================== */
/* ==========================================  LPSPI1 LPSPI1_VERID FEATURE [0..15]  ========================================== */
typedef enum {                                  /*!< LPSPI1_VERID_FEATURE                                                      */
  LPSPI1_VERID_FEATURE_0000000000000100 = 4,    /*!< 0000000000000100 : Standard feature set supporting 32-bit shift
                                                     register.                                                                 */
} LPSPI1_VERID_FEATURE_Enum;

/* =====================================================  LPSPI1_PARAM  ====================================================== */
/* =======================================================  LPSPI1_CR  ======================================================= */
/* ==============================================  LPSPI1 LPSPI1_CR MEN [0..0]  ============================================== */
typedef enum {                                  /*!< LPSPI1_CR_MEN                                                             */
  LPSPI1_CR_MEN_0                      = 0,     /*!< 0 : Module is disabled.                                                   */
  LPSPI1_CR_MEN_1                      = 1,     /*!< 1 : Module is enabled.                                                    */
} LPSPI1_CR_MEN_Enum;

/* ==============================================  LPSPI1 LPSPI1_CR RST [1..1]  ============================================== */
typedef enum {                                  /*!< LPSPI1_CR_RST                                                             */
  LPSPI1_CR_RST_0                      = 0,     /*!< 0 : Master logic is not reset.                                            */
  LPSPI1_CR_RST_1                      = 1,     /*!< 1 : Master logic is reset.                                                */
} LPSPI1_CR_RST_Enum;

/* =============================================  LPSPI1 LPSPI1_CR DOZEN [2..2]  ============================================= */
typedef enum {                                  /*!< LPSPI1_CR_DOZEN                                                           */
  LPSPI1_CR_DOZEN_0                    = 0,     /*!< 0 : Module is enabled in Doze mode.                                       */
  LPSPI1_CR_DOZEN_1                    = 1,     /*!< 1 : Module is disabled in Doze mode.                                      */
} LPSPI1_CR_DOZEN_Enum;

/* =============================================  LPSPI1 LPSPI1_CR DBGEN [3..3]  ============================================= */
typedef enum {                                  /*!< LPSPI1_CR_DBGEN                                                           */
  LPSPI1_CR_DBGEN_0                    = 0,     /*!< 0 : Module is disabled in debug mode.                                     */
  LPSPI1_CR_DBGEN_1                    = 1,     /*!< 1 : Module is enabled in debug mode.                                      */
} LPSPI1_CR_DBGEN_Enum;

