nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  LPSPI1 LPSPI1_CR RTF [8..8]  ============================================== */
typedef enum {                                  /*!< LPSPI1_CR_RTF                                                             */
  LPSPI1_CR_RTF_0                      = 0,     /*!< 0 : No effect.                                                            */
  LPSPI1_CR_RTF_1                      = 1,     /*!< 1 : Transmit FIFO is reset.                                               */
} LPSPI1_CR_RTF_Enum;

/* ==============================================  LPSPI1 LPSPI1_CR RRF [9..9]  ============================================== */
typedef enum {                                  /*!< LPSPI1_CR_RRF                                                             */
  LPSPI1_CR_RRF_0                      = 0,     /*!< 0 : No effect.                                                            */
  LPSPI1_CR_RRF_1                      = 1,     /*!< 1 : Receive FIFO is reset.                                                */
} LPSPI1_CR_RRF_Enum;

/* =======================================================  LPSPI1_SR  ======================================================= */
/* ==============================================  LPSPI1 LPSPI1_SR TDF [0..0]  ============================================== */
typedef enum {                                  /*!< LPSPI1_SR_TDF                                                             */
  LPSPI1_SR_TDF_0                      = 0,     /*!< 0 : Transmit data not requested.                                          */
  LPSPI1_SR_TDF_1                      = 1,     /*!< 1 : Transmit data is requested.                                           */
} LPSPI1_SR_TDF_Enum;

/* ==============================================  LPSPI1 LPSPI1_SR RDF [1..1]  ============================================== */
typedef enum {                                  /*!< LPSPI1_SR_RDF                                                             */
  LPSPI1_SR_RDF_0                      = 0,     /*!< 0 : Receive Data is not ready.                                            */
  LPSPI1_SR_RDF_1                      = 1,     /*!< 1 : Receive data is ready.                                                */
} LPSPI1_SR_RDF_Enum;

/* ==============================================  LPSPI1 LPSPI1_SR WCF [8..8]  ============================================== */
typedef enum {                                  /*!< LPSPI1_SR_WCF                                                             */
  LPSPI1_SR_WCF_0                      = 0,     /*!< 0 : Transfer word not completed.                                          */
  LPSPI1_SR_WCF_1                      = 1,     /*!< 1 : Transfer word completed.                                              */
} LPSPI1_SR_WCF_Enum;

/* ==============================================  LPSPI1 LPSPI1_SR FCF [9..9]  ============================================== */
typedef enum {                                  /*!< LPSPI1_SR_FCF                                                             */
  LPSPI1_SR_FCF_0                      = 0,     /*!< 0 : Frame transfer has not completed.                                     */
  LPSPI1_SR_FCF_1                      = 1,     /*!< 1 : Frame transfer has completed.                                         */
} LPSPI1_SR_FCF_Enum;

/* =============================================  LPSPI1 LPSPI1_SR TCF [10..10]  ============================================= */
typedef enum {                                  /*!< LPSPI1_SR_TCF                                                             */
  LPSPI1_SR_TCF_0                      = 0,     /*!< 0 : All transfers have not completed.                                     */
  LPSPI1_SR_TCF_1                      = 1,     /*!< 1 : All transfers have completed.                                         */
} LPSPI1_SR_TCF_Enum;

/* =============================================  LPSPI1 LPSPI1_SR TEF [11..11]  ============================================= */
typedef enum {                                  /*!< LPSPI1_SR_TEF                                                             */
  LPSPI1_SR_TEF_0                      = 0,     /*!< 0 : Transmit FIFO underrun has not occurred.                              */
  LPSPI1_SR_TEF_1                      = 1,     /*!< 1 : Transmit FIFO underrun has occurred                                   */
} LPSPI1_SR_TEF_Enum;

/* =============================================  LPSPI1 LPSPI1_SR REF [12..12]  ============================================= */
typedef enum {                                  /*!< LPSPI1_SR_REF                                                             */
  LPSPI1_SR_REF_0                      = 0,     /*!< 0 : Receive FIFO has not overflowed.                                      */
  LPSPI1_SR_REF_1                      = 1,     /*!< 1 : Receive FIFO has overflowed.                                          */
} LPSPI1_SR_REF_Enum;

/* =============================================  LPSPI1 LPSPI1_SR DMF [13..13]  ============================================= */
typedef enum {                                  /*!< LPSPI1_SR_DMF                                                             */
  LPSPI1_SR_DMF_0                      = 0,     /*!< 0 : Have not received matching data.                                      */
  LPSPI1_SR_DMF_1                      = 1,     /*!< 1 : Have received matching data.                                          */
} LPSPI1_SR_DMF_Enum;

/* =============================================  LPSPI1 LPSPI1_SR MBF [24..24]  ============================================= */
typedef enum {                                  /*!< LPSPI1_SR_MBF                                                             */
  LPSPI1_SR_MBF_0                      = 0,     /*!< 0 : LPSPI is idle.                                                        */
  LPSPI1_SR_MBF_1                      = 1,     /*!< 1 : LPSPI is busy.                                                        */
} LPSPI1_SR_MBF_Enum;

