nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  LPSPI1_IER  ======================================================= */
/* =============================================  LPSPI1 LPSPI1_IER TDIE [0..0]  ============================================= */
typedef enum {                                  /*!< LPSPI1_IER_TDIE                                                           */
  LPSPI1_IER_TDIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI1_IER_TDIE_1                    = 1,     /*!< 1 : Interrupt enabled                                                     */
} LPSPI1_IER_TDIE_Enum;

/* =============================================  LPSPI1 LPSPI1_IER RDIE [1..1]  ============================================= */
typedef enum {                                  /*!< LPSPI1_IER_RDIE                                                           */
  LPSPI1_IER_RDIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI1_IER_RDIE_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPSPI1_IER_RDIE_Enum;

/* =============================================  LPSPI1 LPSPI1_IER WCIE [8..8]  ============================================= */
typedef enum {                                  /*!< LPSPI1_IER_WCIE                                                           */
  LPSPI1_IER_WCIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI1_IER_WCIE_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPSPI1_IER_WCIE_Enum;

/* =============================================  LPSPI1 LPSPI1_IER FCIE [9..9]  ============================================= */
typedef enum {                                  /*!< LPSPI1_IER_FCIE                                                           */
  LPSPI1_IER_FCIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI1_IER_FCIE_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPSPI1_IER_FCIE_Enum;

/* ============================================  LPSPI1 LPSPI1_IER TCIE [10..10]  ============================================ */
typedef enum {                                  /*!< LPSPI1_IER_TCIE                                                           */
  LPSPI1_IER_TCIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI1_IER_TCIE_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPSPI1_IER_TCIE_Enum;

/* ============================================  LPSPI1 LPSPI1_IER TEIE [11..11]  ============================================ */
typedef enum {                                  /*!< LPSPI1_IER_TEIE                                                           */
  LPSPI1_IER_TEIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI1_IER_TEIE_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPSPI1_IER_TEIE_Enum;

/* ============================================  LPSPI1 LPSPI1_IER REIE [12..12]  ============================================ */
typedef enum {                                  /*!< LPSPI1_IER_REIE                                                           */
  LPSPI1_IER_REIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI1_IER_REIE_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPSPI1_IER_REIE_Enum;

/* ============================================  LPSPI1 LPSPI1_IER DMIE [13..13]  ============================================ */
typedef enum {                                  /*!< LPSPI1_IER_DMIE                                                           */
  LPSPI1_IER_DMIE_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPSPI1_IER_DMIE_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPSPI1_IER_DMIE_Enum;

/* ======================================================  LPSPI1_DER  ======================================================= */
/* =============================================  LPSPI1 LPSPI1_DER TDDE [0..0]  ============================================= */
typedef enum {                                  /*!< LPSPI1_DER_TDDE                                                           */
  LPSPI1_DER_TDDE_0                    = 0,     /*!< 0 : DMA request disabled.                                                 */
  LPSPI1_DER_TDDE_1                    = 1,     /*!< 1 : DMA request enabled                                                   */
} LPSPI1_DER_TDDE_Enum;

/* =============================================  LPSPI1 LPSPI1_DER RDDE [1..1]  ============================================= */
typedef enum {                                  /*!< LPSPI1_DER_RDDE                                                           */
  LPSPI1_DER_RDDE_0                    = 0,     /*!< 0 : DMA request disabled.                                                 */
  LPSPI1_DER_RDDE_1                    = 1,     /*!< 1 : DMA request enabled.                                                  */
} LPSPI1_DER_RDDE_Enum;

/* =====================================================  LPSPI1_CFGR0  ====================================================== */
/* ============================================  LPSPI1 LPSPI1_CFGR0 HREN [0..0]  ============================================ */
typedef enum {                                  /*!< LPSPI1_CFGR0_HREN                                                         */
  LPSPI1_CFGR0_HREN_0                  = 0,     /*!< 0 : Host request is disabled.                                             */
  LPSPI1_CFGR0_HREN_1                  = 1,     /*!< 1 : Host request is enabled.                                              */
} LPSPI1_CFGR0_HREN_Enum;

/* ===========================================  LPSPI1 LPSPI1_CFGR0 HRPOL [1..1]  ============================================ */
typedef enum {                                  /*!< LPSPI1_CFGR0_HRPOL                                                        */
  LPSPI1_CFGR0_HRPOL_0                 = 0,     /*!< 0 : Active low.                                                           */
  LPSPI1_CFGR0_HRPOL_1                 = 1,     /*!< 1 : Active high.                                                          */
} LPSPI1_CFGR0_HRPOL_Enum;

/* ===========================================  LPSPI1 LPSPI1_CFGR0 HRSEL [2..2]  ============================================ */
typedef enum {                                  /*!< LPSPI1_CFGR0_HRSEL                                                        */
  LPSPI1_CFGR0_HRSEL_0                 = 0,     /*!< 0 : Host request input is pin LPSPI_HREQ.                                 */
  LPSPI1_CFGR0_HRSEL_1                 = 1,     /*!< 1 : Host request input is input trigger.                                  */
} LPSPI1_CFGR0_HRSEL_Enum;

/* ==========================================  LPSPI1 LPSPI1_CFGR0 CIRFIFO [8..8]  =========================================== */
typedef enum {                                  /*!< LPSPI1_CFGR0_CIRFIFO                                                      */
  LPSPI1_CFGR0_CIRFIFO_0               = 0,     /*!< 0 : Circular FIFO is disabled.                                            */
  LPSPI1_CFGR0_CIRFIFO_1               = 1,     /*!< 1 : Circular FIFO is enabled.                                             */
} LPSPI1_CFGR0_CIRFIFO_Enum;

/* ============================================  LPSPI1 LPSPI1_CFGR0 RDMO [9..9]  ============================================ */
typedef enum {                                  /*!< LPSPI1_CFGR0_RDMO                                                         */
  LPSPI1_CFGR0_RDMO_0                  = 0,     /*!< 0 : Received data is stored in the receive FIFO as normal.                */
  LPSPI1_CFGR0_RDMO_1                  = 1,     /*!< 1 : Received data is discarded unless the DMF is set.                     */
} LPSPI1_CFGR0_RDMO_Enum;

/* =====================================================  LPSPI1_CFGR1  ====================================================== */
/* ===========================================  LPSPI1 LPSPI1_CFGR1 MASTER [0..0]  =========================================== */
typedef enum {                                  /*!< LPSPI1_CFGR1_MASTER                                                       */
  LPSPI1_CFGR1_MASTER_0                = 0,     /*!< 0 : Slave mode.                                                           */
  LPSPI1_CFGR1_MASTER_1                = 1,     /*!< 1 : Master mode.                                                          */
} LPSPI1_CFGR1_MASTER_Enum;

/* ===========================================  LPSPI1 LPSPI1_CFGR1 SAMPLE [1..1]  =========================================== */
typedef enum {                                  /*!< LPSPI1_CFGR1_SAMPLE                                                       */
  LPSPI1_CFGR1_SAMPLE_0                = 0,     /*!< 0 : Input data sampled on SCK edge.                                       */
  LPSPI1_CFGR1_SAMPLE_1                = 1,     /*!< 1 : Input data sampled on delayed SCK edge.                               */
} LPSPI1_CFGR1_SAMPLE_Enum;

/* ==========================================  LPSPI1 LPSPI1_CFGR1 AUTOPCS [2..2]  =========================================== */
typedef enum {                                  /*!< LPSPI1_CFGR1_AUTOPCS                                                      */
  LPSPI1_CFGR1_AUTOPCS_0               = 0,     /*!< 0 : Automatic PCS generation disabled.                                    */
  LPSPI1_CFGR1_AUTOPCS_1               = 1,     /*!< 1 : Automatic PCS generation enabled.                                     */
} LPSPI1_CFGR1_AUTOPCS_Enum;

