nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==========================================  LPSPI1 LPSPI1_CFGR1 NOSTALL [3..3]  =========================================== */
typedef enum {                                  /*!< LPSPI1_CFGR1_NOSTALL                                                      */
  LPSPI1_CFGR1_NOSTALL_0               = 0,     /*!< 0 : Transfers will stall when transmit FIFO is empty or receive
                                                     FIFO is full.                                                             */
  LPSPI1_CFGR1_NOSTALL_1               = 1,     /*!< 1 : Transfers will not stall, allowing transmit FIFO underrun
                                                     or receive FIFO overrun to occur.                                         */
} LPSPI1_CFGR1_NOSTALL_Enum;

/* ==========================================  LPSPI1 LPSPI1_CFGR1 PCSPOL [8..11]  =========================================== */
typedef enum {                                  /*!< LPSPI1_CFGR1_PCSPOL                                                       */
  LPSPI1_CFGR1_PCSPOL_0000             = 0,     /*!< 0000 : The PCSx is active low.                                            */
  LPSPI1_CFGR1_PCSPOL_0001             = 1,     /*!< 0001 : The PCSx is active high.                                           */
} LPSPI1_CFGR1_PCSPOL_Enum;

/* ==========================================  LPSPI1 LPSPI1_CFGR1 MATCFG [16..18]  ========================================== */
typedef enum {                                  /*!< LPSPI1_CFGR1_MATCFG                                                       */
  LPSPI1_CFGR1_MATCFG_000              = 0,     /*!< 000 : Match is disabled.                                                  */
  LPSPI1_CFGR1_MATCFG_010              = 2,     /*!< 010 : 010b - Match is enabled, if 1st data word equals MATCH0
                                                     OR MATCH1, i.e., (1st data word = MATCH0 + MATCH1)                        */
  LPSPI1_CFGR1_MATCFG_011              = 3,     /*!< 011 : 011b - Match is enabled, if any data word equals MATCH0
                                                     OR MATCH1, i.e., (any data word = MATCH0 + MATCH1)                        */
  LPSPI1_CFGR1_MATCFG_100              = 4,     /*!< 100 : 100b - Match is enabled, if 1st data word equals MATCH0
                                                     AND 2nd data word equals MATCH1, i.e., [(1st data word
                                                     = MATCH0) * (2nd data word = MATCH1)]                                     */
  LPSPI1_CFGR1_MATCFG_101              = 5,     /*!< 101 : 101b - Match is enabled, if any data word equals MATCH0
                                                     AND the next data word equals MATCH1, i.e., [(any data
                                                     word = MATCH0) * (next data word = MATCH1)]                               */
  LPSPI1_CFGR1_MATCFG_110              = 6,     /*!< 110 : 110b - Match is enabled, if (1st data word AND MATCH1)
                                                     equals (MATCH0 AND MATCH1), i.e., [(1st data word * MATCH1)
                                                     = (MATCH0 * MATCH1)]                                                      */
  LPSPI1_CFGR1_MATCFG_111              = 7,     /*!< 111 : 111b - Match is enabled, if (any data word AND MATCH1)
                                                     equals (MATCH0 AND MATCH1), i.e., [(any data word * MATCH1)
                                                     = (MATCH0 * MATCH1)]                                                      */
} LPSPI1_CFGR1_MATCFG_Enum;

/* ==========================================  LPSPI1 LPSPI1_CFGR1 PINCFG [24..25]  ========================================== */
typedef enum {                                  /*!< LPSPI1_CFGR1_PINCFG                                                       */
  LPSPI1_CFGR1_PINCFG_00               = 0,     /*!< 00 : SIN is used for input data and SOUT for output data.                 */
  LPSPI1_CFGR1_PINCFG_01               = 1,     /*!< 01 : SIN is used for both input and output data.                          */
  LPSPI1_CFGR1_PINCFG_10               = 2,     /*!< 10 : SOUT is used for both input and output data.                         */
  LPSPI1_CFGR1_PINCFG_11               = 3,     /*!< 11 : SOUT is used for input data and SIN for output data.                 */
} LPSPI1_CFGR1_PINCFG_Enum;

/* ==========================================  LPSPI1 LPSPI1_CFGR1 OUTCFG [26..26]  ========================================== */
typedef enum {                                  /*!< LPSPI1_CFGR1_OUTCFG                                                       */
  LPSPI1_CFGR1_OUTCFG_0                = 0,     /*!< 0 : Output data retains last value when chip select is negated.           */
  LPSPI1_CFGR1_OUTCFG_1                = 1,     /*!< 1 : Output data is tristated when chip select is negated.                 */
} LPSPI1_CFGR1_OUTCFG_Enum;

/* ==========================================  LPSPI1 LPSPI1_CFGR1 PCSCFG [27..27]  ========================================== */
typedef enum {                                  /*!< LPSPI1_CFGR1_PCSCFG                                                       */
  LPSPI1_CFGR1_PCSCFG_0                = 0,     /*!< 0 : PCS[3:2] are enabled.                                                 */
  LPSPI1_CFGR1_PCSCFG_1                = 1,     /*!< 1 : PCS[3:2] are disabled.                                                */
} LPSPI1_CFGR1_PCSCFG_Enum;

/* ======================================================  LPSPI1_DMR0  ====================================================== */
/* ======================================================  LPSPI1_DMR1  ====================================================== */
/* ======================================================  LPSPI1_CCR  ======================================================= */
/* ======================================================  LPSPI1_FCR  ======================================================= */
/* ======================================================  LPSPI1_FSR  ======================================================= */
/* ======================================================  LPSPI1_TCR  ======================================================= */
/* ===========================================  LPSPI1 LPSPI1_TCR WIDTH [16..17]  ============================================ */
typedef enum {                                  /*!< LPSPI1_TCR_WIDTH                                                          */
  LPSPI1_TCR_WIDTH_00                  = 0,     /*!< 00 : Single bit transfer.                                                 */
  LPSPI1_TCR_WIDTH_01                  = 1,     /*!< 01 : Two bit transfer.                                                    */
  LPSPI1_TCR_WIDTH_10                  = 2,     /*!< 10 : Four bit transfer.                                                   */
} LPSPI1_TCR_WIDTH_Enum;

/* ===========================================  LPSPI1 LPSPI1_TCR TXMSK [18..18]  ============================================ */
typedef enum {                                  /*!< LPSPI1_TCR_TXMSK                                                          */
  LPSPI1_TCR_TXMSK_0                   = 0,     /*!< 0 : Normal transfer.                                                      */
  LPSPI1_TCR_TXMSK_1                   = 1,     /*!< 1 : Mask transmit data.                                                   */
} LPSPI1_TCR_TXMSK_Enum;

/* ===========================================  LPSPI1 LPSPI1_TCR RXMSK [19..19]  ============================================ */
typedef enum {                                  /*!< LPSPI1_TCR_RXMSK                                                          */
  LPSPI1_TCR_RXMSK_0                   = 0,     /*!< 0 : Normal transfer.                                                      */
  LPSPI1_TCR_RXMSK_1                   = 1,     /*!< 1 : Receive data is masked.                                               */
} LPSPI1_TCR_RXMSK_Enum;

/* ===========================================  LPSPI1 LPSPI1_TCR CONTC [20..20]  ============================================ */
typedef enum {                                  /*!< LPSPI1_TCR_CONTC                                                          */
  LPSPI1_TCR_CONTC_0                   = 0,     /*!< 0 : Command word for start of new transfer.                               */
  LPSPI1_TCR_CONTC_1                   = 1,     /*!< 1 : Command word for continuing transfer.                                 */
} LPSPI1_TCR_CONTC_Enum;

/* ============================================  LPSPI1 LPSPI1_TCR CONT [21..21]  ============================================ */
typedef enum {                                  /*!< LPSPI1_TCR_CONT                                                           */
  LPSPI1_TCR_CONT_0                    = 0,     /*!< 0 : Continuous transfer disabled.                                         */
  LPSPI1_TCR_CONT_1                    = 1,     /*!< 1 : Continuous transfer enabled.                                          */
} LPSPI1_TCR_CONT_Enum;

/* ============================================  LPSPI1 LPSPI1_TCR BYSW [22..22]  ============================================ */
typedef enum {                                  /*!< LPSPI1_TCR_BYSW                                                           */
  LPSPI1_TCR_BYSW_0                    = 0,     /*!< 0 : Byte swap disabled.                                                   */
  LPSPI1_TCR_BYSW_1                    = 1,     /*!< 1 : Byte swap enabled.                                                    */
} LPSPI1_TCR_BYSW_Enum;

