nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  LPSPI1 LPSPI1_TCR LSBF [23..23]  ============================================ */
typedef enum {                                  /*!< LPSPI1_TCR_LSBF                                                           */
  LPSPI1_TCR_LSBF_0                    = 0,     /*!< 0 : Data is transferred MSB first.                                        */
  LPSPI1_TCR_LSBF_1                    = 1,     /*!< 1 : Data is transferred LSB first.                                        */
} LPSPI1_TCR_LSBF_Enum;

/* ============================================  LPSPI1 LPSPI1_TCR PCS [24..25]  ============================================= */
typedef enum {                                  /*!< LPSPI1_TCR_PCS                                                            */
  LPSPI1_TCR_PCS_00                    = 0,     /*!< 00 : Transfer using LPSPI_PCS[0]                                          */
  LPSPI1_TCR_PCS_01                    = 1,     /*!< 01 : Transfer using LPSPI_PCS[1]                                          */
  LPSPI1_TCR_PCS_10                    = 2,     /*!< 10 : Transfer using LPSPI_PCS[2]                                          */
  LPSPI1_TCR_PCS_11                    = 3,     /*!< 11 : Transfer using LPSPI_PCS[3]                                          */
} LPSPI1_TCR_PCS_Enum;

/* ==========================================  LPSPI1 LPSPI1_TCR PRESCALE [27..29]  ========================================== */
typedef enum {                                  /*!< LPSPI1_TCR_PRESCALE                                                       */
  LPSPI1_TCR_PRESCALE_000              = 0,     /*!< 000 : Divide by 1.                                                        */
  LPSPI1_TCR_PRESCALE_001              = 1,     /*!< 001 : Divide by 2.                                                        */
  LPSPI1_TCR_PRESCALE_010              = 2,     /*!< 010 : Divide by 4.                                                        */
  LPSPI1_TCR_PRESCALE_011              = 3,     /*!< 011 : Divide by 8.                                                        */
  LPSPI1_TCR_PRESCALE_100              = 4,     /*!< 100 : Divide by 16.                                                       */
  LPSPI1_TCR_PRESCALE_101              = 5,     /*!< 101 : Divide by 32.                                                       */
  LPSPI1_TCR_PRESCALE_110              = 6,     /*!< 110 : Divide by 64.                                                       */
  LPSPI1_TCR_PRESCALE_111              = 7,     /*!< 111 : Divide by 128.                                                      */
} LPSPI1_TCR_PRESCALE_Enum;

/* ============================================  LPSPI1 LPSPI1_TCR CPHA [30..30]  ============================================ */
typedef enum {                                  /*!< LPSPI1_TCR_CPHA                                                           */
  LPSPI1_TCR_CPHA_0                    = 0,     /*!< 0 : Data is captured on the leading edge of SCK and changed
                                                     on the following edge.                                                    */
  LPSPI1_TCR_CPHA_1                    = 1,     /*!< 1 : Data is changed on the leading edge of SCK and captured
                                                     on the following edge.                                                    */
} LPSPI1_TCR_CPHA_Enum;

/* ============================================  LPSPI1 LPSPI1_TCR CPOL [31..31]  ============================================ */
typedef enum {                                  /*!< LPSPI1_TCR_CPOL                                                           */
  LPSPI1_TCR_CPOL_0                    = 0,     /*!< 0 : The inactive state value of SCK is low.                               */
  LPSPI1_TCR_CPOL_1                    = 1,     /*!< 1 : The inactive state value of SCK is high.                              */
} LPSPI1_TCR_CPOL_Enum;

/* ======================================================  LPSPI1_TDR  ======================================================= */
/* ======================================================  LPSPI1_RSR  ======================================================= */
/* =============================================  LPSPI1 LPSPI1_RSR SOF [0..0]  ============================================== */
typedef enum {                                  /*!< LPSPI1_RSR_SOF                                                            */
  LPSPI1_RSR_SOF_0                     = 0,     /*!< 0 : Subsequent data word received after LPSPI_PCS assertion.              */
  LPSPI1_RSR_SOF_1                     = 1,     /*!< 1 : First data word received after LPSPI_PCS assertion.                   */
} LPSPI1_RSR_SOF_Enum;

/* ===========================================  LPSPI1 LPSPI1_RSR RXEMPTY [1..1]  ============================================ */
typedef enum {                                  /*!< LPSPI1_RSR_RXEMPTY                                                        */
  LPSPI1_RSR_RXEMPTY_0                 = 0,     /*!< 0 : RX FIFO is not empty.                                                 */
  LPSPI1_RSR_RXEMPTY_1                 = 1,     /*!< 1 : RX FIFO is empty.                                                     */
} LPSPI1_RSR_RXEMPTY_Enum;

/* ======================================================  LPSPI1_RDR  ======================================================= */


/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */

/* =====================================================  CRC_DATA_CRC  ====================================================== */
/* =====================================================  CRC_DATAL_CRC  ===================================================== */
/* ====================================================  CRC_DATALL_CRC  ===================================================== */
/* ======================================================  CRC_DATALU  ======================================================= */
/* =====================================================  CRC_DATAH_CRC  ===================================================== */
/* ====================================================  CRC_DATAHL_CRC  ===================================================== */
/* ======================================================  CRC_DATAHU  ======================================================= */
/* =======================================================  CRC_GPOLY  ======================================================= */
/* =======================================================  CRC_CTRL  ======================================================== */
/* ==============================================  CRC CRC_CTRL TCRC [24..24]  =============================================== */
typedef enum {                                  /*!< CRC_CTRL_TCRC                                                             */
  CRC_CTRL_TCRC_0                      = 0,     /*!< 0 : 16-bit CRC protocol.                                                  */
  CRC_CTRL_TCRC_1                      = 1,     /*!< 1 : 32-bit CRC protocol.                                                  */
} CRC_CTRL_TCRC_Enum;

/* ===============================================  CRC CRC_CTRL WAS [25..25]  =============================================== */
typedef enum {                                  /*!< CRC_CTRL_WAS                                                              */
  CRC_CTRL_WAS_0                       = 0,     /*!< 0 : Writes to the CRC data register are data values.                      */
  CRC_CTRL_WAS_1                       = 1,     /*!< 1 : Writes to the CRC data register are seed values.                      */
} CRC_CTRL_WAS_Enum;

/* ==============================================  CRC CRC_CTRL FXOR [26..26]  =============================================== */
typedef enum {                                  /*!< CRC_CTRL_FXOR                                                             */
  CRC_CTRL_FXOR_0                      = 0,     /*!< 0 : No XOR on reading.                                                    */
  CRC_CTRL_FXOR_1                      = 1,     /*!< 1 : Invert or complement the read value of the CRC Data register.         */
} CRC_CTRL_FXOR_Enum;

/* ==============================================  CRC CRC_CTRL TOTR [28..29]  =============================================== */
typedef enum {                                  /*!< CRC_CTRL_TOTR                                                             */
  CRC_CTRL_TOTR_00                     = 0,     /*!< 00 : No transposition.                                                    */
  CRC_CTRL_TOTR_01                     = 1,     /*!< 01 : Bits in bytes are transposed; bytes are not transposed.              */
  CRC_CTRL_TOTR_10                     = 2,     /*!< 10 : Both bits in bytes and bytes are transposed.                         */
  CRC_CTRL_TOTR_11                     = 3,     /*!< 11 : Only bytes are transposed; no bits in a byte are transposed.         */
} CRC_CTRL_TOTR_Enum;

/* ===============================================  CRC CRC_CTRL TOT [30..31]  =============================================== */
typedef enum {                                  /*!< CRC_CTRL_TOT                                                              */
  CRC_CTRL_TOT_00                      = 0,     /*!< 00 : No transposition.                                                    */
  CRC_CTRL_TOT_01                      = 1,     /*!< 01 : Bits in bytes are transposed; bytes are not transposed.              */
  CRC_CTRL_TOT_10                      = 2,     /*!< 10 : Both bits in bytes and bytes are transposed.                         */
  CRC_CTRL_TOT_11                      = 3,     /*!< 11 : Only bytes are transposed; no bits in a byte are transposed.         */
} CRC_CTRL_TOT_Enum;



/* =========================================================================================================================== */
/* ================                                           PDB0                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  PDB0_SC  ======================================================== */
/* ===============================================  PDB0 PDB0_SC CONT [1..1]  ================================================ */
typedef enum {                                  /*!< PDB0_SC_CONT                                                              */
  PDB0_SC_CONT_0                       = 0,     /*!< 0 : PDB operation in One-Shot mode                                        */
  PDB0_SC_CONT_1                       = 1,     /*!< 1 : PDB operation in Continuous mode                                      */
} PDB0_SC_CONT_Enum;

