nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  LPIT0_VERID  ====================================================== */
/* ======================================================  LPIT0_PARAM  ====================================================== */
/* =======================================================  LPIT0_MCR  ======================================================= */
/* =============================================  LPIT0 LPIT0_MCR M_CEN [0..0]  ============================================== */
typedef enum {                                  /*!< LPIT0_MCR_M_CEN                                                           */
  LPIT0_MCR_M_CEN_0                    = 0,     /*!< 0 : Peripheral clock to timers is disabled                                */
  LPIT0_MCR_M_CEN_1                    = 1,     /*!< 1 : Peripheral clock to timers is enabled                                 */
} LPIT0_MCR_M_CEN_Enum;

/* =============================================  LPIT0 LPIT0_MCR SW_RST [1..1]  ============================================= */
typedef enum {                                  /*!< LPIT0_MCR_SW_RST                                                          */
  LPIT0_MCR_SW_RST_0                   = 0,     /*!< 0 : Timer channels and registers are not reset                            */
  LPIT0_MCR_SW_RST_1                   = 1,     /*!< 1 : Timer channels and registers are reset                                */
} LPIT0_MCR_SW_RST_Enum;

/* ============================================  LPIT0 LPIT0_MCR DOZE_EN [2..2]  ============================================= */
typedef enum {                                  /*!< LPIT0_MCR_DOZE_EN                                                         */
  LPIT0_MCR_DOZE_EN_0                  = 0,     /*!< 0 : Timer channels are stopped in DOZE mode                               */
  LPIT0_MCR_DOZE_EN_1                  = 1,     /*!< 1 : Timer channels continue to run in DOZE mode                           */
} LPIT0_MCR_DOZE_EN_Enum;

/* =============================================  LPIT0 LPIT0_MCR DBG_EN [3..3]  ============================================= */
typedef enum {                                  /*!< LPIT0_MCR_DBG_EN                                                          */
  LPIT0_MCR_DBG_EN_0                   = 0,     /*!< 0 : Timer channels are stopped in Debug mode                              */
  LPIT0_MCR_DBG_EN_1                   = 1,     /*!< 1 : Timer channels continue to run in Debug mode                          */
} LPIT0_MCR_DBG_EN_Enum;

/* =======================================================  LPIT0_MSR  ======================================================= */
/* ==============================================  LPIT0 LPIT0_MSR TIF0 [0..0]  ============================================== */
typedef enum {                                  /*!< LPIT0_MSR_TIF0                                                            */
  LPIT0_MSR_TIF0_0                     = 0,     /*!< 0 : Timer has not timed out                                               */
  LPIT0_MSR_TIF0_1                     = 1,     /*!< 1 : Timeout has occurred                                                  */
} LPIT0_MSR_TIF0_Enum;

/* ==============================================  LPIT0 LPIT0_MSR TIF1 [1..1]  ============================================== */
typedef enum {                                  /*!< LPIT0_MSR_TIF1                                                            */
  LPIT0_MSR_TIF1_0                     = 0,     /*!< 0 : Timer has not timed out                                               */
  LPIT0_MSR_TIF1_1                     = 1,     /*!< 1 : Timeout has occurred                                                  */
} LPIT0_MSR_TIF1_Enum;

/* ==============================================  LPIT0 LPIT0_MSR TIF2 [2..2]  ============================================== */
typedef enum {                                  /*!< LPIT0_MSR_TIF2                                                            */
  LPIT0_MSR_TIF2_0                     = 0,     /*!< 0 : Timer has not timed out                                               */
  LPIT0_MSR_TIF2_1                     = 1,     /*!< 1 : Timeout has occurred                                                  */
} LPIT0_MSR_TIF2_Enum;

/* ==============================================  LPIT0 LPIT0_MSR TIF3 [3..3]  ============================================== */
typedef enum {                                  /*!< LPIT0_MSR_TIF3                                                            */
  LPIT0_MSR_TIF3_0                     = 0,     /*!< 0 : Timer has not timed out                                               */
  LPIT0_MSR_TIF3_1                     = 1,     /*!< 1 : Timeout has occurred                                                  */
} LPIT0_MSR_TIF3_Enum;

/* ======================================================  LPIT0_MIER  ======================================================= */
/* =============================================  LPIT0 LPIT0_MIER TIE0 [0..0]  ============================================== */
typedef enum {                                  /*!< LPIT0_MIER_TIE0                                                           */
  LPIT0_MIER_TIE0_0                    = 0,     /*!< 0 : Interrupt generation is disabled                                      */
  LPIT0_MIER_TIE0_1                    = 1,     /*!< 1 : Interrupt generation is enabled                                       */
} LPIT0_MIER_TIE0_Enum;

/* =============================================  LPIT0 LPIT0_MIER TIE1 [1..1]  ============================================== */
typedef enum {                                  /*!< LPIT0_MIER_TIE1                                                           */
  LPIT0_MIER_TIE1_0                    = 0,     /*!< 0 : Interrupt generation is disabled                                      */
  LPIT0_MIER_TIE1_1                    = 1,     /*!< 1 : Interrupt generation is enabled                                       */
} LPIT0_MIER_TIE1_Enum;

/* =============================================  LPIT0 LPIT0_MIER TIE2 [2..2]  ============================================== */
typedef enum {                                  /*!< LPIT0_MIER_TIE2                                                           */
  LPIT0_MIER_TIE2_0                    = 0,     /*!< 0 : Interrupt generation is disabled                                      */
  LPIT0_MIER_TIE2_1                    = 1,     /*!< 1 : Interrupt generation is enabled                                       */
} LPIT0_MIER_TIE2_Enum;

/* =============================================  LPIT0 LPIT0_MIER TIE3 [3..3]  ============================================== */
typedef enum {                                  /*!< LPIT0_MIER_TIE3                                                           */
  LPIT0_MIER_TIE3_0                    = 0,     /*!< 0 : Interrupt generation is disabled                                      */
  LPIT0_MIER_TIE3_1                    = 1,     /*!< 1 : Interrupt generation is enabled                                       */
} LPIT0_MIER_TIE3_Enum;

