nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  FTM0 FTM0_STATUS CH6F [6..6]  ============================================== */
typedef enum {                                  /*!< FTM0_STATUS_CH6F                                                          */
  FTM0_STATUS_CH6F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM0_STATUS_CH6F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM0_STATUS_CH6F_Enum;

/* =============================================  FTM0 FTM0_STATUS CH7F [7..7]  ============================================== */
typedef enum {                                  /*!< FTM0_STATUS_CH7F                                                          */
  FTM0_STATUS_CH7F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM0_STATUS_CH7F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM0_STATUS_CH7F_Enum;

/* =======================================================  FTM0_MODE  ======================================================= */
/* ==============================================  FTM0 FTM0_MODE FTMEN [0..0]  ============================================== */
typedef enum {                                  /*!< FTM0_MODE_FTMEN                                                           */
  FTM0_MODE_FTMEN_0                    = 0,     /*!< 0 : TPM compatibility. Free running counter and synchronization
                                                     compatible with TPM.                                                      */
  FTM0_MODE_FTMEN_1                    = 1,     /*!< 1 : Free running counter and synchronization are different from
                                                     TPM behavior.                                                             */
} FTM0_MODE_FTMEN_Enum;

/* ==============================================  FTM0 FTM0_MODE WPDIS [2..2]  ============================================== */
typedef enum {                                  /*!< FTM0_MODE_WPDIS                                                           */
  FTM0_MODE_WPDIS_0                    = 0,     /*!< 0 : Write protection is enabled.                                          */
  FTM0_MODE_WPDIS_1                    = 1,     /*!< 1 : Write protection is disabled.                                         */
} FTM0_MODE_WPDIS_Enum;

/* =============================================  FTM0 FTM0_MODE PWMSYNC [3..3]  ============================================= */
typedef enum {                                  /*!< FTM0_MODE_PWMSYNC                                                         */
  FTM0_MODE_PWMSYNC_0                  = 0,     /*!< 0 : No restrictions. Software and hardware triggers can be used
                                                     by MOD, CnV, OUTMASK, and FTM counter synchronization.                    */
  FTM0_MODE_PWMSYNC_1                  = 1,     /*!< 1 : Software trigger can only be used by MOD and CnV synchronization,
                                                     and hardware triggers can only be used by OUTMASK and FTM
                                                     counter synchronization.                                                  */
} FTM0_MODE_PWMSYNC_Enum;

/* =============================================  FTM0 FTM0_MODE CAPTEST [4..4]  ============================================= */
typedef enum {                                  /*!< FTM0_MODE_CAPTEST                                                         */
  FTM0_MODE_CAPTEST_0                  = 0,     /*!< 0 : Capture test mode is disabled.                                        */
  FTM0_MODE_CAPTEST_1                  = 1,     /*!< 1 : Capture test mode is enabled.                                         */
} FTM0_MODE_CAPTEST_Enum;

/* =============================================  FTM0 FTM0_MODE FAULTM [5..6]  ============================================== */
typedef enum {                                  /*!< FTM0_MODE_FAULTM                                                          */
  FTM0_MODE_FAULTM_00                  = 0,     /*!< 00 : Fault control is disabled for all channels.                          */
  FTM0_MODE_FAULTM_01                  = 1,     /*!< 01 : Fault control is enabled for even channels only (channels
                                                     0, 2, 4, and 6), and the selected mode is the manual fault
                                                     clearing.                                                                 */
  FTM0_MODE_FAULTM_10                  = 2,     /*!< 10 : Fault control is enabled for all channels, and the selected
                                                     mode is the manual fault clearing.                                        */
  FTM0_MODE_FAULTM_11                  = 3,     /*!< 11 : Fault control is enabled for all channels, and the selected
                                                     mode is the automatic fault clearing.                                     */
} FTM0_MODE_FAULTM_Enum;

/* =============================================  FTM0 FTM0_MODE FAULTIE [7..7]  ============================================= */
typedef enum {                                  /*!< FTM0_MODE_FAULTIE                                                         */
  FTM0_MODE_FAULTIE_0                  = 0,     /*!< 0 : Fault control interrupt is disabled.                                  */
  FTM0_MODE_FAULTIE_1                  = 1,     /*!< 1 : Fault control interrupt is enabled.                                   */
} FTM0_MODE_FAULTIE_Enum;

/* =======================================================  FTM0_SYNC  ======================================================= */
/* =============================================  FTM0 FTM0_SYNC CNTMIN [0..0]  ============================================== */
typedef enum {                                  /*!< FTM0_SYNC_CNTMIN                                                          */
  FTM0_SYNC_CNTMIN_0                   = 0,     /*!< 0 : The minimum loading point is disabled.                                */
  FTM0_SYNC_CNTMIN_1                   = 1,     /*!< 1 : The minimum loading point is enabled.                                 */
} FTM0_SYNC_CNTMIN_Enum;

/* =============================================  FTM0 FTM0_SYNC CNTMAX [1..1]  ============================================== */
typedef enum {                                  /*!< FTM0_SYNC_CNTMAX                                                          */
  FTM0_SYNC_CNTMAX_0                   = 0,     /*!< 0 : The maximum loading point is disabled.                                */
  FTM0_SYNC_CNTMAX_1                   = 1,     /*!< 1 : The maximum loading point is enabled.                                 */
} FTM0_SYNC_CNTMAX_Enum;

/* =============================================  FTM0 FTM0_SYNC REINIT [2..2]  ============================================== */
typedef enum {                                  /*!< FTM0_SYNC_REINIT                                                          */
  FTM0_SYNC_REINIT_0                   = 0,     /*!< 0 : FTM counter continues to count normally.                              */
  FTM0_SYNC_REINIT_1                   = 1,     /*!< 1 : FTM counter is updated with its initial value when the selected
                                                     trigger is detected.                                                      */
} FTM0_SYNC_REINIT_Enum;

/* =============================================  FTM0 FTM0_SYNC SYNCHOM [3..3]  ============================================= */
typedef enum {                                  /*!< FTM0_SYNC_SYNCHOM                                                         */
  FTM0_SYNC_SYNCHOM_0                  = 0,     /*!< 0 : OUTMASK register is updated with the value of its buffer
                                                     in all rising edges of the FTM input clock.                               */
  FTM0_SYNC_SYNCHOM_1                  = 1,     /*!< 1 : OUTMASK register is updated with the value of its buffer
                                                     only by the PWM synchronization.                                          */
} FTM0_SYNC_SYNCHOM_Enum;

/* ==============================================  FTM0 FTM0_SYNC TRIG0 [4..4]  ============================================== */
typedef enum {                                  /*!< FTM0_SYNC_TRIG0                                                           */
  FTM0_SYNC_TRIG0_0                    = 0,     /*!< 0 : Trigger is disabled.                                                  */
  FTM0_SYNC_TRIG0_1                    = 1,     /*!< 1 : Trigger is enabled.                                                   */
} FTM0_SYNC_TRIG0_Enum;

