nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  FTM0 FTM0_COMBINE COMP1 [9..9]  ============================================= */
typedef enum {                                  /*!< FTM0_COMBINE_COMP1                                                        */
  FTM0_COMBINE_COMP1_0                 = 0,     /*!< 0 : The channel (n+1) output is the same as the channel (n)
                                                     output.                                                                   */
  FTM0_COMBINE_COMP1_1                 = 1,     /*!< 1 : The channel (n+1) output is the complement of the channel
                                                     (n) output.                                                               */
} FTM0_COMBINE_COMP1_Enum;

/* ===========================================  FTM0 FTM0_COMBINE DECAP1 [11..11]  =========================================== */
typedef enum {                                  /*!< FTM0_COMBINE_DECAP1                                                       */
  FTM0_COMBINE_DECAP1_0                = 0,     /*!< 0 : The dual edge captures are inactive.                                  */
  FTM0_COMBINE_DECAP1_1                = 1,     /*!< 1 : The dual edge captures are active.                                    */
} FTM0_COMBINE_DECAP1_Enum;

/* ===========================================  FTM0 FTM0_COMBINE DTEN1 [12..12]  ============================================ */
typedef enum {                                  /*!< FTM0_COMBINE_DTEN1                                                        */
  FTM0_COMBINE_DTEN1_0                 = 0,     /*!< 0 : The deadtime insertion in this pair of channels is disabled.          */
  FTM0_COMBINE_DTEN1_1                 = 1,     /*!< 1 : The deadtime insertion in this pair of channels is enabled.           */
} FTM0_COMBINE_DTEN1_Enum;

/* ==========================================  FTM0 FTM0_COMBINE SYNCEN1 [13..13]  =========================================== */
typedef enum {                                  /*!< FTM0_COMBINE_SYNCEN1                                                      */
  FTM0_COMBINE_SYNCEN1_0               = 0,     /*!< 0 : The PWM synchronization in this pair of channels is disabled.         */
  FTM0_COMBINE_SYNCEN1_1               = 1,     /*!< 1 : The PWM synchronization in this pair of channels is enabled.          */
} FTM0_COMBINE_SYNCEN1_Enum;

/* ==========================================  FTM0 FTM0_COMBINE FAULTEN1 [14..14]  ========================================== */
typedef enum {                                  /*!< FTM0_COMBINE_FAULTEN1                                                     */
  FTM0_COMBINE_FAULTEN1_0              = 0,     /*!< 0 : The fault control in this pair of channels is disabled.               */
  FTM0_COMBINE_FAULTEN1_1              = 1,     /*!< 1 : The fault control in this pair of channels is enabled.                */
} FTM0_COMBINE_FAULTEN1_Enum;

/* ===========================================  FTM0 FTM0_COMBINE COMP2 [17..17]  ============================================ */
typedef enum {                                  /*!< FTM0_COMBINE_COMP2                                                        */
  FTM0_COMBINE_COMP2_0                 = 0,     /*!< 0 : The channel (n+1) output is the same as the channel (n)
                                                     output.                                                                   */
  FTM0_COMBINE_COMP2_1                 = 1,     /*!< 1 : The channel (n+1) output is the complement of the channel
                                                     (n) output.                                                               */
} FTM0_COMBINE_COMP2_Enum;

/* ===========================================  FTM0 FTM0_COMBINE DECAP2 [19..19]  =========================================== */
typedef enum {                                  /*!< FTM0_COMBINE_DECAP2                                                       */
  FTM0_COMBINE_DECAP2_0                = 0,     /*!< 0 : The dual edge captures are inactive.                                  */
  FTM0_COMBINE_DECAP2_1                = 1,     /*!< 1 : The dual edge captures are active.                                    */
} FTM0_COMBINE_DECAP2_Enum;

/* ===========================================  FTM0 FTM0_COMBINE DTEN2 [20..20]  ============================================ */
typedef enum {                                  /*!< FTM0_COMBINE_DTEN2                                                        */
  FTM0_COMBINE_DTEN2_0                 = 0,     /*!< 0 : The deadtime insertion in this pair of channels is disabled.          */
  FTM0_COMBINE_DTEN2_1                 = 1,     /*!< 1 : The deadtime insertion in this pair of channels is enabled.           */
} FTM0_COMBINE_DTEN2_Enum;

/* ==========================================  FTM0 FTM0_COMBINE SYNCEN2 [21..21]  =========================================== */
typedef enum {                                  /*!< FTM0_COMBINE_SYNCEN2                                                      */
  FTM0_COMBINE_SYNCEN2_0               = 0,     /*!< 0 : The PWM synchronization in this pair of channels is disabled.         */
  FTM0_COMBINE_SYNCEN2_1               = 1,     /*!< 1 : The PWM synchronization in this pair of channels is enabled.          */
} FTM0_COMBINE_SYNCEN2_Enum;

/* ==========================================  FTM0 FTM0_COMBINE FAULTEN2 [22..22]  ========================================== */
typedef enum {                                  /*!< FTM0_COMBINE_FAULTEN2                                                     */
  FTM0_COMBINE_FAULTEN2_0              = 0,     /*!< 0 : The fault control in this pair of channels is disabled.               */
  FTM0_COMBINE_FAULTEN2_1              = 1,     /*!< 1 : The fault control in this pair of channels is enabled.                */
} FTM0_COMBINE_FAULTEN2_Enum;

/* ===========================================  FTM0 FTM0_COMBINE COMP3 [25..25]  ============================================ */
typedef enum {                                  /*!< FTM0_COMBINE_COMP3                                                        */
  FTM0_COMBINE_COMP3_0                 = 0,     /*!< 0 : The channel (n+1) output is the same as the channel (n)
                                                     output.                                                                   */
  FTM0_COMBINE_COMP3_1                 = 1,     /*!< 1 : The channel (n+1) output is the complement of the channel
                                                     (n) output.                                                               */
} FTM0_COMBINE_COMP3_Enum;

