nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  FTM0 FTM0_FMS FAULTF3 [3..3]  ============================================== */
typedef enum {                                  /*!< FTM0_FMS_FAULTF3                                                          */
  FTM0_FMS_FAULTF3_0                   = 0,     /*!< 0 : No fault condition was detected at the fault input.                   */
  FTM0_FMS_FAULTF3_1                   = 1,     /*!< 1 : A fault condition was detected at the fault input.                    */
} FTM0_FMS_FAULTF3_Enum;

/* =============================================  FTM0 FTM0_FMS FAULTIN [5..5]  ============================================== */
typedef enum {                                  /*!< FTM0_FMS_FAULTIN                                                          */
  FTM0_FMS_FAULTIN_0                   = 0,     /*!< 0 : The logic OR of the enabled fault inputs is 0.                        */
  FTM0_FMS_FAULTIN_1                   = 1,     /*!< 1 : The logic OR of the enabled fault inputs is 1.                        */
} FTM0_FMS_FAULTIN_Enum;

/* ===============================================  FTM0 FTM0_FMS WPEN [6..6]  =============================================== */
typedef enum {                                  /*!< FTM0_FMS_WPEN                                                             */
  FTM0_FMS_WPEN_0                      = 0,     /*!< 0 : Write protection is disabled. Write protected bits can be
                                                     written.                                                                  */
  FTM0_FMS_WPEN_1                      = 1,     /*!< 1 : Write protection is enabled. Write protected bits cannot
                                                     be written.                                                               */
} FTM0_FMS_WPEN_Enum;

/* ==============================================  FTM0 FTM0_FMS FAULTF [7..7]  ============================================== */
typedef enum {                                  /*!< FTM0_FMS_FAULTF                                                           */
  FTM0_FMS_FAULTF_0                    = 0,     /*!< 0 : No fault condition was detected.                                      */
  FTM0_FMS_FAULTF_1                    = 1,     /*!< 1 : A fault condition was detected.                                       */
} FTM0_FMS_FAULTF_Enum;

/* ======================================================  FTM0_FILTER  ====================================================== */
/* =====================================================  FTM0_FLTCTRL  ====================================================== */
/* ===========================================  FTM0 FTM0_FLTCTRL FAULT0EN [0..0]  =========================================== */
typedef enum {                                  /*!< FTM0_FLTCTRL_FAULT0EN                                                     */
  FTM0_FLTCTRL_FAULT0EN_0              = 0,     /*!< 0 : Fault input is disabled.                                              */
  FTM0_FLTCTRL_FAULT0EN_1              = 1,     /*!< 1 : Fault input is enabled.                                               */
} FTM0_FLTCTRL_FAULT0EN_Enum;

/* ===========================================  FTM0 FTM0_FLTCTRL FAULT1EN [1..1]  =========================================== */
typedef enum {                                  /*!< FTM0_FLTCTRL_FAULT1EN                                                     */
  FTM0_FLTCTRL_FAULT1EN_0              = 0,     /*!< 0 : Fault input is disabled.                                              */
  FTM0_FLTCTRL_FAULT1EN_1              = 1,     /*!< 1 : Fault input is enabled.                                               */
} FTM0_FLTCTRL_FAULT1EN_Enum;

/* ===========================================  FTM0 FTM0_FLTCTRL FAULT2EN [2..2]  =========================================== */
typedef enum {                                  /*!< FTM0_FLTCTRL_FAULT2EN                                                     */
  FTM0_FLTCTRL_FAULT2EN_0              = 0,     /*!< 0 : Fault input is disabled.                                              */
  FTM0_FLTCTRL_FAULT2EN_1              = 1,     /*!< 1 : Fault input is enabled.                                               */
} FTM0_FLTCTRL_FAULT2EN_Enum;

/* ===========================================  FTM0 FTM0_FLTCTRL FAULT3EN [3..3]  =========================================== */
typedef enum {                                  /*!< FTM0_FLTCTRL_FAULT3EN                                                     */
  FTM0_FLTCTRL_FAULT3EN_0              = 0,     /*!< 0 : Fault input is disabled.                                              */
  FTM0_FLTCTRL_FAULT3EN_1              = 1,     /*!< 1 : Fault input is enabled.                                               */
} FTM0_FLTCTRL_FAULT3EN_Enum;

/* ===========================================  FTM0 FTM0_FLTCTRL FFLTR0EN [4..4]  =========================================== */
typedef enum {                                  /*!< FTM0_FLTCTRL_FFLTR0EN                                                     */
  FTM0_FLTCTRL_FFLTR0EN_0              = 0,     /*!< 0 : Fault input filter is disabled.                                       */
  FTM0_FLTCTRL_FFLTR0EN_1              = 1,     /*!< 1 : Fault input filter is enabled.                                        */
} FTM0_FLTCTRL_FFLTR0EN_Enum;

/* ===========================================  FTM0 FTM0_FLTCTRL FFLTR1EN [5..5]  =========================================== */
typedef enum {                                  /*!< FTM0_FLTCTRL_FFLTR1EN                                                     */
  FTM0_FLTCTRL_FFLTR1EN_0              = 0,     /*!< 0 : Fault input filter is disabled.                                       */
  FTM0_FLTCTRL_FFLTR1EN_1              = 1,     /*!< 1 : Fault input filter is enabled.                                        */
} FTM0_FLTCTRL_FFLTR1EN_Enum;

/* ===========================================  FTM0 FTM0_FLTCTRL FFLTR2EN [6..6]  =========================================== */
typedef enum {                                  /*!< FTM0_FLTCTRL_FFLTR2EN                                                     */
  FTM0_FLTCTRL_FFLTR2EN_0              = 0,     /*!< 0 : Fault input filter is disabled.                                       */
  FTM0_FLTCTRL_FFLTR2EN_1              = 1,     /*!< 1 : Fault input filter is enabled.                                        */
} FTM0_FLTCTRL_FFLTR2EN_Enum;

