nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===========================================  FTM0 FTM0_FLTCTRL FFLTR3EN [7..7]  =========================================== */
typedef enum {                                  /*!< FTM0_FLTCTRL_FFLTR3EN                                                     */
  FTM0_FLTCTRL_FFLTR3EN_0              = 0,     /*!< 0 : Fault input filter is disabled.                                       */
  FTM0_FLTCTRL_FFLTR3EN_1              = 1,     /*!< 1 : Fault input filter is enabled.                                        */
} FTM0_FLTCTRL_FFLTR3EN_Enum;

/* ===========================================  FTM0 FTM0_FLTCTRL FSTATE [15..15]  =========================================== */
typedef enum {                                  /*!< FTM0_FLTCTRL_FSTATE                                                       */
  FTM0_FLTCTRL_FSTATE_0                = 0,     /*!< 0 : FTM outputs will be placed into safe values when fault events
                                                     in ongoing (defined by POL bits).                                         */
  FTM0_FLTCTRL_FSTATE_1                = 1,     /*!< 1 : FTM outputs will be tri-stated when fault event is ongoing            */
} FTM0_FLTCTRL_FSTATE_Enum;

/* ======================================================  FTM0_QDCTRL  ====================================================== */
/* ============================================  FTM0 FTM0_QDCTRL QUADEN [0..0]  ============================================= */
typedef enum {                                  /*!< FTM0_QDCTRL_QUADEN                                                        */
  FTM0_QDCTRL_QUADEN_0                 = 0,     /*!< 0 : Quadrature Decoder mode is disabled.                                  */
  FTM0_QDCTRL_QUADEN_1                 = 1,     /*!< 1 : Quadrature Decoder mode is enabled.                                   */
} FTM0_QDCTRL_QUADEN_Enum;

/* ============================================  FTM0 FTM0_QDCTRL TOFDIR [1..1]  ============================================= */
typedef enum {                                  /*!< FTM0_QDCTRL_TOFDIR                                                        */
  FTM0_QDCTRL_TOFDIR_0                 = 0,     /*!< 0 : TOF bit was set on the bottom of counting. There was an
                                                     FTM counter decrement and FTM counter changes from its
                                                     minimum value (CNTIN register) to its maximum value (MOD
                                                     register).                                                                */
  FTM0_QDCTRL_TOFDIR_1                 = 1,     /*!< 1 : TOF bit was set on the top of counting. There was an FTM
                                                     counter increment and FTM counter changes from its maximum
                                                     value (MOD register) to its minimum value (CNTIN register).               */
} FTM0_QDCTRL_TOFDIR_Enum;

/* ============================================  FTM0 FTM0_QDCTRL QUADIR [2..2]  ============================================= */
typedef enum {                                  /*!< FTM0_QDCTRL_QUADIR                                                        */
  FTM0_QDCTRL_QUADIR_0                 = 0,     /*!< 0 : Counting direction is decreasing (FTM counter decrement).             */
  FTM0_QDCTRL_QUADIR_1                 = 1,     /*!< 1 : Counting direction is increasing (FTM counter increment).             */
} FTM0_QDCTRL_QUADIR_Enum;

/* ===========================================  FTM0 FTM0_QDCTRL QUADMODE [3..3]  ============================================ */
typedef enum {                                  /*!< FTM0_QDCTRL_QUADMODE                                                      */
  FTM0_QDCTRL_QUADMODE_0               = 0,     /*!< 0 : Phase A and phase B encoding mode.                                    */
  FTM0_QDCTRL_QUADMODE_1               = 1,     /*!< 1 : Count and direction encoding mode.                                    */
} FTM0_QDCTRL_QUADMODE_Enum;

/* ============================================  FTM0 FTM0_QDCTRL PHBPOL [4..4]  ============================================= */
typedef enum {                                  /*!< FTM0_QDCTRL_PHBPOL                                                        */
  FTM0_QDCTRL_PHBPOL_0                 = 0,     /*!< 0 : Normal polarity. Phase B input signal is not inverted before
                                                     identifying the rising and falling edges of this signal.                  */
  FTM0_QDCTRL_PHBPOL_1                 = 1,     /*!< 1 : Inverted polarity. Phase B input signal is inverted before
                                                     identifying the rising and falling edges of this signal.                  */
} FTM0_QDCTRL_PHBPOL_Enum;

/* ============================================  FTM0 FTM0_QDCTRL PHAPOL [5..5]  ============================================= */
typedef enum {                                  /*!< FTM0_QDCTRL_PHAPOL                                                        */
  FTM0_QDCTRL_PHAPOL_0                 = 0,     /*!< 0 : Normal polarity. Phase A input signal is not inverted before
                                                     identifying the rising and falling edges of this signal.                  */
  FTM0_QDCTRL_PHAPOL_1                 = 1,     /*!< 1 : Inverted polarity. Phase A input signal is inverted before
                                                     identifying the rising and falling edges of this signal.                  */
} FTM0_QDCTRL_PHAPOL_Enum;

/* ===========================================  FTM0 FTM0_QDCTRL PHBFLTREN [6..6]  =========================================== */
typedef enum {                                  /*!< FTM0_QDCTRL_PHBFLTREN                                                     */
  FTM0_QDCTRL_PHBFLTREN_0              = 0,     /*!< 0 : Phase B input filter is disabled.                                     */
  FTM0_QDCTRL_PHBFLTREN_1              = 1,     /*!< 1 : Phase B input filter is enabled.                                      */
} FTM0_QDCTRL_PHBFLTREN_Enum;

/* ===========================================  FTM0 FTM0_QDCTRL PHAFLTREN [7..7]  =========================================== */
typedef enum {                                  /*!< FTM0_QDCTRL_PHAFLTREN                                                     */
  FTM0_QDCTRL_PHAFLTREN_0              = 0,     /*!< 0 : Phase A input filter is disabled.                                     */
  FTM0_QDCTRL_PHAFLTREN_1              = 1,     /*!< 1 : Phase A input filter is enabled.                                      */
} FTM0_QDCTRL_PHAFLTREN_Enum;

