nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =======================================================  FTM0_CONF  ======================================================= */
/* ============================================  FTM0 FTM0_CONF ITRIGR [11..11]  ============================================= */
typedef enum {                                  /*!< FTM0_CONF_ITRIGR                                                          */
  FTM0_CONF_ITRIGR_0                   = 0,     /*!< 0 : Initialization trigger is generated on counter wrap events.           */
  FTM0_CONF_ITRIGR_1                   = 1,     /*!< 1 : Initialization trigger is generated when a reload point
                                                     is reached.                                                               */
} FTM0_CONF_ITRIGR_Enum;

/* ======================================================  FTM0_FLTPOL  ====================================================== */
/* ============================================  FTM0 FTM0_FLTPOL FLT0POL [0..0]  ============================================ */
typedef enum {                                  /*!< FTM0_FLTPOL_FLT0POL                                                       */
  FTM0_FLTPOL_FLT0POL_0                = 0,     /*!< 0 : The fault input polarity is active high. A 1 at the fault
                                                     input indicates a fault.                                                  */
  FTM0_FLTPOL_FLT0POL_1                = 1,     /*!< 1 : The fault input polarity is active low. A 0 at the fault
                                                     input indicates a fault.                                                  */
} FTM0_FLTPOL_FLT0POL_Enum;

/* ============================================  FTM0 FTM0_FLTPOL FLT1POL [1..1]  ============================================ */
typedef enum {                                  /*!< FTM0_FLTPOL_FLT1POL                                                       */
  FTM0_FLTPOL_FLT1POL_0                = 0,     /*!< 0 : The fault input polarity is active high. A 1 at the fault
                                                     input indicates a fault.                                                  */
  FTM0_FLTPOL_FLT1POL_1                = 1,     /*!< 1 : The fault input polarity is active low. A 0 at the fault
                                                     input indicates a fault.                                                  */
} FTM0_FLTPOL_FLT1POL_Enum;

/* ============================================  FTM0 FTM0_FLTPOL FLT2POL [2..2]  ============================================ */
typedef enum {                                  /*!< FTM0_FLTPOL_FLT2POL                                                       */
  FTM0_FLTPOL_FLT2POL_0                = 0,     /*!< 0 : The fault input polarity is active high. A 1 at the fault
                                                     input indicates a fault.                                                  */
  FTM0_FLTPOL_FLT2POL_1                = 1,     /*!< 1 : The fault input polarity is active low. A 0 at the fault
                                                     input indicates a fault.                                                  */
} FTM0_FLTPOL_FLT2POL_Enum;

/* ============================================  FTM0 FTM0_FLTPOL FLT3POL [3..3]  ============================================ */
typedef enum {                                  /*!< FTM0_FLTPOL_FLT3POL                                                       */
  FTM0_FLTPOL_FLT3POL_0                = 0,     /*!< 0 : The fault input polarity is active high. A 1 at the fault
                                                     input indicates a fault.                                                  */
  FTM0_FLTPOL_FLT3POL_1                = 1,     /*!< 1 : The fault input polarity is active low. A 0 at the fault
                                                     input indicates a fault.                                                  */
} FTM0_FLTPOL_FLT3POL_Enum;

/* =====================================================  FTM0_SYNCONF  ====================================================== */
/* ==========================================  FTM0 FTM0_SYNCONF HWTRIGMODE [0..0]  ========================================== */
typedef enum {                                  /*!< FTM0_SYNCONF_HWTRIGMODE                                                   */
  FTM0_SYNCONF_HWTRIGMODE_0            = 0,     /*!< 0 : FTM clears the TRIGj bit when the hardware trigger j is
                                                     detected, where j = 0, 1,2.                                               */
  FTM0_SYNCONF_HWTRIGMODE_1            = 1,     /*!< 1 : FTM does not clear the TRIGj bit when the hardware trigger
                                                     j is detected, where j = 0, 1,2.                                          */
} FTM0_SYNCONF_HWTRIGMODE_Enum;

/* ============================================  FTM0 FTM0_SYNCONF CNTINC [2..2]  ============================================ */
typedef enum {                                  /*!< FTM0_SYNCONF_CNTINC                                                       */
  FTM0_SYNCONF_CNTINC_0                = 0,     /*!< 0 : CNTIN register is updated with its buffer value at all rising
                                                     edges of FTM input clock.                                                 */
  FTM0_SYNCONF_CNTINC_1                = 1,     /*!< 1 : CNTIN register is updated with its buffer value by the PWM
                                                     synchronization.                                                          */
} FTM0_SYNCONF_CNTINC_Enum;

/* =============================================  FTM0 FTM0_SYNCONF INVC [4..4]  ============================================= */
typedef enum {                                  /*!< FTM0_SYNCONF_INVC                                                         */
  FTM0_SYNCONF_INVC_0                  = 0,     /*!< 0 : INVCTRL register is updated with its buffer value at all
                                                     rising edges of FTM input clock.                                          */
  FTM0_SYNCONF_INVC_1                  = 1,     /*!< 1 : INVCTRL register is updated with its buffer value by the
                                                     PWM synchronization.                                                      */
} FTM0_SYNCONF_INVC_Enum;

/* =============================================  FTM0 FTM0_SYNCONF SWOC [5..5]  ============================================= */
typedef enum {                                  /*!< FTM0_SYNCONF_SWOC                                                         */
  FTM0_SYNCONF_SWOC_0                  = 0,     /*!< 0 : SWOCTRL register is updated with its buffer value at all
                                                     rising edges of FTM input clock.                                          */
  FTM0_SYNCONF_SWOC_1                  = 1,     /*!< 1 : SWOCTRL register is updated with its buffer value by the
                                                     PWM synchronization.                                                      */
} FTM0_SYNCONF_SWOC_Enum;

