nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===========================================  FTM0 FTM0_SYNCONF SYNCMODE [7..7]  =========================================== */
typedef enum {                                  /*!< FTM0_SYNCONF_SYNCMODE                                                     */
  FTM0_SYNCONF_SYNCMODE_0              = 0,     /*!< 0 : Legacy PWM synchronization is selected.                               */
  FTM0_SYNCONF_SYNCMODE_1              = 1,     /*!< 1 : Enhanced PWM synchronization is selected.                             */
} FTM0_SYNCONF_SYNCMODE_Enum;

/* ===========================================  FTM0 FTM0_SYNCONF SWRSTCNT [8..8]  =========================================== */
typedef enum {                                  /*!< FTM0_SYNCONF_SWRSTCNT                                                     */
  FTM0_SYNCONF_SWRSTCNT_0              = 0,     /*!< 0 : The software trigger does not activate the FTM counter synchronization. */
  FTM0_SYNCONF_SWRSTCNT_1              = 1,     /*!< 1 : The software trigger activates the FTM counter synchronization.       */
} FTM0_SYNCONF_SWRSTCNT_Enum;

/* ===========================================  FTM0 FTM0_SYNCONF SWWRBUF [9..9]  ============================================ */
typedef enum {                                  /*!< FTM0_SYNCONF_SWWRBUF                                                      */
  FTM0_SYNCONF_SWWRBUF_0               = 0,     /*!< 0 : The software trigger does not activate MOD, HCR, CNTIN,
                                                     and CV registers synchronization.                                         */
  FTM0_SYNCONF_SWWRBUF_1               = 1,     /*!< 1 : The software trigger activates MOD, HCR, CNTIN, and CV registers
                                                     synchronization.                                                          */
} FTM0_SYNCONF_SWWRBUF_Enum;

/* ============================================  FTM0 FTM0_SYNCONF SWOM [10..10]  ============================================ */
typedef enum {                                  /*!< FTM0_SYNCONF_SWOM                                                         */
  FTM0_SYNCONF_SWOM_0                  = 0,     /*!< 0 : The software trigger does not activate the OUTMASK register
                                                     synchronization.                                                          */
  FTM0_SYNCONF_SWOM_1                  = 1,     /*!< 1 : The software trigger activates the OUTMASK register synchronization.  */
} FTM0_SYNCONF_SWOM_Enum;

/* ===========================================  FTM0 FTM0_SYNCONF SWINVC [11..11]  =========================================== */
typedef enum {                                  /*!< FTM0_SYNCONF_SWINVC                                                       */
  FTM0_SYNCONF_SWINVC_0                = 0,     /*!< 0 : The software trigger does not activate the INVCTRL register
                                                     synchronization.                                                          */
  FTM0_SYNCONF_SWINVC_1                = 1,     /*!< 1 : The software trigger activates the INVCTRL register synchronization.  */
} FTM0_SYNCONF_SWINVC_Enum;

/* ===========================================  FTM0 FTM0_SYNCONF SWSOC [12..12]  ============================================ */
typedef enum {                                  /*!< FTM0_SYNCONF_SWSOC                                                        */
  FTM0_SYNCONF_SWSOC_0                 = 0,     /*!< 0 : The software trigger does not activate the SWOCTRL register
                                                     synchronization.                                                          */
  FTM0_SYNCONF_SWSOC_1                 = 1,     /*!< 1 : The software trigger activates the SWOCTRL register synchronization.  */
} FTM0_SYNCONF_SWSOC_Enum;

/* ==========================================  FTM0 FTM0_SYNCONF HWRSTCNT [16..16]  ========================================== */
typedef enum {                                  /*!< FTM0_SYNCONF_HWRSTCNT                                                     */
  FTM0_SYNCONF_HWRSTCNT_0              = 0,     /*!< 0 : A hardware trigger does not activate the FTM counter synchronization. */
  FTM0_SYNCONF_HWRSTCNT_1              = 1,     /*!< 1 : A hardware trigger activates the FTM counter synchronization.         */
} FTM0_SYNCONF_HWRSTCNT_Enum;

/* ==========================================  FTM0 FTM0_SYNCONF HWWRBUF [17..17]  =========================================== */
typedef enum {                                  /*!< FTM0_SYNCONF_HWWRBUF                                                      */
  FTM0_SYNCONF_HWWRBUF_0               = 0,     /*!< 0 : A hardware trigger does not activate MOD, HCR, CNTIN, and
                                                     CV registers synchronization.                                             */
  FTM0_SYNCONF_HWWRBUF_1               = 1,     /*!< 1 : A hardware trigger activates MOD, HCR, CNTIN, and CV registers
                                                     synchronization.                                                          */
} FTM0_SYNCONF_HWWRBUF_Enum;

/* ============================================  FTM0 FTM0_SYNCONF HWOM [18..18]  ============================================ */
typedef enum {                                  /*!< FTM0_SYNCONF_HWOM                                                         */
  FTM0_SYNCONF_HWOM_0                  = 0,     /*!< 0 : A hardware trigger does not activate the OUTMASK register
                                                     synchronization.                                                          */
  FTM0_SYNCONF_HWOM_1                  = 1,     /*!< 1 : A hardware trigger activates the OUTMASK register synchronization.    */
} FTM0_SYNCONF_HWOM_Enum;

/* ===========================================  FTM0 FTM0_SYNCONF HWINVC [19..19]  =========================================== */
typedef enum {                                  /*!< FTM0_SYNCONF_HWINVC                                                       */
  FTM0_SYNCONF_HWINVC_0                = 0,     /*!< 0 : A hardware trigger does not activate the INVCTRL register
                                                     synchronization.                                                          */
  FTM0_SYNCONF_HWINVC_1                = 1,     /*!< 1 : A hardware trigger activates the INVCTRL register synchronization.    */
} FTM0_SYNCONF_HWINVC_Enum;

/* ===========================================  FTM0 FTM0_SYNCONF HWSOC [20..20]  ============================================ */
typedef enum {                                  /*!< FTM0_SYNCONF_HWSOC                                                        */
  FTM0_SYNCONF_HWSOC_0                 = 0,     /*!< 0 : A hardware trigger does not activate the SWOCTRL register
                                                     synchronization.                                                          */
  FTM0_SYNCONF_HWSOC_1                 = 1,     /*!< 1 : A hardware trigger activates the SWOCTRL register synchronization.    */
} FTM0_SYNCONF_HWSOC_Enum;

/* =====================================================  FTM0_INVCTRL  ====================================================== */
/* ============================================  FTM0 FTM0_INVCTRL INV0EN [0..0]  ============================================ */
typedef enum {                                  /*!< FTM0_INVCTRL_INV0EN                                                       */
  FTM0_INVCTRL_INV0EN_0                = 0,     /*!< 0 : Inverting is disabled.                                                */
  FTM0_INVCTRL_INV0EN_1                = 1,     /*!< 1 : Inverting is enabled.                                                 */
} FTM0_INVCTRL_INV0EN_Enum;

