nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  FTM0 FTM0_SWOCTRL CH1OCV [9..9]  ============================================ */
typedef enum {                                  /*!< FTM0_SWOCTRL_CH1OCV                                                       */
  FTM0_SWOCTRL_CH1OCV_0                = 0,     /*!< 0 : The software output control forces 0 to the channel output.           */
  FTM0_SWOCTRL_CH1OCV_1                = 1,     /*!< 1 : The software output control forces 1 to the channel output.           */
} FTM0_SWOCTRL_CH1OCV_Enum;

/* ===========================================  FTM0 FTM0_SWOCTRL CH2OCV [10..10]  =========================================== */
typedef enum {                                  /*!< FTM0_SWOCTRL_CH2OCV                                                       */
  FTM0_SWOCTRL_CH2OCV_0                = 0,     /*!< 0 : The software output control forces 0 to the channel output.           */
  FTM0_SWOCTRL_CH2OCV_1                = 1,     /*!< 1 : The software output control forces 1 to the channel output.           */
} FTM0_SWOCTRL_CH2OCV_Enum;

/* ===========================================  FTM0 FTM0_SWOCTRL CH3OCV [11..11]  =========================================== */
typedef enum {                                  /*!< FTM0_SWOCTRL_CH3OCV                                                       */
  FTM0_SWOCTRL_CH3OCV_0                = 0,     /*!< 0 : The software output control forces 0 to the channel output.           */
  FTM0_SWOCTRL_CH3OCV_1                = 1,     /*!< 1 : The software output control forces 1 to the channel output.           */
} FTM0_SWOCTRL_CH3OCV_Enum;

/* ===========================================  FTM0 FTM0_SWOCTRL CH4OCV [12..12]  =========================================== */
typedef enum {                                  /*!< FTM0_SWOCTRL_CH4OCV                                                       */
  FTM0_SWOCTRL_CH4OCV_0                = 0,     /*!< 0 : The software output control forces 0 to the channel output.           */
  FTM0_SWOCTRL_CH4OCV_1                = 1,     /*!< 1 : The software output control forces 1 to the channel output.           */
} FTM0_SWOCTRL_CH4OCV_Enum;

/* ===========================================  FTM0 FTM0_SWOCTRL CH5OCV [13..13]  =========================================== */
typedef enum {                                  /*!< FTM0_SWOCTRL_CH5OCV                                                       */
  FTM0_SWOCTRL_CH5OCV_0                = 0,     /*!< 0 : The software output control forces 0 to the channel output.           */
  FTM0_SWOCTRL_CH5OCV_1                = 1,     /*!< 1 : The software output control forces 1 to the channel output.           */
} FTM0_SWOCTRL_CH5OCV_Enum;

/* ===========================================  FTM0 FTM0_SWOCTRL CH6OCV [14..14]  =========================================== */
typedef enum {                                  /*!< FTM0_SWOCTRL_CH6OCV                                                       */
  FTM0_SWOCTRL_CH6OCV_0                = 0,     /*!< 0 : The software output control forces 0 to the channel output.           */
  FTM0_SWOCTRL_CH6OCV_1                = 1,     /*!< 1 : The software output control forces 1 to the channel output.           */
} FTM0_SWOCTRL_CH6OCV_Enum;

/* ===========================================  FTM0 FTM0_SWOCTRL CH7OCV [15..15]  =========================================== */
typedef enum {                                  /*!< FTM0_SWOCTRL_CH7OCV                                                       */
  FTM0_SWOCTRL_CH7OCV_0                = 0,     /*!< 0 : The software output control forces 0 to the channel output.           */
  FTM0_SWOCTRL_CH7OCV_1                = 1,     /*!< 1 : The software output control forces 1 to the channel output.           */
} FTM0_SWOCTRL_CH7OCV_Enum;

/* =====================================================  FTM0_PWMLOAD  ====================================================== */
/* ============================================  FTM0 FTM0_PWMLOAD CH0SEL [0..0]  ============================================ */
typedef enum {                                  /*!< FTM0_PWMLOAD_CH0SEL                                                       */
  FTM0_PWMLOAD_CH0SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM0_PWMLOAD_CH0SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM0_PWMLOAD_CH0SEL_Enum;

/* ============================================  FTM0 FTM0_PWMLOAD CH1SEL [1..1]  ============================================ */
typedef enum {                                  /*!< FTM0_PWMLOAD_CH1SEL                                                       */
  FTM0_PWMLOAD_CH1SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM0_PWMLOAD_CH1SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM0_PWMLOAD_CH1SEL_Enum;

/* ============================================  FTM0 FTM0_PWMLOAD CH2SEL [2..2]  ============================================ */
typedef enum {                                  /*!< FTM0_PWMLOAD_CH2SEL                                                       */
  FTM0_PWMLOAD_CH2SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM0_PWMLOAD_CH2SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM0_PWMLOAD_CH2SEL_Enum;

/* ============================================  FTM0 FTM0_PWMLOAD CH3SEL [3..3]  ============================================ */
typedef enum {                                  /*!< FTM0_PWMLOAD_CH3SEL                                                       */
  FTM0_PWMLOAD_CH3SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM0_PWMLOAD_CH3SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM0_PWMLOAD_CH3SEL_Enum;

/* ============================================  FTM0 FTM0_PWMLOAD CH4SEL [4..4]  ============================================ */
typedef enum {                                  /*!< FTM0_PWMLOAD_CH4SEL                                                       */
  FTM0_PWMLOAD_CH4SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM0_PWMLOAD_CH4SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM0_PWMLOAD_CH4SEL_Enum;

