nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===============================================  FTM1 FTM1_SC CLKS [3..4]  ================================================ */
typedef enum {                                  /*!< FTM1_SC_CLKS                                                              */
  FTM1_SC_CLKS_00                      = 0,     /*!< 00 : No clock selected. This in effect disables the FTM counter.          */
  FTM1_SC_CLKS_01                      = 1,     /*!< 01 : FTM input clock                                                      */
  FTM1_SC_CLKS_10                      = 2,     /*!< 10 : Fixed frequency clock                                                */
  FTM1_SC_CLKS_11                      = 3,     /*!< 11 : External clock                                                       */
} FTM1_SC_CLKS_Enum;

/* ===============================================  FTM1 FTM1_SC CPWMS [5..5]  =============================================== */
typedef enum {                                  /*!< FTM1_SC_CPWMS                                                             */
  FTM1_SC_CPWMS_0                      = 0,     /*!< 0 : FTM counter operates in Up Counting mode.                             */
  FTM1_SC_CPWMS_1                      = 1,     /*!< 1 : FTM counter operates in Up-Down Counting mode.                        */
} FTM1_SC_CPWMS_Enum;

/* ================================================  FTM1 FTM1_SC RIE [6..6]  ================================================ */
typedef enum {                                  /*!< FTM1_SC_RIE                                                               */
  FTM1_SC_RIE_0                        = 0,     /*!< 0 : Reload point interrupt is disabled.                                   */
  FTM1_SC_RIE_1                        = 1,     /*!< 1 : Reload point interrupt is enabled.                                    */
} FTM1_SC_RIE_Enum;

/* ================================================  FTM1 FTM1_SC RF [7..7]  ================================================= */
typedef enum {                                  /*!< FTM1_SC_RF                                                                */
  FTM1_SC_RF_0                         = 0,     /*!< 0 : A selected reload point did not happen.                               */
  FTM1_SC_RF_1                         = 1,     /*!< 1 : A selected reload point happened.                                     */
} FTM1_SC_RF_Enum;

/* ===============================================  FTM1 FTM1_SC TOIE [8..8]  ================================================ */
typedef enum {                                  /*!< FTM1_SC_TOIE                                                              */
  FTM1_SC_TOIE_0                       = 0,     /*!< 0 : Disable TOF interrupts. Use software polling.                         */
  FTM1_SC_TOIE_1                       = 1,     /*!< 1 : Enable TOF interrupts. An interrupt is generated when TOF
                                                     equals one.                                                               */
} FTM1_SC_TOIE_Enum;

/* ================================================  FTM1 FTM1_SC TOF [9..9]  ================================================ */
typedef enum {                                  /*!< FTM1_SC_TOF                                                               */
  FTM1_SC_TOF_0                        = 0,     /*!< 0 : FTM counter has not overflowed.                                       */
  FTM1_SC_TOF_1                        = 1,     /*!< 1 : FTM counter has overflowed.                                           */
} FTM1_SC_TOF_Enum;

/* =============================================  FTM1 FTM1_SC PWMEN0 [16..16]  ============================================== */
typedef enum {                                  /*!< FTM1_SC_PWMEN0                                                            */
  FTM1_SC_PWMEN0_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM1_SC_PWMEN0_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM1_SC_PWMEN0_Enum;

/* =============================================  FTM1 FTM1_SC PWMEN1 [17..17]  ============================================== */
typedef enum {                                  /*!< FTM1_SC_PWMEN1                                                            */
  FTM1_SC_PWMEN1_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM1_SC_PWMEN1_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM1_SC_PWMEN1_Enum;

/* =============================================  FTM1 FTM1_SC PWMEN2 [18..18]  ============================================== */
typedef enum {                                  /*!< FTM1_SC_PWMEN2                                                            */
  FTM1_SC_PWMEN2_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM1_SC_PWMEN2_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM1_SC_PWMEN2_Enum;

/* =============================================  FTM1 FTM1_SC PWMEN3 [19..19]  ============================================== */
typedef enum {                                  /*!< FTM1_SC_PWMEN3                                                            */
  FTM1_SC_PWMEN3_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM1_SC_PWMEN3_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM1_SC_PWMEN3_Enum;

/* =============================================  FTM1 FTM1_SC PWMEN4 [20..20]  ============================================== */
typedef enum {                                  /*!< FTM1_SC_PWMEN4                                                            */
  FTM1_SC_PWMEN4_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM1_SC_PWMEN4_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM1_SC_PWMEN4_Enum;

/* =============================================  FTM1 FTM1_SC PWMEN5 [21..21]  ============================================== */
typedef enum {                                  /*!< FTM1_SC_PWMEN5                                                            */
  FTM1_SC_PWMEN5_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM1_SC_PWMEN5_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM1_SC_PWMEN5_Enum;

/* =============================================  FTM1 FTM1_SC PWMEN6 [22..22]  ============================================== */
typedef enum {                                  /*!< FTM1_SC_PWMEN6                                                            */
  FTM1_SC_PWMEN6_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM1_SC_PWMEN6_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM1_SC_PWMEN6_Enum;

/* =============================================  FTM1 FTM1_SC PWMEN7 [23..23]  ============================================== */
typedef enum {                                  /*!< FTM1_SC_PWMEN7                                                            */
  FTM1_SC_PWMEN7_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM1_SC_PWMEN7_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM1_SC_PWMEN7_Enum;

/* ==============================================  FTM1 FTM1_SC FLTPS [24..27]  ============================================== */
typedef enum {                                  /*!< FTM1_SC_FLTPS                                                             */
  FTM1_SC_FLTPS_0000                   = 0,     /*!< 0000 : Divide by 1                                                        */
  FTM1_SC_FLTPS_0001                   = 1,     /*!< 0001 : Divide by 2                                                        */
  FTM1_SC_FLTPS_0010                   = 2,     /*!< 0010 : Divide by 3                                                        */
  FTM1_SC_FLTPS_0011                   = 3,     /*!< 0011 : Divide by 4                                                        */
  FTM1_SC_FLTPS_0100                   = 4,     /*!< 0100 : Divide by 5                                                        */
  FTM1_SC_FLTPS_0101                   = 5,     /*!< 0101 : Divide by 6                                                        */
  FTM1_SC_FLTPS_0110                   = 6,     /*!< 0110 : Divide by 7                                                        */
  FTM1_SC_FLTPS_0111                   = 7,     /*!< 0111 : Divide by 8                                                        */
  FTM1_SC_FLTPS_1000                   = 8,     /*!< 1000 : Divide by 9                                                        */
  FTM1_SC_FLTPS_1001                   = 9,     /*!< 1001 : Divide by 10                                                       */
  FTM1_SC_FLTPS_1010                   = 10,    /*!< 1010 : Divide by 11                                                       */
  FTM1_SC_FLTPS_1011                   = 11,    /*!< 1011 : Divide by 12                                                       */
  FTM1_SC_FLTPS_1100                   = 12,    /*!< 1100 : Divide by 13                                                       */
  FTM1_SC_FLTPS_1101                   = 13,    /*!< 1101 : Divide by 14                                                       */
  FTM1_SC_FLTPS_1110                   = 14,    /*!< 1110 : Divide by 15                                                       */
  FTM1_SC_FLTPS_1111                   = 15,    /*!< 1111 : Divide by 16                                                       */
} FTM1_SC_FLTPS_Enum;

