nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  FTM1 FTM1_C7SC TRIGMODE [8..8]  ============================================= */
typedef enum {                                  /*!< FTM1_C7SC_TRIGMODE                                                        */
  FTM1_C7SC_TRIGMODE_0                 = 0,     /*!< 0 : Channel outputs will generate the normal PWM outputs without
                                                     generating a pulse.                                                       */
  FTM1_C7SC_TRIGMODE_1                 = 1,     /*!< 1 : If a match in the channel occurs, a trigger generation on
                                                     channel output will happen. The trigger pulse width has
                                                     one FTM clock cycle.                                                      */
} FTM1_C7SC_TRIGMODE_Enum;

/* ==============================================  FTM1 FTM1_C7SC CHIS [9..9]  =============================================== */
typedef enum {                                  /*!< FTM1_C7SC_CHIS                                                            */
  FTM1_C7SC_CHIS_0                     = 0,     /*!< 0 : The channel (n) input is zero.                                        */
  FTM1_C7SC_CHIS_1                     = 1,     /*!< 1 : The channel (n) input is one.                                         */
} FTM1_C7SC_CHIS_Enum;

/* =============================================  FTM1 FTM1_C7SC CHOV [10..10]  ============================================== */
typedef enum {                                  /*!< FTM1_C7SC_CHOV                                                            */
  FTM1_C7SC_CHOV_0                     = 0,     /*!< 0 : The channel (n) output is zero.                                       */
  FTM1_C7SC_CHOV_1                     = 1,     /*!< 1 : The channel (n) output is one.                                        */
} FTM1_C7SC_CHOV_Enum;

/* =======================================================  FTM1_C7V  ======================================================== */
/* ======================================================  FTM1_CNTIN  ======================================================= */
/* ======================================================  FTM1_STATUS  ====================================================== */
/* =============================================  FTM1 FTM1_STATUS CH0F [0..0]  ============================================== */
typedef enum {                                  /*!< FTM1_STATUS_CH0F                                                          */
  FTM1_STATUS_CH0F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM1_STATUS_CH0F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM1_STATUS_CH0F_Enum;

/* =============================================  FTM1 FTM1_STATUS CH1F [1..1]  ============================================== */
typedef enum {                                  /*!< FTM1_STATUS_CH1F                                                          */
  FTM1_STATUS_CH1F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM1_STATUS_CH1F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM1_STATUS_CH1F_Enum;

/* =============================================  FTM1 FTM1_STATUS CH2F [2..2]  ============================================== */
typedef enum {                                  /*!< FTM1_STATUS_CH2F                                                          */
  FTM1_STATUS_CH2F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM1_STATUS_CH2F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM1_STATUS_CH2F_Enum;

/* =============================================  FTM1 FTM1_STATUS CH3F [3..3]  ============================================== */
typedef enum {                                  /*!< FTM1_STATUS_CH3F                                                          */
  FTM1_STATUS_CH3F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM1_STATUS_CH3F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM1_STATUS_CH3F_Enum;

/* =============================================  FTM1 FTM1_STATUS CH4F [4..4]  ============================================== */
typedef enum {                                  /*!< FTM1_STATUS_CH4F                                                          */
  FTM1_STATUS_CH4F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM1_STATUS_CH4F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM1_STATUS_CH4F_Enum;

/* =============================================  FTM1 FTM1_STATUS CH5F [5..5]  ============================================== */
typedef enum {                                  /*!< FTM1_STATUS_CH5F                                                          */
  FTM1_STATUS_CH5F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM1_STATUS_CH5F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM1_STATUS_CH5F_Enum;

/* =============================================  FTM1 FTM1_STATUS CH6F [6..6]  ============================================== */
typedef enum {                                  /*!< FTM1_STATUS_CH6F                                                          */
  FTM1_STATUS_CH6F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM1_STATUS_CH6F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM1_STATUS_CH6F_Enum;

/* =============================================  FTM1 FTM1_STATUS CH7F [7..7]  ============================================== */
typedef enum {                                  /*!< FTM1_STATUS_CH7F                                                          */
  FTM1_STATUS_CH7F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM1_STATUS_CH7F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM1_STATUS_CH7F_Enum;

/* =======================================================  FTM1_MODE  ======================================================= */
/* ==============================================  FTM1 FTM1_MODE FTMEN [0..0]  ============================================== */
typedef enum {                                  /*!< FTM1_MODE_FTMEN                                                           */
  FTM1_MODE_FTMEN_0                    = 0,     /*!< 0 : TPM compatibility. Free running counter and synchronization
                                                     compatible with TPM.                                                      */
  FTM1_MODE_FTMEN_1                    = 1,     /*!< 1 : Free running counter and synchronization are different from
                                                     TPM behavior.                                                             */
} FTM1_MODE_FTMEN_Enum;

/* ==============================================  FTM1 FTM1_MODE WPDIS [2..2]  ============================================== */
typedef enum {                                  /*!< FTM1_MODE_WPDIS                                                           */
  FTM1_MODE_WPDIS_0                    = 0,     /*!< 0 : Write protection is enabled.                                          */
  FTM1_MODE_WPDIS_1                    = 1,     /*!< 1 : Write protection is disabled.                                         */
} FTM1_MODE_WPDIS_Enum;

/* =============================================  FTM1 FTM1_MODE PWMSYNC [3..3]  ============================================= */
typedef enum {                                  /*!< FTM1_MODE_PWMSYNC                                                         */
  FTM1_MODE_PWMSYNC_0                  = 0,     /*!< 0 : No restrictions. Software and hardware triggers can be used
                                                     by MOD, CnV, OUTMASK, and FTM counter synchronization.                    */
  FTM1_MODE_PWMSYNC_1                  = 1,     /*!< 1 : Software trigger can only be used by MOD and CnV synchronization,
                                                     and hardware triggers can only be used by OUTMASK and FTM
                                                     counter synchronization.                                                  */
} FTM1_MODE_PWMSYNC_Enum;

/* =============================================  FTM1 FTM1_MODE CAPTEST [4..4]  ============================================= */
typedef enum {                                  /*!< FTM1_MODE_CAPTEST                                                         */
  FTM1_MODE_CAPTEST_0                  = 0,     /*!< 0 : Capture test mode is disabled.                                        */
  FTM1_MODE_CAPTEST_1                  = 1,     /*!< 1 : Capture test mode is enabled.                                         */
} FTM1_MODE_CAPTEST_Enum;

/* =============================================  FTM1 FTM1_MODE FAULTM [5..6]  ============================================== */
typedef enum {                                  /*!< FTM1_MODE_FAULTM                                                          */
  FTM1_MODE_FAULTM_00                  = 0,     /*!< 00 : Fault control is disabled for all channels.                          */
  FTM1_MODE_FAULTM_01                  = 1,     /*!< 01 : Fault control is enabled for even channels only (channels
                                                     0, 2, 4, and 6), and the selected mode is the manual fault
                                                     clearing.                                                                 */
  FTM1_MODE_FAULTM_10                  = 2,     /*!< 10 : Fault control is enabled for all channels, and the selected
                                                     mode is the manual fault clearing.                                        */
  FTM1_MODE_FAULTM_11                  = 3,     /*!< 11 : Fault control is enabled for all channels, and the selected
                                                     mode is the automatic fault clearing.                                     */
} FTM1_MODE_FAULTM_Enum;

/* =============================================  FTM1 FTM1_MODE FAULTIE [7..7]  ============================================= */
typedef enum {                                  /*!< FTM1_MODE_FAULTIE                                                         */
  FTM1_MODE_FAULTIE_0                  = 0,     /*!< 0 : Fault control interrupt is disabled.                                  */
  FTM1_MODE_FAULTIE_1                  = 1,     /*!< 1 : Fault control interrupt is enabled.                                   */
} FTM1_MODE_FAULTIE_Enum;

/* =======================================================  FTM1_SYNC  ======================================================= */
/* =============================================  FTM1 FTM1_SYNC CNTMIN [0..0]  ============================================== */
typedef enum {                                  /*!< FTM1_SYNC_CNTMIN                                                          */
  FTM1_SYNC_CNTMIN_0                   = 0,     /*!< 0 : The minimum loading point is disabled.                                */
  FTM1_SYNC_CNTMIN_1                   = 1,     /*!< 1 : The minimum loading point is enabled.                                 */
} FTM1_SYNC_CNTMIN_Enum;

