nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  FTM1 FTM1_SYNC CNTMAX [1..1]  ============================================== */
typedef enum {                                  /*!< FTM1_SYNC_CNTMAX                                                          */
  FTM1_SYNC_CNTMAX_0                   = 0,     /*!< 0 : The maximum loading point is disabled.                                */
  FTM1_SYNC_CNTMAX_1                   = 1,     /*!< 1 : The maximum loading point is enabled.                                 */
} FTM1_SYNC_CNTMAX_Enum;

/* =============================================  FTM1 FTM1_SYNC REINIT [2..2]  ============================================== */
typedef enum {                                  /*!< FTM1_SYNC_REINIT                                                          */
  FTM1_SYNC_REINIT_0                   = 0,     /*!< 0 : FTM counter continues to count normally.                              */
  FTM1_SYNC_REINIT_1                   = 1,     /*!< 1 : FTM counter is updated with its initial value when the selected
                                                     trigger is detected.                                                      */
} FTM1_SYNC_REINIT_Enum;

/* =============================================  FTM1 FTM1_SYNC SYNCHOM [3..3]  ============================================= */
typedef enum {                                  /*!< FTM1_SYNC_SYNCHOM                                                         */
  FTM1_SYNC_SYNCHOM_0                  = 0,     /*!< 0 : OUTMASK register is updated with the value of its buffer
                                                     in all rising edges of the FTM input clock.                               */
  FTM1_SYNC_SYNCHOM_1                  = 1,     /*!< 1 : OUTMASK register is updated with the value of its buffer
                                                     only by the PWM synchronization.                                          */
} FTM1_SYNC_SYNCHOM_Enum;

/* ==============================================  FTM1 FTM1_SYNC TRIG0 [4..4]  ============================================== */
typedef enum {                                  /*!< FTM1_SYNC_TRIG0                                                           */
  FTM1_SYNC_TRIG0_0                    = 0,     /*!< 0 : Trigger is disabled.                                                  */
  FTM1_SYNC_TRIG0_1                    = 1,     /*!< 1 : Trigger is enabled.                                                   */
} FTM1_SYNC_TRIG0_Enum;

/* ==============================================  FTM1 FTM1_SYNC TRIG1 [5..5]  ============================================== */
typedef enum {                                  /*!< FTM1_SYNC_TRIG1                                                           */
  FTM1_SYNC_TRIG1_0                    = 0,     /*!< 0 : Trigger is disabled.                                                  */
  FTM1_SYNC_TRIG1_1                    = 1,     /*!< 1 : Trigger is enabled.                                                   */
} FTM1_SYNC_TRIG1_Enum;

/* ==============================================  FTM1 FTM1_SYNC TRIG2 [6..6]  ============================================== */
typedef enum {                                  /*!< FTM1_SYNC_TRIG2                                                           */
  FTM1_SYNC_TRIG2_0                    = 0,     /*!< 0 : Trigger is disabled.                                                  */
  FTM1_SYNC_TRIG2_1                    = 1,     /*!< 1 : Trigger is enabled.                                                   */
} FTM1_SYNC_TRIG2_Enum;

/* =============================================  FTM1 FTM1_SYNC SWSYNC [7..7]  ============================================== */
typedef enum {                                  /*!< FTM1_SYNC_SWSYNC                                                          */
  FTM1_SYNC_SWSYNC_0                   = 0,     /*!< 0 : Software trigger is not selected.                                     */
  FTM1_SYNC_SWSYNC_1                   = 1,     /*!< 1 : Software trigger is selected.                                         */
} FTM1_SYNC_SWSYNC_Enum;

/* =====================================================  FTM1_OUTINIT  ====================================================== */
/* ============================================  FTM1 FTM1_OUTINIT CH0OI [0..0]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTINIT_CH0OI                                                        */
  FTM1_OUTINIT_CH0OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM1_OUTINIT_CH0OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM1_OUTINIT_CH0OI_Enum;

/* ============================================  FTM1 FTM1_OUTINIT CH1OI [1..1]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTINIT_CH1OI                                                        */
  FTM1_OUTINIT_CH1OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM1_OUTINIT_CH1OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM1_OUTINIT_CH1OI_Enum;

/* ============================================  FTM1 FTM1_OUTINIT CH2OI [2..2]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTINIT_CH2OI                                                        */
  FTM1_OUTINIT_CH2OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM1_OUTINIT_CH2OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM1_OUTINIT_CH2OI_Enum;

/* ============================================  FTM1 FTM1_OUTINIT CH3OI [3..3]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTINIT_CH3OI                                                        */
  FTM1_OUTINIT_CH3OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM1_OUTINIT_CH3OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM1_OUTINIT_CH3OI_Enum;

/* ============================================  FTM1 FTM1_OUTINIT CH4OI [4..4]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTINIT_CH4OI                                                        */
  FTM1_OUTINIT_CH4OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM1_OUTINIT_CH4OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM1_OUTINIT_CH4OI_Enum;

/* ============================================  FTM1 FTM1_OUTINIT CH5OI [5..5]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTINIT_CH5OI                                                        */
  FTM1_OUTINIT_CH5OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM1_OUTINIT_CH5OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM1_OUTINIT_CH5OI_Enum;

