nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===========================================  FTM1 FTM1_COMBINE DTEN2 [20..20]  ============================================ */
typedef enum {                                  /*!< FTM1_COMBINE_DTEN2                                                        */
  FTM1_COMBINE_DTEN2_0                 = 0,     /*!< 0 : The deadtime insertion in this pair of channels is disabled.          */
  FTM1_COMBINE_DTEN2_1                 = 1,     /*!< 1 : The deadtime insertion in this pair of channels is enabled.           */
} FTM1_COMBINE_DTEN2_Enum;

/* ==========================================  FTM1 FTM1_COMBINE SYNCEN2 [21..21]  =========================================== */
typedef enum {                                  /*!< FTM1_COMBINE_SYNCEN2                                                      */
  FTM1_COMBINE_SYNCEN2_0               = 0,     /*!< 0 : The PWM synchronization in this pair of channels is disabled.         */
  FTM1_COMBINE_SYNCEN2_1               = 1,     /*!< 1 : The PWM synchronization in this pair of channels is enabled.          */
} FTM1_COMBINE_SYNCEN2_Enum;

/* ==========================================  FTM1 FTM1_COMBINE FAULTEN2 [22..22]  ========================================== */
typedef enum {                                  /*!< FTM1_COMBINE_FAULTEN2                                                     */
  FTM1_COMBINE_FAULTEN2_0              = 0,     /*!< 0 : The fault control in this pair of channels is disabled.               */
  FTM1_COMBINE_FAULTEN2_1              = 1,     /*!< 1 : The fault control in this pair of channels is enabled.                */
} FTM1_COMBINE_FAULTEN2_Enum;

/* ===========================================  FTM1 FTM1_COMBINE COMP3 [25..25]  ============================================ */
typedef enum {                                  /*!< FTM1_COMBINE_COMP3                                                        */
  FTM1_COMBINE_COMP3_0                 = 0,     /*!< 0 : The channel (n+1) output is the same as the channel (n)
                                                     output.                                                                   */
  FTM1_COMBINE_COMP3_1                 = 1,     /*!< 1 : The channel (n+1) output is the complement of the channel
                                                     (n) output.                                                               */
} FTM1_COMBINE_COMP3_Enum;

/* ===========================================  FTM1 FTM1_COMBINE DECAP3 [27..27]  =========================================== */
typedef enum {                                  /*!< FTM1_COMBINE_DECAP3                                                       */
  FTM1_COMBINE_DECAP3_0                = 0,     /*!< 0 : The dual edge captures are inactive.                                  */
  FTM1_COMBINE_DECAP3_1                = 1,     /*!< 1 : The dual edge captures are active.                                    */
} FTM1_COMBINE_DECAP3_Enum;

/* ===========================================  FTM1 FTM1_COMBINE DTEN3 [28..28]  ============================================ */
typedef enum {                                  /*!< FTM1_COMBINE_DTEN3                                                        */
  FTM1_COMBINE_DTEN3_0                 = 0,     /*!< 0 : The deadtime insertion in this pair of channels is disabled.          */
  FTM1_COMBINE_DTEN3_1                 = 1,     /*!< 1 : The deadtime insertion in this pair of channels is enabled.           */
} FTM1_COMBINE_DTEN3_Enum;

/* ==========================================  FTM1 FTM1_COMBINE SYNCEN3 [29..29]  =========================================== */
typedef enum {                                  /*!< FTM1_COMBINE_SYNCEN3                                                      */
  FTM1_COMBINE_SYNCEN3_0               = 0,     /*!< 0 : The PWM synchronization in this pair of channels is disabled.         */
  FTM1_COMBINE_SYNCEN3_1               = 1,     /*!< 1 : The PWM synchronization in this pair of channels is enabled.          */
} FTM1_COMBINE_SYNCEN3_Enum;

/* ==========================================  FTM1 FTM1_COMBINE FAULTEN3 [30..30]  ========================================== */
typedef enum {                                  /*!< FTM1_COMBINE_FAULTEN3                                                     */
  FTM1_COMBINE_FAULTEN3_0              = 0,     /*!< 0 : The fault control in this pair of channels is disabled.               */
  FTM1_COMBINE_FAULTEN3_1              = 1,     /*!< 1 : The fault control in this pair of channels is enabled.                */
} FTM1_COMBINE_FAULTEN3_Enum;

/* =====================================================  FTM1_DEADTIME  ===================================================== */
/* ============================================  FTM1 FTM1_DEADTIME DTPS [6..7]  ============================================= */
typedef enum {                                  /*!< FTM1_DEADTIME_DTPS                                                        */
  FTM1_DEADTIME_DTPS_0x_0              = 0,     /*!< 0x_0 : Divide the FTM input clock by 1.                                   */
  FTM1_DEADTIME_DTPS_0x_1              = 1,     /*!< 0x_1 : Divide the FTM input clock by 1.                                   */
  FTM1_DEADTIME_DTPS_10                = 2,     /*!< 10 : Divide the FTM input clock by 4.                                     */
  FTM1_DEADTIME_DTPS_11                = 3,     /*!< 11 : Divide the FTM input clock by 16.                                    */
} FTM1_DEADTIME_DTPS_Enum;

/* =====================================================  FTM1_EXTTRIG  ====================================================== */
/* ===========================================  FTM1 FTM1_EXTTRIG CH2TRIG [0..0]  ============================================ */
typedef enum {                                  /*!< FTM1_EXTTRIG_CH2TRIG                                                      */
  FTM1_EXTTRIG_CH2TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM1_EXTTRIG_CH2TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM1_EXTTRIG_CH2TRIG_Enum;

/* ===========================================  FTM1 FTM1_EXTTRIG CH3TRIG [1..1]  ============================================ */
typedef enum {                                  /*!< FTM1_EXTTRIG_CH3TRIG                                                      */
  FTM1_EXTTRIG_CH3TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM1_EXTTRIG_CH3TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM1_EXTTRIG_CH3TRIG_Enum;

