nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===========================================  FTM1 FTM1_EXTTRIG CH4TRIG [2..2]  ============================================ */
typedef enum {                                  /*!< FTM1_EXTTRIG_CH4TRIG                                                      */
  FTM1_EXTTRIG_CH4TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM1_EXTTRIG_CH4TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM1_EXTTRIG_CH4TRIG_Enum;

/* ===========================================  FTM1 FTM1_EXTTRIG CH5TRIG [3..3]  ============================================ */
typedef enum {                                  /*!< FTM1_EXTTRIG_CH5TRIG                                                      */
  FTM1_EXTTRIG_CH5TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM1_EXTTRIG_CH5TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM1_EXTTRIG_CH5TRIG_Enum;

/* ===========================================  FTM1 FTM1_EXTTRIG CH0TRIG [4..4]  ============================================ */
typedef enum {                                  /*!< FTM1_EXTTRIG_CH0TRIG                                                      */
  FTM1_EXTTRIG_CH0TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM1_EXTTRIG_CH0TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM1_EXTTRIG_CH0TRIG_Enum;

/* ===========================================  FTM1 FTM1_EXTTRIG CH1TRIG [5..5]  ============================================ */
typedef enum {                                  /*!< FTM1_EXTTRIG_CH1TRIG                                                      */
  FTM1_EXTTRIG_CH1TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM1_EXTTRIG_CH1TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM1_EXTTRIG_CH1TRIG_Enum;

/* ==========================================  FTM1 FTM1_EXTTRIG INITTRIGEN [6..6]  ========================================== */
typedef enum {                                  /*!< FTM1_EXTTRIG_INITTRIGEN                                                   */
  FTM1_EXTTRIG_INITTRIGEN_0            = 0,     /*!< 0 : The generation of initialization trigger is disabled.                 */
  FTM1_EXTTRIG_INITTRIGEN_1            = 1,     /*!< 1 : The generation of initialization trigger is enabled.                  */
} FTM1_EXTTRIG_INITTRIGEN_Enum;

/* ============================================  FTM1 FTM1_EXTTRIG TRIGF [7..7]  ============================================= */
typedef enum {                                  /*!< FTM1_EXTTRIG_TRIGF                                                        */
  FTM1_EXTTRIG_TRIGF_0                 = 0,     /*!< 0 : No channel trigger was generated.                                     */
  FTM1_EXTTRIG_TRIGF_1                 = 1,     /*!< 1 : A channel trigger was generated.                                      */
} FTM1_EXTTRIG_TRIGF_Enum;

/* ===========================================  FTM1 FTM1_EXTTRIG CH6TRIG [8..8]  ============================================ */
typedef enum {                                  /*!< FTM1_EXTTRIG_CH6TRIG                                                      */
  FTM1_EXTTRIG_CH6TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM1_EXTTRIG_CH6TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM1_EXTTRIG_CH6TRIG_Enum;

/* ===========================================  FTM1 FTM1_EXTTRIG CH7TRIG [9..9]  ============================================ */
typedef enum {                                  /*!< FTM1_EXTTRIG_CH7TRIG                                                      */
  FTM1_EXTTRIG_CH7TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM1_EXTTRIG_CH7TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM1_EXTTRIG_CH7TRIG_Enum;

/* =======================================================  FTM1_POL  ======================================================== */
/* ===============================================  FTM1 FTM1_POL POL0 [0..0]  =============================================== */
typedef enum {                                  /*!< FTM1_POL_POL0                                                             */
  FTM1_POL_POL0_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM1_POL_POL0_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM1_POL_POL0_Enum;

/* ===============================================  FTM1 FTM1_POL POL1 [1..1]  =============================================== */
typedef enum {                                  /*!< FTM1_POL_POL1                                                             */
  FTM1_POL_POL1_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM1_POL_POL1_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM1_POL_POL1_Enum;

/* ===============================================  FTM1 FTM1_POL POL2 [2..2]  =============================================== */
typedef enum {                                  /*!< FTM1_POL_POL2                                                             */
  FTM1_POL_POL2_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM1_POL_POL2_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM1_POL_POL2_Enum;

