nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===============================================  FTM1 FTM1_POL POL3 [3..3]  =============================================== */
typedef enum {                                  /*!< FTM1_POL_POL3                                                             */
  FTM1_POL_POL3_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM1_POL_POL3_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM1_POL_POL3_Enum;

/* ===============================================  FTM1 FTM1_POL POL4 [4..4]  =============================================== */
typedef enum {                                  /*!< FTM1_POL_POL4                                                             */
  FTM1_POL_POL4_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM1_POL_POL4_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM1_POL_POL4_Enum;

/* ===============================================  FTM1 FTM1_POL POL5 [5..5]  =============================================== */
typedef enum {                                  /*!< FTM1_POL_POL5                                                             */
  FTM1_POL_POL5_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM1_POL_POL5_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM1_POL_POL5_Enum;

/* ===============================================  FTM1 FTM1_POL POL6 [6..6]  =============================================== */
typedef enum {                                  /*!< FTM1_POL_POL6                                                             */
  FTM1_POL_POL6_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM1_POL_POL6_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM1_POL_POL6_Enum;

/* ===============================================  FTM1 FTM1_POL POL7 [7..7]  =============================================== */
typedef enum {                                  /*!< FTM1_POL_POL7                                                             */
  FTM1_POL_POL7_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM1_POL_POL7_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM1_POL_POL7_Enum;

/* =======================================================  FTM1_FMS  ======================================================== */
/* =============================================  FTM1 FTM1_FMS FAULTF0 [0..0]  ============================================== */
typedef enum {                                  /*!< FTM1_FMS_FAULTF0                                                          */
  FTM1_FMS_FAULTF0_0                   = 0,     /*!< 0 : No fault condition was detected at the fault input.                   */
  FTM1_FMS_FAULTF0_1                   = 1,     /*!< 1 : A fault condition was detected at the fault input.                    */
} FTM1_FMS_FAULTF0_Enum;

/* =============================================  FTM1 FTM1_FMS FAULTF1 [1..1]  ============================================== */
typedef enum {                                  /*!< FTM1_FMS_FAULTF1                                                          */
  FTM1_FMS_FAULTF1_0                   = 0,     /*!< 0 : No fault condition was detected at the fault input.                   */
  FTM1_FMS_FAULTF1_1                   = 1,     /*!< 1 : A fault condition was detected at the fault input.                    */
} FTM1_FMS_FAULTF1_Enum;

/* =============================================  FTM1 FTM1_FMS FAULTF2 [2..2]  ============================================== */
typedef enum {                                  /*!< FTM1_FMS_FAULTF2                                                          */
  FTM1_FMS_FAULTF2_0                   = 0,     /*!< 0 : No fault condition was detected at the fault input.                   */
  FTM1_FMS_FAULTF2_1                   = 1,     /*!< 1 : A fault condition was detected at the fault input.                    */
} FTM1_FMS_FAULTF2_Enum;

/* =============================================  FTM1 FTM1_FMS FAULTF3 [3..3]  ============================================== */
typedef enum {                                  /*!< FTM1_FMS_FAULTF3                                                          */
  FTM1_FMS_FAULTF3_0                   = 0,     /*!< 0 : No fault condition was detected at the fault input.                   */
  FTM1_FMS_FAULTF3_1                   = 1,     /*!< 1 : A fault condition was detected at the fault input.                    */
} FTM1_FMS_FAULTF3_Enum;

/* =============================================  FTM1 FTM1_FMS FAULTIN [5..5]  ============================================== */
typedef enum {                                  /*!< FTM1_FMS_FAULTIN                                                          */
  FTM1_FMS_FAULTIN_0                   = 0,     /*!< 0 : The logic OR of the enabled fault inputs is 0.                        */
  FTM1_FMS_FAULTIN_1                   = 1,     /*!< 1 : The logic OR of the enabled fault inputs is 1.                        */
} FTM1_FMS_FAULTIN_Enum;

/* ===============================================  FTM1 FTM1_FMS WPEN [6..6]  =============================================== */
typedef enum {                                  /*!< FTM1_FMS_WPEN                                                             */
  FTM1_FMS_WPEN_0                      = 0,     /*!< 0 : Write protection is disabled. Write protected bits can be
                                                     written.                                                                  */
  FTM1_FMS_WPEN_1                      = 1,     /*!< 1 : Write protection is enabled. Write protected bits cannot
                                                     be written.                                                               */
} FTM1_FMS_WPEN_Enum;

/* ==============================================  FTM1 FTM1_FMS FAULTF [7..7]  ============================================== */
typedef enum {                                  /*!< FTM1_FMS_FAULTF                                                           */
  FTM1_FMS_FAULTF_0                    = 0,     /*!< 0 : No fault condition was detected.                                      */
  FTM1_FMS_FAULTF_1                    = 1,     /*!< 1 : A fault condition was detected.                                       */
} FTM1_FMS_FAULTF_Enum;

