nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  FTM1 FTM1_SYNCONF SWOC [5..5]  ============================================= */
typedef enum {                                  /*!< FTM1_SYNCONF_SWOC                                                         */
  FTM1_SYNCONF_SWOC_0                  = 0,     /*!< 0 : SWOCTRL register is updated with its buffer value at all
                                                     rising edges of FTM input clock.                                          */
  FTM1_SYNCONF_SWOC_1                  = 1,     /*!< 1 : SWOCTRL register is updated with its buffer value by the
                                                     PWM synchronization.                                                      */
} FTM1_SYNCONF_SWOC_Enum;

/* ===========================================  FTM1 FTM1_SYNCONF SYNCMODE [7..7]  =========================================== */
typedef enum {                                  /*!< FTM1_SYNCONF_SYNCMODE                                                     */
  FTM1_SYNCONF_SYNCMODE_0              = 0,     /*!< 0 : Legacy PWM synchronization is selected.                               */
  FTM1_SYNCONF_SYNCMODE_1              = 1,     /*!< 1 : Enhanced PWM synchronization is selected.                             */
} FTM1_SYNCONF_SYNCMODE_Enum;

/* ===========================================  FTM1 FTM1_SYNCONF SWRSTCNT [8..8]  =========================================== */
typedef enum {                                  /*!< FTM1_SYNCONF_SWRSTCNT                                                     */
  FTM1_SYNCONF_SWRSTCNT_0              = 0,     /*!< 0 : The software trigger does not activate the FTM counter synchronization. */
  FTM1_SYNCONF_SWRSTCNT_1              = 1,     /*!< 1 : The software trigger activates the FTM counter synchronization.       */
} FTM1_SYNCONF_SWRSTCNT_Enum;

/* ===========================================  FTM1 FTM1_SYNCONF SWWRBUF [9..9]  ============================================ */
typedef enum {                                  /*!< FTM1_SYNCONF_SWWRBUF                                                      */
  FTM1_SYNCONF_SWWRBUF_0               = 0,     /*!< 0 : The software trigger does not activate MOD, HCR, CNTIN,
                                                     and CV registers synchronization.                                         */
  FTM1_SYNCONF_SWWRBUF_1               = 1,     /*!< 1 : The software trigger activates MOD, HCR, CNTIN, and CV registers
                                                     synchronization.                                                          */
} FTM1_SYNCONF_SWWRBUF_Enum;

/* ============================================  FTM1 FTM1_SYNCONF SWOM [10..10]  ============================================ */
typedef enum {                                  /*!< FTM1_SYNCONF_SWOM                                                         */
  FTM1_SYNCONF_SWOM_0                  = 0,     /*!< 0 : The software trigger does not activate the OUTMASK register
                                                     synchronization.                                                          */
  FTM1_SYNCONF_SWOM_1                  = 1,     /*!< 1 : The software trigger activates the OUTMASK register synchronization.  */
} FTM1_SYNCONF_SWOM_Enum;

/* ===========================================  FTM1 FTM1_SYNCONF SWINVC [11..11]  =========================================== */
typedef enum {                                  /*!< FTM1_SYNCONF_SWINVC                                                       */
  FTM1_SYNCONF_SWINVC_0                = 0,     /*!< 0 : The software trigger does not activate the INVCTRL register
                                                     synchronization.                                                          */
  FTM1_SYNCONF_SWINVC_1                = 1,     /*!< 1 : The software trigger activates the INVCTRL register synchronization.  */
} FTM1_SYNCONF_SWINVC_Enum;

/* ===========================================  FTM1 FTM1_SYNCONF SWSOC [12..12]  ============================================ */
typedef enum {                                  /*!< FTM1_SYNCONF_SWSOC                                                        */
  FTM1_SYNCONF_SWSOC_0                 = 0,     /*!< 0 : The software trigger does not activate the SWOCTRL register
                                                     synchronization.                                                          */
  FTM1_SYNCONF_SWSOC_1                 = 1,     /*!< 1 : The software trigger activates the SWOCTRL register synchronization.  */
} FTM1_SYNCONF_SWSOC_Enum;

/* ==========================================  FTM1 FTM1_SYNCONF HWRSTCNT [16..16]  ========================================== */
typedef enum {                                  /*!< FTM1_SYNCONF_HWRSTCNT                                                     */
  FTM1_SYNCONF_HWRSTCNT_0              = 0,     /*!< 0 : A hardware trigger does not activate the FTM counter synchronization. */
  FTM1_SYNCONF_HWRSTCNT_1              = 1,     /*!< 1 : A hardware trigger activates the FTM counter synchronization.         */
} FTM1_SYNCONF_HWRSTCNT_Enum;

/* ==========================================  FTM1 FTM1_SYNCONF HWWRBUF [17..17]  =========================================== */
typedef enum {                                  /*!< FTM1_SYNCONF_HWWRBUF                                                      */
  FTM1_SYNCONF_HWWRBUF_0               = 0,     /*!< 0 : A hardware trigger does not activate MOD, HCR, CNTIN, and
                                                     CV registers synchronization.                                             */
  FTM1_SYNCONF_HWWRBUF_1               = 1,     /*!< 1 : A hardware trigger activates MOD, HCR, CNTIN, and CV registers
                                                     synchronization.                                                          */
} FTM1_SYNCONF_HWWRBUF_Enum;

/* ============================================  FTM1 FTM1_SYNCONF HWOM [18..18]  ============================================ */
typedef enum {                                  /*!< FTM1_SYNCONF_HWOM                                                         */
  FTM1_SYNCONF_HWOM_0                  = 0,     /*!< 0 : A hardware trigger does not activate the OUTMASK register
                                                     synchronization.                                                          */
  FTM1_SYNCONF_HWOM_1                  = 1,     /*!< 1 : A hardware trigger activates the OUTMASK register synchronization.    */
} FTM1_SYNCONF_HWOM_Enum;

/* ===========================================  FTM1 FTM1_SYNCONF HWINVC [19..19]  =========================================== */
typedef enum {                                  /*!< FTM1_SYNCONF_HWINVC                                                       */
  FTM1_SYNCONF_HWINVC_0                = 0,     /*!< 0 : A hardware trigger does not activate the INVCTRL register
                                                     synchronization.                                                          */
  FTM1_SYNCONF_HWINVC_1                = 1,     /*!< 1 : A hardware trigger activates the INVCTRL register synchronization.    */
} FTM1_SYNCONF_HWINVC_Enum;

/* ===========================================  FTM1 FTM1_SYNCONF HWSOC [20..20]  ============================================ */
typedef enum {                                  /*!< FTM1_SYNCONF_HWSOC                                                        */
  FTM1_SYNCONF_HWSOC_0                 = 0,     /*!< 0 : A hardware trigger does not activate the SWOCTRL register
                                                     synchronization.                                                          */
  FTM1_SYNCONF_HWSOC_1                 = 1,     /*!< 1 : A hardware trigger activates the SWOCTRL register synchronization.    */
} FTM1_SYNCONF_HWSOC_Enum;

