nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  FTM1 FTM1_SWOCTRL CH0OCV [8..8]  ============================================ */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH0OCV                                                       */
  FTM1_SWOCTRL_CH0OCV_0                = 0,     /*!< 0 : The software output control forces 0 to the channel output.           */
  FTM1_SWOCTRL_CH0OCV_1                = 1,     /*!< 1 : The software output control forces 1 to the channel output.           */
} FTM1_SWOCTRL_CH0OCV_Enum;

/* ============================================  FTM1 FTM1_SWOCTRL CH1OCV [9..9]  ============================================ */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH1OCV                                                       */
  FTM1_SWOCTRL_CH1OCV_0                = 0,     /*!< 0 : The software output control forces 0 to the channel output.           */
  FTM1_SWOCTRL_CH1OCV_1                = 1,     /*!< 1 : The software output control forces 1 to the channel output.           */
} FTM1_SWOCTRL_CH1OCV_Enum;

/* ===========================================  FTM1 FTM1_SWOCTRL CH2OCV [10..10]  =========================================== */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH2OCV                                                       */
  FTM1_SWOCTRL_CH2OCV_0                = 0,     /*!< 0 : The software output control forces 0 to the channel output.           */
  FTM1_SWOCTRL_CH2OCV_1                = 1,     /*!< 1 : The software output control forces 1 to the channel output.           */
} FTM1_SWOCTRL_CH2OCV_Enum;

/* ===========================================  FTM1 FTM1_SWOCTRL CH3OCV [11..11]  =========================================== */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH3OCV                                                       */
  FTM1_SWOCTRL_CH3OCV_0                = 0,     /*!< 0 : The software output control forces 0 to the channel output.           */
  FTM1_SWOCTRL_CH3OCV_1                = 1,     /*!< 1 : The software output control forces 1 to the channel output.           */
} FTM1_SWOCTRL_CH3OCV_Enum;

/* ===========================================  FTM1 FTM1_SWOCTRL CH4OCV [12..12]  =========================================== */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH4OCV                                                       */
  FTM1_SWOCTRL_CH4OCV_0                = 0,     /*!< 0 : The software output control forces 0 to the channel output.           */
  FTM1_SWOCTRL_CH4OCV_1                = 1,     /*!< 1 : The software output control forces 1 to the channel output.           */
} FTM1_SWOCTRL_CH4OCV_Enum;

/* ===========================================  FTM1 FTM1_SWOCTRL CH5OCV [13..13]  =========================================== */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH5OCV                                                       */
  FTM1_SWOCTRL_CH5OCV_0                = 0,     /*!< 0 : The software output control forces 0 to the channel output.           */
  FTM1_SWOCTRL_CH5OCV_1                = 1,     /*!< 1 : The software output control forces 1 to the channel output.           */
} FTM1_SWOCTRL_CH5OCV_Enum;

/* ===========================================  FTM1 FTM1_SWOCTRL CH6OCV [14..14]  =========================================== */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH6OCV                                                       */
  FTM1_SWOCTRL_CH6OCV_0                = 0,     /*!< 0 : The software output control forces 0 to the channel output.           */
  FTM1_SWOCTRL_CH6OCV_1                = 1,     /*!< 1 : The software output control forces 1 to the channel output.           */
} FTM1_SWOCTRL_CH6OCV_Enum;

/* ===========================================  FTM1 FTM1_SWOCTRL CH7OCV [15..15]  =========================================== */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH7OCV                                                       */
  FTM1_SWOCTRL_CH7OCV_0                = 0,     /*!< 0 : The software output control forces 0 to the channel output.           */
  FTM1_SWOCTRL_CH7OCV_1                = 1,     /*!< 1 : The software output control forces 1 to the channel output.           */
} FTM1_SWOCTRL_CH7OCV_Enum;

/* =====================================================  FTM1_PWMLOAD  ====================================================== */
/* ============================================  FTM1 FTM1_PWMLOAD CH0SEL [0..0]  ============================================ */
typedef enum {                                  /*!< FTM1_PWMLOAD_CH0SEL                                                       */
  FTM1_PWMLOAD_CH0SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM1_PWMLOAD_CH0SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM1_PWMLOAD_CH0SEL_Enum;

/* ============================================  FTM1 FTM1_PWMLOAD CH1SEL [1..1]  ============================================ */
typedef enum {                                  /*!< FTM1_PWMLOAD_CH1SEL                                                       */
  FTM1_PWMLOAD_CH1SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM1_PWMLOAD_CH1SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM1_PWMLOAD_CH1SEL_Enum;

/* ============================================  FTM1 FTM1_PWMLOAD CH2SEL [2..2]  ============================================ */
typedef enum {                                  /*!< FTM1_PWMLOAD_CH2SEL                                                       */
  FTM1_PWMLOAD_CH2SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM1_PWMLOAD_CH2SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM1_PWMLOAD_CH2SEL_Enum;

/* ============================================  FTM1 FTM1_PWMLOAD CH3SEL [3..3]  ============================================ */
typedef enum {                                  /*!< FTM1_PWMLOAD_CH3SEL                                                       */
  FTM1_PWMLOAD_CH3SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM1_PWMLOAD_CH3SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM1_PWMLOAD_CH3SEL_Enum;

