nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  FTM1 FTM1_PWMLOAD CH4SEL [4..4]  ============================================ */
typedef enum {                                  /*!< FTM1_PWMLOAD_CH4SEL                                                       */
  FTM1_PWMLOAD_CH4SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM1_PWMLOAD_CH4SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM1_PWMLOAD_CH4SEL_Enum;

/* ============================================  FTM1 FTM1_PWMLOAD CH5SEL [5..5]  ============================================ */
typedef enum {                                  /*!< FTM1_PWMLOAD_CH5SEL                                                       */
  FTM1_PWMLOAD_CH5SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM1_PWMLOAD_CH5SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM1_PWMLOAD_CH5SEL_Enum;

/* ============================================  FTM1 FTM1_PWMLOAD CH6SEL [6..6]  ============================================ */
typedef enum {                                  /*!< FTM1_PWMLOAD_CH6SEL                                                       */
  FTM1_PWMLOAD_CH6SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM1_PWMLOAD_CH6SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM1_PWMLOAD_CH6SEL_Enum;

/* ============================================  FTM1 FTM1_PWMLOAD CH7SEL [7..7]  ============================================ */
typedef enum {                                  /*!< FTM1_PWMLOAD_CH7SEL                                                       */
  FTM1_PWMLOAD_CH7SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM1_PWMLOAD_CH7SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM1_PWMLOAD_CH7SEL_Enum;

/* ============================================  FTM1 FTM1_PWMLOAD HCSEL [8..8]  ============================================= */
typedef enum {                                  /*!< FTM1_PWMLOAD_HCSEL                                                        */
  FTM1_PWMLOAD_HCSEL_0                 = 0,     /*!< 0 : Half cycle reload is disabled and it is not considered as
                                                     a reload opportunity.                                                     */
  FTM1_PWMLOAD_HCSEL_1                 = 1,     /*!< 1 : Half cycle reload is enabled and it is considered as a reload
                                                     opportunity.                                                              */
} FTM1_PWMLOAD_HCSEL_Enum;

/* =============================================  FTM1 FTM1_PWMLOAD LDOK [9..9]  ============================================= */
typedef enum {                                  /*!< FTM1_PWMLOAD_LDOK                                                         */
  FTM1_PWMLOAD_LDOK_0                  = 0,     /*!< 0 : Loading updated values is disabled.                                   */
  FTM1_PWMLOAD_LDOK_1                  = 1,     /*!< 1 : Loading updated values is enabled.                                    */
} FTM1_PWMLOAD_LDOK_Enum;

/* ============================================  FTM1 FTM1_PWMLOAD GLEN [10..10]  ============================================ */
typedef enum {                                  /*!< FTM1_PWMLOAD_GLEN                                                         */
  FTM1_PWMLOAD_GLEN_0                  = 0,     /*!< 0 : Global Load Ok disabled.                                              */
  FTM1_PWMLOAD_GLEN_1                  = 1,     /*!< 1 : Global Load OK enabled. A pulse event on the module global
                                                     load input sets the LDOK bit.                                             */
} FTM1_PWMLOAD_GLEN_Enum;

/* ===========================================  FTM1 FTM1_PWMLOAD GLDOK [11..11]  ============================================ */
typedef enum {                                  /*!< FTM1_PWMLOAD_GLDOK                                                        */
  FTM1_PWMLOAD_GLDOK_0                 = 0,     /*!< 0 : No action.                                                            */
  FTM1_PWMLOAD_GLDOK_1                 = 1,     /*!< 1 : LDOK bit is set.                                                      */
} FTM1_PWMLOAD_GLDOK_Enum;

/* =======================================================  FTM1_HCR  ======================================================== */
/* ==================================================  FTM1_PAIR0DEADTIME  =================================================== */
/* ==========================================  FTM1 FTM1_PAIR0DEADTIME DTPS [6..7]  ========================================== */
typedef enum {                                  /*!< FTM1_PAIR0DEADTIME_DTPS                                                   */
  FTM1_PAIR0DEADTIME_DTPS_0x_0         = 0,     /*!< 0x_0 : Divide the FTM input clock by 1.                                   */
  FTM1_PAIR0DEADTIME_DTPS_0x_1         = 1,     /*!< 0x_1 : Divide the FTM input clock by 1.                                   */
  FTM1_PAIR0DEADTIME_DTPS_10           = 2,     /*!< 10 : Divide the FTM input clock by 4.                                     */
  FTM1_PAIR0DEADTIME_DTPS_11           = 3,     /*!< 11 : Divide the FTM input clock by 16.                                    */
} FTM1_PAIR0DEADTIME_DTPS_Enum;

/* ==================================================  FTM1_PAIR1DEADTIME  =================================================== */
/* ==========================================  FTM1 FTM1_PAIR1DEADTIME DTPS [6..7]  ========================================== */
typedef enum {                                  /*!< FTM1_PAIR1DEADTIME_DTPS                                                   */
  FTM1_PAIR1DEADTIME_DTPS_0x_0         = 0,     /*!< 0x_0 : Divide the FTM input clock by 1.                                   */
  FTM1_PAIR1DEADTIME_DTPS_0x_1         = 1,     /*!< 0x_1 : Divide the FTM input clock by 1.                                   */
  FTM1_PAIR1DEADTIME_DTPS_10           = 2,     /*!< 10 : Divide the FTM input clock by 4.                                     */
  FTM1_PAIR1DEADTIME_DTPS_11           = 3,     /*!< 11 : Divide the FTM input clock by 16.                                    */
} FTM1_PAIR1DEADTIME_DTPS_Enum;

/* ==================================================  FTM1_PAIR2DEADTIME  =================================================== */
/* ==========================================  FTM1 FTM1_PAIR2DEADTIME DTPS [6..7]  ========================================== */
typedef enum {                                  /*!< FTM1_PAIR2DEADTIME_DTPS                                                   */
  FTM1_PAIR2DEADTIME_DTPS_0x_0         = 0,     /*!< 0x_0 : Divide the FTM input clock by 1.                                   */
  FTM1_PAIR2DEADTIME_DTPS_0x_1         = 1,     /*!< 0x_1 : Divide the FTM input clock by 1.                                   */
  FTM1_PAIR2DEADTIME_DTPS_10           = 2,     /*!< 10 : Divide the FTM input clock by 4.                                     */
  FTM1_PAIR2DEADTIME_DTPS_11           = 3,     /*!< 11 : Divide the FTM input clock by 16.                                    */
} FTM1_PAIR2DEADTIME_DTPS_Enum;

/* ==================================================  FTM1_PAIR3DEADTIME  =================================================== */
/* ==========================================  FTM1 FTM1_PAIR3DEADTIME DTPS [6..7]  ========================================== */
typedef enum {                                  /*!< FTM1_PAIR3DEADTIME_DTPS                                                   */
  FTM1_PAIR3DEADTIME_DTPS_0x_0         = 0,     /*!< 0x_0 : Divide the FTM input clock by 1.                                   */
  FTM1_PAIR3DEADTIME_DTPS_0x_1         = 1,     /*!< 0x_1 : Divide the FTM input clock by 1.                                   */
  FTM1_PAIR3DEADTIME_DTPS_10           = 2,     /*!< 10 : Divide the FTM input clock by 4.                                     */
  FTM1_PAIR3DEADTIME_DTPS_11           = 3,     /*!< 11 : Divide the FTM input clock by 16.                                    */
} FTM1_PAIR3DEADTIME_DTPS_Enum;

/* ====================================================  FTM1_MOD_MIRROR  ==================================================== */
/* ====================================================  FTM1_C0V_MIRROR  ==================================================== */
/* ====================================================  FTM1_C1V_MIRROR  ==================================================== */
/* ====================================================  FTM1_C2V_MIRROR  ==================================================== */
/* ====================================================  FTM1_C3V_MIRROR  ==================================================== */
/* ====================================================  FTM1_C4V_MIRROR  ==================================================== */
/* ====================================================  FTM1_C5V_MIRROR  ==================================================== */
/* ====================================================  FTM1_C6V_MIRROR  ==================================================== */
/* ====================================================  FTM1_C7V_MIRROR  ==================================================== */


/* =========================================================================================================================== */
/* ================                                           ADC0                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  ADC0_SC1A  ======================================================= */
/* ==============================================  ADC0 ADC0_SC1A ADCH [0..4]  =============================================== */
typedef enum {                                  /*!< ADC0_SC1_SC1_SC1A_ADCH                                                    */
  ADC0_SC1_SC1_SC1A_ADCH_00000         = 0,     /*!< 00000 : Exernal channel 0 is selected as input.                           */
  ADC0_SC1_SC1_SC1A_ADCH_00001         = 1,     /*!< 00001 : Exernal channel 1 is selected as input.                           */
  ADC0_SC1_SC1_SC1A_ADCH_00010         = 2,     /*!< 00010 : Exernal channel 2 is selected as input.                           */
  ADC0_SC1_SC1_SC1A_ADCH_00011         = 3,     /*!< 00011 : Exernal channel 3 is selected as input.                           */
  ADC0_SC1_SC1_SC1A_ADCH_00100         = 4,     /*!< 00100 : Exernal channel 4 is selected as input.                           */
  ADC0_SC1_SC1_SC1A_ADCH_00101         = 5,     /*!< 00101 : Exernal channel 5 is selected as input.                           */
  ADC0_SC1_SC1_SC1A_ADCH_00110         = 6,     /*!< 00110 : Exernal channel 6 is selected as input.                           */
  ADC0_SC1_SC1_SC1A_ADCH_00111         = 7,     /*!< 00111 : Exernal channel 7 is selected as input.                           */
  ADC0_SC1_SC1_SC1A_ADCH_01000         = 8,     /*!< 01000 : Exernal channel 8 is selected as input.                           */
  ADC0_SC1_SC1_SC1A_ADCH_01001         = 9,     /*!< 01001 : Exernal channel 9 is selected as input.                           */
  ADC0_SC1_SC1_SC1A_ADCH_01010         = 10,    /*!< 01010 : Exernal channel 10 is selected as input.                          */
  ADC0_SC1_SC1_SC1A_ADCH_01011         = 11,    /*!< 01011 : Exernal channel 11 is selected as input.                          */
  ADC0_SC1_SC1_SC1A_ADCH_01100         = 12,    /*!< 01100 : Exernal channel 12 is selected as input.                          */
  ADC0_SC1_SC1_SC1A_ADCH_01101         = 13,    /*!< 01101 : Exernal channel 13 is selected as input.                          */
  ADC0_SC1_SC1_SC1A_ADCH_01110         = 14,    /*!< 01110 : Exernal channel 14 is selected as input.                          */
  ADC0_SC1_SC1_SC1A_ADCH_01111         = 15,    /*!< 01111 : Exernal channel 15 is selected as input.                          */
  ADC0_SC1_SC1_SC1A_ADCH_10010         = 18,    /*!< 10010 : Exernal channel 18 is selected as input.                          */
  ADC0_SC1_SC1_SC1A_ADCH_10011         = 19,    /*!< 10011 : Exernal channel 19 is selected as input.                          */
  ADC0_SC1_SC1_SC1A_ADCH_10101         = 21,    /*!< 10101 : Internal channel 0 is selected as input.                          */
  ADC0_SC1_SC1_SC1A_ADCH_10110         = 22,    /*!< 10110 : Internal channel 1 is selected as input.                          */
  ADC0_SC1_SC1_SC1A_ADCH_10111         = 23,    /*!< 10111 : Internal channel 2 is selected as input.                          */
  ADC0_SC1_SC1_SC1A_ADCH_11010         = 26,    /*!< 11010 : Temp Sensor                                                       */
  ADC0_SC1_SC1_SC1A_ADCH_11011         = 27,    /*!< 11011 : Band Gap                                                          */
  ADC0_SC1_SC1_SC1A_ADCH_11100         = 28,    /*!< 11100 : Internal channel 3 is selected as input.                          */
  ADC0_SC1_SC1_SC1A_ADCH_11101         = 29,    /*!< 11101 : VREFSH is selected as input. Voltage reference selected
                                                     is determined by SC2[REFSEL].                                             */
  ADC0_SC1_SC1_SC1A_ADCH_11110         = 30,    /*!< 11110 : VREFSL is selected as input. Voltage reference selected
                                                     is determined by SC2[REFSEL].                                             */
  ADC0_SC1_SC1_SC1A_ADCH_11111         = 31,    /*!< 11111 : Module is disabled                                                */
} ADC0_SC1_SC1_SC1A_ADCH_Enum;

/* ==============================================  ADC0 ADC0_SC1A AIEN [6..6]  =============================================== */
typedef enum {                                  /*!< ADC0_SC1_SC1_SC1A_AIEN                                                    */
  ADC0_SC1_SC1_SC1A_AIEN_0             = 0,     /*!< 0 : Conversion complete interrupt is disabled.                            */
  ADC0_SC1_SC1_SC1A_AIEN_1             = 1,     /*!< 1 : Conversion complete interrupt is enabled.                             */
} ADC0_SC1_SC1_SC1A_AIEN_Enum;

/* ==============================================  ADC0 ADC0_SC1A COCO [7..7]  =============================================== */
typedef enum {                                  /*!< ADC0_SC1_SC1_SC1A_COCO                                                    */
  ADC0_SC1_SC1_SC1A_COCO_0             = 0,     /*!< 0 : Conversion is not completed.                                          */
  ADC0_SC1_SC1_SC1A_COCO_1             = 1,     /*!< 1 : Conversion is completed.                                              */
} ADC0_SC1_SC1_SC1A_COCO_Enum;

/* =======================================================  ADC0_SC1B  ======================================================= */
/* ==============================================  ADC0 ADC0_SC1B ADCH [0..4]  =============================================== */
typedef enum {                                  /*!< ADC0_SC1_SC1_SC1B_ADCH                                                    */
  ADC0_SC1_SC1_SC1B_ADCH_00000         = 0,     /*!< 00000 : Exernal channel 0 is selected as input.                           */
  ADC0_SC1_SC1_SC1B_ADCH_00001         = 1,     /*!< 00001 : Exernal channel 1 is selected as input.                           */
  ADC0_SC1_SC1_SC1B_ADCH_00010         = 2,     /*!< 00010 : Exernal channel 2 is selected as input.                           */
  ADC0_SC1_SC1_SC1B_ADCH_00011         = 3,     /*!< 00011 : Exernal channel 3 is selected as input.                           */
  ADC0_SC1_SC1_SC1B_ADCH_00100         = 4,     /*!< 00100 : Exernal channel 4 is selected as input.                           */
  ADC0_SC1_SC1_SC1B_ADCH_00101         = 5,     /*!< 00101 : Exernal channel 5 is selected as input.                           */
  ADC0_SC1_SC1_SC1B_ADCH_00110         = 6,     /*!< 00110 : Exernal channel 6 is selected as input.                           */
  ADC0_SC1_SC1_SC1B_ADCH_00111         = 7,     /*!< 00111 : Exernal channel 7 is selected as input.                           */
  ADC0_SC1_SC1_SC1B_ADCH_01000         = 8,     /*!< 01000 : Exernal channel 8 is selected as input.                           */
  ADC0_SC1_SC1_SC1B_ADCH_01001         = 9,     /*!< 01001 : Exernal channel 9 is selected as input.                           */
  ADC0_SC1_SC1_SC1B_ADCH_01010         = 10,    /*!< 01010 : Exernal channel 10 is selected as input.                          */
  ADC0_SC1_SC1_SC1B_ADCH_01011         = 11,    /*!< 01011 : Exernal channel 11 is selected as input.                          */
  ADC0_SC1_SC1_SC1B_ADCH_01100         = 12,    /*!< 01100 : Exernal channel 12 is selected as input.                          */
  ADC0_SC1_SC1_SC1B_ADCH_01101         = 13,    /*!< 01101 : Exernal channel 13 is selected as input.                          */
  ADC0_SC1_SC1_SC1B_ADCH_01110         = 14,    /*!< 01110 : Exernal channel 14 is selected as input.                          */
  ADC0_SC1_SC1_SC1B_ADCH_01111         = 15,    /*!< 01111 : Exernal channel 15 is selected as input.                          */
  ADC0_SC1_SC1_SC1B_ADCH_10010         = 18,    /*!< 10010 : Exernal channel 18 is selected as input.                          */
  ADC0_SC1_SC1_SC1B_ADCH_10011         = 19,    /*!< 10011 : Exernal channel 19 is selected as input.                          */
  ADC0_SC1_SC1_SC1B_ADCH_10101         = 21,    /*!< 10101 : Internal channel 0 is selected as input.                          */
  ADC0_SC1_SC1_SC1B_ADCH_10110         = 22,    /*!< 10110 : Internal channel 1 is selected as input.                          */
  ADC0_SC1_SC1_SC1B_ADCH_10111         = 23,    /*!< 10111 : Internal channel 2 is selected as input.                          */
  ADC0_SC1_SC1_SC1B_ADCH_11010         = 26,    /*!< 11010 : Temp Sensor                                                       */
  ADC0_SC1_SC1_SC1B_ADCH_11011         = 27,    /*!< 11011 : Band Gap                                                          */
  ADC0_SC1_SC1_SC1B_ADCH_11100         = 28,    /*!< 11100 : Internal channel 3 is selected as input.                          */
  ADC0_SC1_SC1_SC1B_ADCH_11101         = 29,    /*!< 11101 : VREFSH is selected as input. Voltage reference selected
                                                     is determined by SC2[REFSEL].                                             */
  ADC0_SC1_SC1_SC1B_ADCH_11110         = 30,    /*!< 11110 : VREFSL is selected as input. Voltage reference selected
                                                     is determined by SC2[REFSEL].                                             */
  ADC0_SC1_SC1_SC1B_ADCH_11111         = 31,    /*!< 11111 : Module is disabled                                                */
} ADC0_SC1_SC1_SC1B_ADCH_Enum;

/* ==============================================  ADC0 ADC0_SC1B AIEN [6..6]  =============================================== */
typedef enum {                                  /*!< ADC0_SC1_SC1_SC1B_AIEN                                                    */
  ADC0_SC1_SC1_SC1B_AIEN_0             = 0,     /*!< 0 : Conversion complete interrupt is disabled.                            */
  ADC0_SC1_SC1_SC1B_AIEN_1             = 1,     /*!< 1 : Conversion complete interrupt is enabled.                             */
} ADC0_SC1_SC1_SC1B_AIEN_Enum;

/* ==============================================  ADC0 ADC0_SC1B COCO [7..7]  =============================================== */
typedef enum {                                  /*!< ADC0_SC1_SC1_SC1B_COCO                                                    */
  ADC0_SC1_SC1_SC1B_COCO_0             = 0,     /*!< 0 : Conversion is not completed.                                          */
  ADC0_SC1_SC1_SC1B_COCO_1             = 1,     /*!< 1 : Conversion is completed.                                              */
} ADC0_SC1_SC1_SC1B_COCO_Enum;

