nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  ADC0 ADC0_SC2 TRGSTLAT [16..19]  ============================================ */
typedef enum {                                  /*!< ADC0_SC2_TRGSTLAT                                                         */
  ADC0_SC2_TRGSTLAT_0                  = 0,     /*!< 0 : No trigger request has been latched                                   */
  ADC0_SC2_TRGSTLAT_1                  = 1,     /*!< 1 : A trigger request has been latched                                    */
} ADC0_SC2_TRGSTLAT_Enum;

/* ============================================  ADC0 ADC0_SC2 TRGSTERR [24..27]  ============================================ */
typedef enum {                                  /*!< ADC0_SC2_TRGSTERR                                                         */
  ADC0_SC2_TRGSTERR_0                  = 0,     /*!< 0 : No error has occurred                                                 */
  ADC0_SC2_TRGSTERR_1                  = 1,     /*!< 1 : An error has occurred                                                 */
} ADC0_SC2_TRGSTERR_Enum;

/* =======================================================  ADC0_SC3  ======================================================== */
/* ===============================================  ADC0 ADC0_SC3 AVGS [0..1]  =============================================== */
typedef enum {                                  /*!< ADC0_SC3_AVGS                                                             */
  ADC0_SC3_AVGS_00                     = 0,     /*!< 00 : 4 samples averaged.                                                  */
  ADC0_SC3_AVGS_01                     = 1,     /*!< 01 : 8 samples averaged.                                                  */
  ADC0_SC3_AVGS_10                     = 2,     /*!< 10 : 16 samples averaged.                                                 */
  ADC0_SC3_AVGS_11                     = 3,     /*!< 11 : 32 samples averaged.                                                 */
} ADC0_SC3_AVGS_Enum;

/* ===============================================  ADC0 ADC0_SC3 AVGE [2..2]  =============================================== */
typedef enum {                                  /*!< ADC0_SC3_AVGE                                                             */
  ADC0_SC3_AVGE_0                      = 0,     /*!< 0 : Hardware average function disabled.                                   */
  ADC0_SC3_AVGE_1                      = 1,     /*!< 1 : Hardware average function enabled.                                    */
} ADC0_SC3_AVGE_Enum;

/* ===============================================  ADC0 ADC0_SC3 ADCO [3..3]  =============================================== */
typedef enum {                                  /*!< ADC0_SC3_ADCO                                                             */
  ADC0_SC3_ADCO_0                      = 0,     /*!< 0 : One conversion will be performed (or one set of conversions,
                                                     if AVGE is set) after a conversion is initiated.                          */
  ADC0_SC3_ADCO_1                      = 1,     /*!< 1 : Continuous conversions will be performed (or continuous
                                                     sets of conversions, if AVGE is set) after a conversion
                                                     is initiated.                                                             */
} ADC0_SC3_ADCO_Enum;

/* =====================================================  ADC0_BASE_OFS  ===================================================== */
/* =======================================================  ADC0_OFS  ======================================================== */
/* =====================================================  ADC0_USR_OFS  ====================================================== */
/* =======================================================  ADC0_XOFS  ======================================================= */
/* =======================================================  ADC0_YOFS  ======================================================= */
/* ========================================================  ADC0_G  ========================================================= */
/* ========================================================  ADC0_UG  ======================================================== */
/* =======================================================  ADC0_CLPS  ======================================================= */
/* =======================================================  ADC0_CLP3  ======================================================= */
/* =======================================================  ADC0_CLP2  ======================================================= */
/* =======================================================  ADC0_CLP1  ======================================================= */
/* =======================================================  ADC0_CLP0  ======================================================= */
/* =======================================================  ADC0_CLPX  ======================================================= */
/* =======================================================  ADC0_CLP9  ======================================================= */
/* =====================================================  ADC0_CLPS_OFS  ===================================================== */
/* =====================================================  ADC0_CLP3_OFS  ===================================================== */
/* =====================================================  ADC0_CLP2_OFS  ===================================================== */
/* =====================================================  ADC0_CLP1_OFS  ===================================================== */
/* =====================================================  ADC0_CLP0_OFS  ===================================================== */
/* =====================================================  ADC0_CLPX_OFS  ===================================================== */
/* =====================================================  ADC0_CLP9_OFS  ===================================================== */


/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  RTC_TSR  ======================================================== */
/* ========================================================  RTC_TPR  ======================================================== */
/* ========================================================  RTC_TAR  ======================================================== */
/* ========================================================  RTC_TCR  ======================================================== */
/* ================================================  RTC RTC_TCR TCR [0..7]  ================================================= */
typedef enum {                                  /*!< RTC_TCR_TCR                                                               */
  RTC_TCR_TCR_10000000                 = 128,   /*!< 10000000 : Time Prescaler Register overflows every 32896 clock
                                                     cycles.                                                                   */
  RTC_TCR_TCR_10000001                 = 129,   /*!< 10000001 : Time Prescaler Register overflows every 32895 clock
                                                     cycles.                                                                   */
  RTC_TCR_TCR_11111111                 = 255,   /*!< 11111111 : Time Prescaler Register overflows every 32769 clock
                                                     cycles.                                                                   */
  RTC_TCR_TCR_00000000                 = 0,     /*!< 00000000 : Time Prescaler Register overflows every 32768 clock
                                                     cycles.                                                                   */
  RTC_TCR_TCR_00000001                 = 1,     /*!< 00000001 : Time Prescaler Register overflows every 32767 clock
                                                     cycles.                                                                   */
  RTC_TCR_TCR_01111110                 = 126,   /*!< 01111110 : Time Prescaler Register overflows every 32642 clock
                                                     cycles.                                                                   */
  RTC_TCR_TCR_01111111                 = 127,   /*!< 01111111 : Time Prescaler Register overflows every 32641 clock
                                                     cycles.                                                                   */
} RTC_TCR_TCR_Enum;

/* ========================================================  RTC_CR  ========================================================= */
/* =================================================  RTC RTC_CR SWR [0..0]  ================================================= */
typedef enum {                                  /*!< RTC_CR_SWR                                                                */
  RTC_CR_SWR_0                         = 0,     /*!< 0 : No effect.                                                            */
} RTC_CR_SWR_Enum;

/* =================================================  RTC RTC_CR SUP [2..2]  ================================================= */
typedef enum {                                  /*!< RTC_CR_SUP                                                                */
  RTC_CR_SUP_0                         = 0,     /*!< 0 : Non-supervisor mode write accesses are not supported and
                                                     generate a bus error.                                                     */
  RTC_CR_SUP_1                         = 1,     /*!< 1 : Non-supervisor mode write accesses are supported.                     */
} RTC_CR_SUP_Enum;

/* =================================================  RTC RTC_CR UM [3..3]  ================================================== */
typedef enum {                                  /*!< RTC_CR_UM                                                                 */
  RTC_CR_UM_0                          = 0,     /*!< 0 : Registers cannot be written when locked.                              */
  RTC_CR_UM_1                          = 1,     /*!< 1 : Registers can be written when locked under limited conditions.        */
} RTC_CR_UM_Enum;

/* =================================================  RTC RTC_CR CPS [5..5]  ================================================= */
typedef enum {                                  /*!< RTC_CR_CPS                                                                */
  RTC_CR_CPS_0                         = 0,     /*!< 0 : The prescaler output clock (as configured by TSIC) is output
                                                     on RTC_CLKOUT.                                                            */
  RTC_CR_CPS_1                         = 1,     /*!< 1 : The RTC 32.768 kHz clock is output on RTC_CLKOUT, provided
                                                     it is output to other peripherals.                                        */
} RTC_CR_CPS_Enum;

/* ================================================  RTC RTC_CR LPOS [7..7]  ================================================= */
typedef enum {                                  /*!< RTC_CR_LPOS                                                               */
  RTC_CR_LPOS_0                        = 0,     /*!< 0 : RTC prescaler increments using 32.768 kHz clock.                      */
  RTC_CR_LPOS_1                        = 1,     /*!< 1 : RTC prescaler increments using 1 kHz LPO, bits [4:0] of
                                                     the prescaler are ignored.                                                */
} RTC_CR_LPOS_Enum;

/* ================================================  RTC RTC_CR CLKO [9..9]  ================================================= */
typedef enum {                                  /*!< RTC_CR_CLKO                                                               */
  RTC_CR_CLKO_0                        = 0,     /*!< 0 : The 32 kHz clock is output to other peripherals.                      */
  RTC_CR_CLKO_1                        = 1,     /*!< 1 : The 32 kHz clock is not output to other peripherals.                  */
} RTC_CR_CLKO_Enum;

