nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ================================================  RTC RTC_CR CPE [24..24]  ================================================ */
typedef enum {                                  /*!< RTC_CR_CPE                                                                */
  RTC_CR_CPE_0                         = 0,     /*!< 0 : The RTC_CLKOUT function is disabled.                                  */
  RTC_CR_CPE_1                         = 1,     /*!< 1 : Enable RTC_CLKOUT function.                                           */
} RTC_CR_CPE_Enum;

/* ========================================================  RTC_SR  ========================================================= */
/* =================================================  RTC RTC_SR TIF [0..0]  ================================================= */
typedef enum {                                  /*!< RTC_SR_TIF                                                                */
  RTC_SR_TIF_0                         = 0,     /*!< 0 : Time is valid.                                                        */
  RTC_SR_TIF_1                         = 1,     /*!< 1 : Time is invalid and time counter is read as zero.                     */
} RTC_SR_TIF_Enum;

/* =================================================  RTC RTC_SR TOF [1..1]  ================================================= */
typedef enum {                                  /*!< RTC_SR_TOF                                                                */
  RTC_SR_TOF_0                         = 0,     /*!< 0 : Time overflow has not occurred.                                       */
  RTC_SR_TOF_1                         = 1,     /*!< 1 : Time overflow has occurred and time counter is read as zero.          */
} RTC_SR_TOF_Enum;

/* =================================================  RTC RTC_SR TAF [2..2]  ================================================= */
typedef enum {                                  /*!< RTC_SR_TAF                                                                */
  RTC_SR_TAF_0                         = 0,     /*!< 0 : Time alarm has not occurred.                                          */
  RTC_SR_TAF_1                         = 1,     /*!< 1 : Time alarm has occurred.                                              */
} RTC_SR_TAF_Enum;

/* =================================================  RTC RTC_SR TCE [4..4]  ================================================= */
typedef enum {                                  /*!< RTC_SR_TCE                                                                */
  RTC_SR_TCE_0                         = 0,     /*!< 0 : Time counter is disabled.                                             */
  RTC_SR_TCE_1                         = 1,     /*!< 1 : Time counter is enabled.                                              */
} RTC_SR_TCE_Enum;

/* ========================================================  RTC_LR  ========================================================= */
/* =================================================  RTC RTC_LR TCL [3..3]  ================================================= */
typedef enum {                                  /*!< RTC_LR_TCL                                                                */
  RTC_LR_TCL_0                         = 0,     /*!< 0 : Time Compensation Register is locked and writes are ignored.          */
  RTC_LR_TCL_1                         = 1,     /*!< 1 : Time Compensation Register is not locked and writes complete
                                                     as normal.                                                                */
} RTC_LR_TCL_Enum;

/* =================================================  RTC RTC_LR CRL [4..4]  ================================================= */
typedef enum {                                  /*!< RTC_LR_CRL                                                                */
  RTC_LR_CRL_0                         = 0,     /*!< 0 : Control Register is locked and writes are ignored.                    */
  RTC_LR_CRL_1                         = 1,     /*!< 1 : Control Register is not locked and writes complete as normal.         */
} RTC_LR_CRL_Enum;

/* =================================================  RTC RTC_LR SRL [5..5]  ================================================= */
typedef enum {                                  /*!< RTC_LR_SRL                                                                */
  RTC_LR_SRL_0                         = 0,     /*!< 0 : Status Register is locked and writes are ignored.                     */
  RTC_LR_SRL_1                         = 1,     /*!< 1 : Status Register is not locked and writes complete as normal.          */
} RTC_LR_SRL_Enum;

/* =================================================  RTC RTC_LR LRL [6..6]  ================================================= */
typedef enum {                                  /*!< RTC_LR_LRL                                                                */
  RTC_LR_LRL_0                         = 0,     /*!< 0 : Lock Register is locked and writes are ignored.                       */
  RTC_LR_LRL_1                         = 1,     /*!< 1 : Lock Register is not locked and writes complete as normal.            */
} RTC_LR_LRL_Enum;

/* ========================================================  RTC_IER  ======================================================== */
/* ================================================  RTC RTC_IER TIIE [0..0]  ================================================ */
typedef enum {                                  /*!< RTC_IER_TIIE                                                              */
  RTC_IER_TIIE_0                       = 0,     /*!< 0 : Time invalid flag does not generate an interrupt.                     */
  RTC_IER_TIIE_1                       = 1,     /*!< 1 : Time invalid flag does generate an interrupt.                         */
} RTC_IER_TIIE_Enum;

/* ================================================  RTC RTC_IER TOIE [1..1]  ================================================ */
typedef enum {                                  /*!< RTC_IER_TOIE                                                              */
  RTC_IER_TOIE_0                       = 0,     /*!< 0 : Time overflow flag does not generate an interrupt.                    */
  RTC_IER_TOIE_1                       = 1,     /*!< 1 : Time overflow flag does generate an interrupt.                        */
} RTC_IER_TOIE_Enum;

/* ================================================  RTC RTC_IER TAIE [2..2]  ================================================ */
typedef enum {                                  /*!< RTC_IER_TAIE                                                              */
  RTC_IER_TAIE_0                       = 0,     /*!< 0 : Time alarm flag does not generate an interrupt.                       */
  RTC_IER_TAIE_1                       = 1,     /*!< 1 : Time alarm flag does generate an interrupt.                           */
} RTC_IER_TAIE_Enum;

/* ================================================  RTC RTC_IER TSIE [4..4]  ================================================ */
typedef enum {                                  /*!< RTC_IER_TSIE                                                              */
  RTC_IER_TSIE_0                       = 0,     /*!< 0 : Seconds interrupt is disabled.                                        */
  RTC_IER_TSIE_1                       = 1,     /*!< 1 : Seconds interrupt is enabled.                                         */
} RTC_IER_TSIE_Enum;

/* ===============================================  RTC RTC_IER TSIC [16..18]  =============================================== */
typedef enum {                                  /*!< RTC_IER_TSIC                                                              */
  RTC_IER_TSIC_000                     = 0,     /*!< 000 : 1 Hz.                                                               */
  RTC_IER_TSIC_001                     = 1,     /*!< 001 : 2 Hz.                                                               */
  RTC_IER_TSIC_010                     = 2,     /*!< 010 : 4 Hz.                                                               */
  RTC_IER_TSIC_011                     = 3,     /*!< 011 : 8 Hz.                                                               */
  RTC_IER_TSIC_100                     = 4,     /*!< 100 : 16 Hz.                                                              */
  RTC_IER_TSIC_101                     = 5,     /*!< 101 : 32 Hz.                                                              */
  RTC_IER_TSIC_110                     = 6,     /*!< 110 : 64 Hz.                                                              */
  RTC_IER_TSIC_111                     = 7,     /*!< 111 : 128 Hz.                                                             */
} RTC_IER_TSIC_Enum;



/* =========================================================================================================================== */
/* ================                                         CMU_FC_0                                          ================ */
/* =========================================================================================================================== */

/* =====================================================  CMU_FC_0_GCR  ====================================================== */
/* ===========================================  CMU_FC_0 CMU_FC_0_GCR FCE [0..0]  ============================================ */
typedef enum {                                  /*!< CMU_FC_0_GCR_FCE                                                          */
  CMU_FC_0_GCR_FCE_0                   = 0,     /*!< 0 : Frequency Check Disabled                                              */
  CMU_FC_0_GCR_FCE_1                   = 1,     /*!< 1 : Frequency Check Enabled                                               */
} CMU_FC_0_GCR_FCE_Enum;

/* =====================================================  CMU_FC_0_RCCR  ===================================================== */
/* =====================================================  CMU_FC_0_HTCR  ===================================================== */
/* =====================================================  CMU_FC_0_LTCR  ===================================================== */
/* ======================================================  CMU_FC_0_SR  ====================================================== */
/* ============================================  CMU_FC_0 CMU_FC_0_SR FLL [0..0]  ============================================ */
typedef enum {                                  /*!< CMU_FC_0_SR_FLL                                                           */
  CMU_FC_0_SR_FLL_0                    = 0,     /*!< 0 : No FLL Event                                                          */
  CMU_FC_0_SR_FLL_1                    = 1,     /*!< 1 : FLL Event Occured                                                     */
} CMU_FC_0_SR_FLL_Enum;

