nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  CMU_FC_0 CMU_FC_0_SR FHH [1..1]  ============================================ */
typedef enum {                                  /*!< CMU_FC_0_SR_FHH                                                           */
  CMU_FC_0_SR_FHH_0                    = 0,     /*!< 0 : No FHH Event                                                          */
  CMU_FC_0_SR_FHH_1                    = 1,     /*!< 1 : FHH Event Occured                                                     */
} CMU_FC_0_SR_FHH_Enum;

/* ===========================================  CMU_FC_0 CMU_FC_0_SR STATE [2..3]  =========================================== */
typedef enum {                                  /*!< CMU_FC_0_SR_STATE                                                         */
  CMU_FC_0_SR_STATE_00                 = 0,     /*!< 00 : Configure State- Configuration registers and CMU_FC_IER
                                                     programming is getting done                                               */
  CMU_FC_0_SR_STATE_01                 = 1,     /*!< 01 : Initialization State- Register configurations are getting
                                                     loaded internally.                                                        */
  CMU_FC_0_SR_STATE_10                 = 2,     /*!< 10 : Initialization Wait State- The module stays in this state
                                                     for 1 bus clock cycle.                                                    */
  CMU_FC_0_SR_STATE_11                 = 3,     /*!< 11 : Frequency Check State- The module is ready to start frequency
                                                     check operation in this state.                                            */
} CMU_FC_0_SR_STATE_Enum;

/* ============================================  CMU_FC_0 CMU_FC_0_SR RS [4..4]  ============================================= */
typedef enum {                                  /*!< CMU_FC_0_SR_RS                                                            */
  CMU_FC_0_SR_RS_0                     = 0,     /*!< 0 : Frequency Check Stopped                                               */
  CMU_FC_0_SR_RS_1                     = 1,     /*!< 1 : Frequency Check Running                                               */
} CMU_FC_0_SR_RS_Enum;

/* =====================================================  CMU_FC_0_IER  ====================================================== */
/* ==========================================  CMU_FC_0 CMU_FC_0_IER FLLIE [0..0]  =========================================== */
typedef enum {                                  /*!< CMU_FC_0_IER_FLLIE                                                        */
  CMU_FC_0_IER_FLLIE_0                 = 0,     /*!< 0 : FLL Interrupt is Disabled                                             */
  CMU_FC_0_IER_FLLIE_1                 = 1,     /*!< 1 : FLL Interrupt is Enabled                                              */
} CMU_FC_0_IER_FLLIE_Enum;

/* ==========================================  CMU_FC_0 CMU_FC_0_IER FHHIE [1..1]  =========================================== */
typedef enum {                                  /*!< CMU_FC_0_IER_FHHIE                                                        */
  CMU_FC_0_IER_FHHIE_0                 = 0,     /*!< 0 : FHH Interrupt is Disabled                                             */
  CMU_FC_0_IER_FHHIE_1                 = 1,     /*!< 1 : FHH Interrupt is Enabled                                              */
} CMU_FC_0_IER_FHHIE_Enum;

/* ==========================================  CMU_FC_0 CMU_FC_0_IER FLLAEE [2..2]  ========================================== */
typedef enum {                                  /*!< CMU_FC_0_IER_FLLAEE                                                       */
  CMU_FC_0_IER_FLLAEE_0                = 0,     /*!< 0 : Asynchronous FLL Event is Disabled                                    */
  CMU_FC_0_IER_FLLAEE_1                = 1,     /*!< 1 : Asynchronous FLL Event is Enabled                                     */
} CMU_FC_0_IER_FLLAEE_Enum;

/* ==========================================  CMU_FC_0 CMU_FC_0_IER FHHAEE [3..3]  ========================================== */
typedef enum {                                  /*!< CMU_FC_0_IER_FHHAEE                                                       */
  CMU_FC_0_IER_FHHAEE_0                = 0,     /*!< 0 : Asynchronous FHH Event is Disabled                                    */
  CMU_FC_0_IER_FHHAEE_1                = 1,     /*!< 1 : Asynchronous FHH Event is Enabled                                     */
} CMU_FC_0_IER_FHHAEE_Enum;



/* =========================================================================================================================== */
/* ================                                         CMU_FC_1                                          ================ */
/* =========================================================================================================================== */

/* =====================================================  CMU_FC_1_GCR  ====================================================== */
/* ===========================================  CMU_FC_1 CMU_FC_1_GCR FCE [0..0]  ============================================ */
typedef enum {                                  /*!< CMU_FC_1_GCR_FCE                                                          */
  CMU_FC_1_GCR_FCE_0                   = 0,     /*!< 0 : Frequency Check Disabled                                              */
  CMU_FC_1_GCR_FCE_1                   = 1,     /*!< 1 : Frequency Check Enabled                                               */
} CMU_FC_1_GCR_FCE_Enum;

/* =====================================================  CMU_FC_1_RCCR  ===================================================== */
/* =====================================================  CMU_FC_1_HTCR  ===================================================== */
/* =====================================================  CMU_FC_1_LTCR  ===================================================== */
/* ======================================================  CMU_FC_1_SR  ====================================================== */
/* ============================================  CMU_FC_1 CMU_FC_1_SR FLL [0..0]  ============================================ */
typedef enum {                                  /*!< CMU_FC_1_SR_FLL                                                           */
  CMU_FC_1_SR_FLL_0                    = 0,     /*!< 0 : No FLL Event                                                          */
  CMU_FC_1_SR_FLL_1                    = 1,     /*!< 1 : FLL Event Occured                                                     */
} CMU_FC_1_SR_FLL_Enum;

/* ============================================  CMU_FC_1 CMU_FC_1_SR FHH [1..1]  ============================================ */
typedef enum {                                  /*!< CMU_FC_1_SR_FHH                                                           */
  CMU_FC_1_SR_FHH_0                    = 0,     /*!< 0 : No FHH Event                                                          */
  CMU_FC_1_SR_FHH_1                    = 1,     /*!< 1 : FHH Event Occured                                                     */
} CMU_FC_1_SR_FHH_Enum;

