nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  SIM_CHIPCTL  ====================================================== */
/* =======================================  SIM SIM_CHIPCTL ADC_INTERLEAVE_EN [0..3]  ======================================== */
typedef enum {                                  /*!< SIM_CHIPCTL_ADC_INTERLEAVE_EN                                             */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_0000   = 0,     /*!< 0000 : Interleaving disabled. No channel pair interleaved. Interleaved
                                                     channels are individually connected to pins. PTC0 is connected
                                                     to ADC0_SE8. PTC1 is connected to ADC0_SE9. PTB15 is connected
                                                     to ADC1_SE14. PTB16 is connected to ADC1_SE15. PTB0 is
                                                     connected to ADC0_SE4. PTB1 is connected to ADC0_SE5. PTB13
                                                     is connected to ADC1_SE8. PTB14 is connected to ADC1_SE9.                 */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_1xxx_8 = 8,     /*!< 1xxx_8 : PTB14 to ADC1_SE9 and ADC0_SE9                                   */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_1xxx_9 = 9,     /*!< 1xxx_9 : PTB14 to ADC1_SE9 and ADC0_SE9                                   */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_1xxx_10 = 10,   /*!< 1xxx_10 : PTB14 to ADC1_SE9 and ADC0_SE9                                  */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_1xxx_11 = 11,   /*!< 1xxx_11 : PTB14 to ADC1_SE9 and ADC0_SE9                                  */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_1xxx_12 = 12,   /*!< 1xxx_12 : PTB14 to ADC1_SE9 and ADC0_SE9                                  */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_1xxx_13 = 13,   /*!< 1xxx_13 : PTB14 to ADC1_SE9 and ADC0_SE9                                  */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_1xxx_14 = 14,   /*!< 1xxx_14 : PTB14 to ADC1_SE9 and ADC0_SE9                                  */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_1xxx_15 = 15,   /*!< 1xxx_15 : PTB14 to ADC1_SE9 and ADC0_SE9                                  */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_x1xx_4 = 4,     /*!< x1xx_4 : PTB13 to ADC1_SE8 and ADC0_SE8                                   */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_x1xx_5 = 5,     /*!< x1xx_5 : PTB13 to ADC1_SE8 and ADC0_SE8                                   */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_x1xx_6 = 6,     /*!< x1xx_6 : PTB13 to ADC1_SE8 and ADC0_SE8                                   */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_x1xx_7 = 7,     /*!< x1xx_7 : PTB13 to ADC1_SE8 and ADC0_SE8                                   */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_xx1x_2 = 2,     /*!< xx1x_2 : PTB1 to ADC0_SE5 and ADC1_SE15                                   */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_xx1x_3 = 3,     /*!< xx1x_3 : PTB1 to ADC0_SE5 and ADC1_SE15                                   */
  SIM_CHIPCTL_ADC_INTERLEAVE_EN_xxx1_1 = 1,     /*!< xxx1_1 : PTB0 to ADC0_SE4 and ADC1_SE14                                   */
} SIM_CHIPCTL_ADC_INTERLEAVE_EN_Enum;

/* ===========================================  SIM SIM_CHIPCTL CLKOUTSEL [4..7]  ============================================ */
typedef enum {                                  /*!< SIM_CHIPCTL_CLKOUTSEL                                                     */
  SIM_CHIPCTL_CLKOUTSEL_0000           = 0,     /*!< 0000 : SCG CLKOUT                                                         */
  SIM_CHIPCTL_CLKOUTSEL_0010           = 2,     /*!< 0010 : SOSC DIV2 CLK                                                      */
  SIM_CHIPCTL_CLKOUTSEL_0100           = 4,     /*!< 0100 : SIRC DIV2 CLK                                                      */
  SIM_CHIPCTL_CLKOUTSEL_0101           = 5,     /*!< 0101 : For S32K148: QSPI SFIF_CLK_HYP: Divide by 2 clock (configured
                                                     through SCLKCONFIG[5]) for HyperRAM going to sfif clock
                                                     to QSPI; For others: Reserved                                             */
  SIM_CHIPCTL_CLKOUTSEL_0110           = 6,     /*!< 0110 : FIRC DIV2 CLK                                                      */
  SIM_CHIPCTL_CLKOUTSEL_0111           = 7,     /*!< 0111 : HCLK                                                               */
  SIM_CHIPCTL_CLKOUTSEL_1000           = 8,     /*!< 1000 : SPLL DIV2 CLK                                                      */
  SIM_CHIPCTL_CLKOUTSEL_1001           = 9,     /*!< 1001 : BUS_CLK                                                            */
  SIM_CHIPCTL_CLKOUTSEL_1010           = 10,    /*!< 1010 : LPO128K_CLK                                                        */
  SIM_CHIPCTL_CLKOUTSEL_1011           = 11,    /*!< 1011 : For S32K148: QSPI IPG_CLK; For others: Reserved                    */
  SIM_CHIPCTL_CLKOUTSEL_1100           = 12,    /*!< 1100 : LPO_CLK as selected by SIM_LPOCLKS[LPOCLKSEL]                      */
  SIM_CHIPCTL_CLKOUTSEL_1101           = 13,    /*!< 1101 : For S32K148: QSPI IPG_CLK_SFIF; For others: Reserved               */
  SIM_CHIPCTL_CLKOUTSEL_1110           = 14,    /*!< 1110 : RTC_CLK as selected by SIM_LPOCLKS[RTCCLKSEL]                      */
  SIM_CHIPCTL_CLKOUTSEL_1111           = 15,    /*!< 1111 : For S32K148: QSPI IPG_CLK_2XSFIF; For others: Reserved             */
} SIM_CHIPCTL_CLKOUTSEL_Enum;

/* ===========================================  SIM SIM_CHIPCTL CLKOUTDIV [8..10]  =========================================== */
typedef enum {                                  /*!< SIM_CHIPCTL_CLKOUTDIV                                                     */
  SIM_CHIPCTL_CLKOUTDIV_000            = 0,     /*!< 000 : Divide by 1                                                         */
  SIM_CHIPCTL_CLKOUTDIV_001            = 1,     /*!< 001 : Divide by 2                                                         */
  SIM_CHIPCTL_CLKOUTDIV_010            = 2,     /*!< 010 : Divide by 3                                                         */
  SIM_CHIPCTL_CLKOUTDIV_011            = 3,     /*!< 011 : Divide by 4                                                         */
  SIM_CHIPCTL_CLKOUTDIV_100            = 4,     /*!< 100 : Divide by 5                                                         */
  SIM_CHIPCTL_CLKOUTDIV_101            = 5,     /*!< 101 : Divide by 6                                                         */
  SIM_CHIPCTL_CLKOUTDIV_110            = 6,     /*!< 110 : Divide by 7                                                         */
  SIM_CHIPCTL_CLKOUTDIV_111            = 7,     /*!< 111 : Divide by 8                                                         */
} SIM_CHIPCTL_CLKOUTDIV_Enum;

/* ===========================================  SIM SIM_CHIPCTL CLKOUTEN [11..11]  =========================================== */
typedef enum {                                  /*!< SIM_CHIPCTL_CLKOUTEN                                                      */
  SIM_CHIPCTL_CLKOUTEN_0               = 0,     /*!< 0 : Clockout disable                                                      */
  SIM_CHIPCTL_CLKOUTEN_1               = 1,     /*!< 1 : Clockout enable                                                       */
} SIM_CHIPCTL_CLKOUTEN_Enum;

/* =========================================  SIM SIM_CHIPCTL TRACECLK_SEL [12..12]  ========================================= */
typedef enum {                                  /*!< SIM_CHIPCTL_TRACECLK_SEL                                                  */
  SIM_CHIPCTL_TRACECLK_SEL_0           = 0,     /*!< 0 : Core clock                                                            */
  SIM_CHIPCTL_TRACECLK_SEL_1           = 1,     /*!< 1 : Platform clock                                                        */
} SIM_CHIPCTL_TRACECLK_SEL_Enum;

/* ==========================================  SIM SIM_CHIPCTL PDB_BB_SEL [13..13]  ========================================== */
typedef enum {                                  /*!< SIM_CHIPCTL_PDB_BB_SEL                                                    */
  SIM_CHIPCTL_PDB_BB_SEL_0             = 0,     /*!< 0 : PDB0 channel 0 back-to-back operation with ADC0 COCO[7:0]
                                                     and PDB1 channel 0 back-to-back operation with ADC1 COCO[7:0]             */
  SIM_CHIPCTL_PDB_BB_SEL_1             = 1,     /*!< 1 : Channel 0 of PDB0 and PDB1 back-to-back operation with COCO[7:0]
                                                     of ADC0 and ADC1.                                                         */
} SIM_CHIPCTL_PDB_BB_SEL_Enum;

/* ==========================================  SIM SIM_CHIPCTL ADC_SUPPLY [16..18]  ========================================== */
typedef enum {                                  /*!< SIM_CHIPCTL_ADC_SUPPLY                                                    */
  SIM_CHIPCTL_ADC_SUPPLY_000           = 0,     /*!< 000 : 5 V input VDD supply (VDD)                                          */
  SIM_CHIPCTL_ADC_SUPPLY_001           = 1,     /*!< 001 : 5 V input analog supply (VDDA)                                      */
  SIM_CHIPCTL_ADC_SUPPLY_010           = 2,     /*!< 010 : ADC Reference Supply (VREFH)                                        */
  SIM_CHIPCTL_ADC_SUPPLY_011           = 3,     /*!< 011 : 3.3 V Oscillator Regulator Output (VDD_3V)                          */
  SIM_CHIPCTL_ADC_SUPPLY_100           = 4,     /*!< 100 : 3.3 V flash regulator output (VDD_flash_3V)                         */
  SIM_CHIPCTL_ADC_SUPPLY_101           = 5,     /*!< 101 : 1.2 V core regulator output (VDD_LV)                                */
} SIM_CHIPCTL_ADC_SUPPLY_Enum;

/* =========================================  SIM SIM_CHIPCTL ADC_SUPPLYEN [19..19]  ========================================= */
typedef enum {                                  /*!< SIM_CHIPCTL_ADC_SUPPLYEN                                                  */
  SIM_CHIPCTL_ADC_SUPPLYEN_0           = 0,     /*!< 0 : Disable internal supply monitoring                                    */
  SIM_CHIPCTL_ADC_SUPPLYEN_1           = 1,     /*!< 1 : Enable internal supply monitoring                                     */
} SIM_CHIPCTL_ADC_SUPPLYEN_Enum;

/* =========================================  SIM SIM_CHIPCTL SRAMU_RETEN [20..20]  ========================================== */
typedef enum {                                  /*!< SIM_CHIPCTL_SRAMU_RETEN                                                   */
  SIM_CHIPCTL_SRAMU_RETEN_0            = 0,     /*!< 0 : SRAMU contents are retained across resets                             */
  SIM_CHIPCTL_SRAMU_RETEN_1            = 1,     /*!< 1 : No SRAMU retention                                                    */
} SIM_CHIPCTL_SRAMU_RETEN_Enum;

/* =========================================  SIM SIM_CHIPCTL SRAML_RETEN [21..21]  ========================================== */
typedef enum {                                  /*!< SIM_CHIPCTL_SRAML_RETEN                                                   */
  SIM_CHIPCTL_SRAML_RETEN_0            = 0,     /*!< 0 : SRAML contents are retained across resets                             */
  SIM_CHIPCTL_SRAML_RETEN_1            = 1,     /*!< 1 : No SRAML retention                                                    */
} SIM_CHIPCTL_SRAML_RETEN_Enum;

