nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  SIM SIM_PLATCGC CGCGPIO [5..5]  ============================================= */
typedef enum {                                  /*!< SIM_PLATCGC_CGCGPIO                                                       */
  SIM_PLATCGC_CGCGPIO_0                = 0,     /*!< 0 : Clock disabled                                                        */
  SIM_PLATCGC_CGCGPIO_1                = 1,     /*!< 1 : Clock enabled                                                         */
} SIM_PLATCGC_CGCGPIO_Enum;

/* =======================================================  SIM_FCFG1  ======================================================= */
/* ===========================================  SIM SIM_FCFG1 EEERAMSIZE [16..19]  =========================================== */
typedef enum {                                  /*!< SIM_FCFG1_EEERAMSIZE                                                      */
  SIM_FCFG1_EEERAMSIZE_0010            = 2,     /*!< 0010 : 4 KB                                                               */
  SIM_FCFG1_EEERAMSIZE_0011            = 3,     /*!< 0011 : 2 KB                                                               */
  SIM_FCFG1_EEERAMSIZE_0100            = 4,     /*!< 0100 : 1 KB                                                               */
  SIM_FCFG1_EEERAMSIZE_0101            = 5,     /*!< 0101 : 512 Bytes                                                          */
  SIM_FCFG1_EEERAMSIZE_0110            = 6,     /*!< 0110 : 256 Bytes                                                          */
  SIM_FCFG1_EEERAMSIZE_0111            = 7,     /*!< 0111 : 128 Bytes                                                          */
  SIM_FCFG1_EEERAMSIZE_1000            = 8,     /*!< 1000 : 64 Bytes                                                           */
  SIM_FCFG1_EEERAMSIZE_1001            = 9,     /*!< 1001 : 32 Bytes                                                           */
  SIM_FCFG1_EEERAMSIZE_1111            = 15,    /*!< 1111 : 0 Bytes                                                            */
} SIM_FCFG1_EEERAMSIZE_Enum;

/* =======================================================  SIM_UIDH  ======================================================== */
/* =======================================================  SIM_UIDMH  ======================================================= */
/* =======================================================  SIM_UIDML  ======================================================= */
/* =======================================================  SIM_UIDL  ======================================================== */
/* ======================================================  SIM_CLKDIV4  ====================================================== */
/* ==========================================  SIM SIM_CLKDIV4 TRACEDIVEN [28..28]  ========================================== */
typedef enum {                                  /*!< SIM_CLKDIV4_TRACEDIVEN                                                    */
  SIM_CLKDIV4_TRACEDIVEN_0             = 0,     /*!< 0 : Debug trace divider disabled                                          */
  SIM_CLKDIV4_TRACEDIVEN_1             = 1,     /*!< 1 : Debug trace divider enabled                                           */
} SIM_CLKDIV4_TRACEDIVEN_Enum;

/* =====================================================  SIM_MISCTRL1  ====================================================== */


/* =========================================================================================================================== */
/* ================                                           PORTA                                           ================ */
/* =========================================================================================================================== */

/* ======================================================  PORTA_PCR0  ======================================================= */
/* ==============================================  PORTA PORTA_PCR0 PS [0..0]  =============================================== */
typedef enum {                                  /*!< PORTA_PCR0_PS                                                             */
  PORTA_PCR0_PS_0                      = 0,     /*!< 0 : Internal pulldown resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
  PORTA_PCR0_PS_1                      = 1,     /*!< 1 : Internal pullup resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
} PORTA_PCR0_PS_Enum;

/* ==============================================  PORTA PORTA_PCR0 PE [1..1]  =============================================== */
typedef enum {                                  /*!< PORTA_PCR0_PE                                                             */
  PORTA_PCR0_PE_0                      = 0,     /*!< 0 : Internal pullup or pulldown resistor is not enabled on the
                                                     corresponding pin.                                                        */
  PORTA_PCR0_PE_1                      = 1,     /*!< 1 : Internal pullup or pulldown resistor is enabled on the corresponding
                                                     pin, if the pin is configured as a digital input.                         */
} PORTA_PCR0_PE_Enum;

/* =============================================  PORTA PORTA_PCR0 MUX [8..10]  ============================================== */
typedef enum {                                  /*!< PORTA_PCR0_MUX                                                            */
  PORTA_PCR0_MUX_000                   = 0,     /*!< 000 : Pin disabled (Alternative 0) (analog).                              */
  PORTA_PCR0_MUX_001                   = 1,     /*!< 001 : Alternative 1 (GPIO).                                               */
  PORTA_PCR0_MUX_010                   = 2,     /*!< 010 : Alternative 2 (chip-specific).                                      */
  PORTA_PCR0_MUX_011                   = 3,     /*!< 011 : Alternative 3 (chip-specific).                                      */
  PORTA_PCR0_MUX_100                   = 4,     /*!< 100 : Alternative 4 (chip-specific).                                      */
  PORTA_PCR0_MUX_101                   = 5,     /*!< 101 : Alternative 5 (chip-specific).                                      */
  PORTA_PCR0_MUX_110                   = 6,     /*!< 110 : Alternative 6 (chip-specific).                                      */
  PORTA_PCR0_MUX_111                   = 7,     /*!< 111 : Alternative 7 (chip-specific).                                      */
} PORTA_PCR0_MUX_Enum;

/* =============================================  PORTA PORTA_PCR0 LK [15..15]  ============================================== */
typedef enum {                                  /*!< PORTA_PCR0_LK                                                             */
  PORTA_PCR0_LK_0                      = 0,     /*!< 0 : Pin Control Register fields [15:0] are not locked.                    */
  PORTA_PCR0_LK_1                      = 1,     /*!< 1 : Pin Control Register fields [15:0] are locked and cannot
                                                     be updated until the next system reset.                                   */
} PORTA_PCR0_LK_Enum;

/* ============================================  PORTA PORTA_PCR0 IRQC [16..19]  ============================================= */
typedef enum {                                  /*!< PORTA_PCR0_IRQC                                                           */
  PORTA_PCR0_IRQC_0000                 = 0,     /*!< 0000 : Interrupt Status Flag (ISF) is disabled.                           */
  PORTA_PCR0_IRQC_0001                 = 1,     /*!< 0001 : ISF flag and DMA request on rising edge.                           */
  PORTA_PCR0_IRQC_0010                 = 2,     /*!< 0010 : ISF flag and DMA request on falling edge.                          */
  PORTA_PCR0_IRQC_0011                 = 3,     /*!< 0011 : ISF flag and DMA request on either edge.                           */
  PORTA_PCR0_IRQC_1000                 = 8,     /*!< 1000 : ISF flag and Interrupt when logic 0.                               */
  PORTA_PCR0_IRQC_1001                 = 9,     /*!< 1001 : ISF flag and Interrupt on rising-edge.                             */
  PORTA_PCR0_IRQC_1010                 = 10,    /*!< 1010 : ISF flag and Interrupt on falling-edge.                            */
  PORTA_PCR0_IRQC_1011                 = 11,    /*!< 1011 : ISF flag and Interrupt on either edge.                             */
  PORTA_PCR0_IRQC_1100                 = 12,    /*!< 1100 : ISF flag and Interrupt when logic 1.                               */
} PORTA_PCR0_IRQC_Enum;

/* =============================================  PORTA PORTA_PCR0 ISF [24..24]  ============================================= */
typedef enum {                                  /*!< PORTA_PCR0_ISF                                                            */
  PORTA_PCR0_ISF_0                     = 0,     /*!< 0 : Configured interrupt is not detected.                                 */
  PORTA_PCR0_ISF_1                     = 1,     /*!< 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */
} PORTA_PCR0_ISF_Enum;

/* ======================================================  PORTA_PCR1  ======================================================= */
/* ==============================================  PORTA PORTA_PCR1 PS [0..0]  =============================================== */
typedef enum {                                  /*!< PORTA_PCR1_PS                                                             */
  PORTA_PCR1_PS_0                      = 0,     /*!< 0 : Internal pulldown resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
  PORTA_PCR1_PS_1                      = 1,     /*!< 1 : Internal pullup resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
} PORTA_PCR1_PS_Enum;

