nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  PORTD PORTD_PCR2 IRQC [16..19]  ============================================= */
typedef enum {                                  /*!< PORTD_PCR2_IRQC                                                           */
  PORTD_PCR2_IRQC_0000                 = 0,     /*!< 0000 : Interrupt Status Flag (ISF) is disabled.                           */
  PORTD_PCR2_IRQC_0001                 = 1,     /*!< 0001 : ISF flag and DMA request on rising edge.                           */
  PORTD_PCR2_IRQC_0010                 = 2,     /*!< 0010 : ISF flag and DMA request on falling edge.                          */
  PORTD_PCR2_IRQC_0011                 = 3,     /*!< 0011 : ISF flag and DMA request on either edge.                           */
  PORTD_PCR2_IRQC_1000                 = 8,     /*!< 1000 : ISF flag and Interrupt when logic 0.                               */
  PORTD_PCR2_IRQC_1001                 = 9,     /*!< 1001 : ISF flag and Interrupt on rising-edge.                             */
  PORTD_PCR2_IRQC_1010                 = 10,    /*!< 1010 : ISF flag and Interrupt on falling-edge.                            */
  PORTD_PCR2_IRQC_1011                 = 11,    /*!< 1011 : ISF flag and Interrupt on either edge.                             */
  PORTD_PCR2_IRQC_1100                 = 12,    /*!< 1100 : ISF flag and Interrupt when logic 1.                               */
} PORTD_PCR2_IRQC_Enum;

/* =============================================  PORTD PORTD_PCR2 ISF [24..24]  ============================================= */
typedef enum {                                  /*!< PORTD_PCR2_ISF                                                            */
  PORTD_PCR2_ISF_0                     = 0,     /*!< 0 : Configured interrupt is not detected.                                 */
  PORTD_PCR2_ISF_1                     = 1,     /*!< 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */
} PORTD_PCR2_ISF_Enum;

/* ======================================================  PORTD_PCR3  ======================================================= */
/* ==============================================  PORTD PORTD_PCR3 PS [0..0]  =============================================== */
typedef enum {                                  /*!< PORTD_PCR3_PS                                                             */
  PORTD_PCR3_PS_0                      = 0,     /*!< 0 : Internal pulldown resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
  PORTD_PCR3_PS_1                      = 1,     /*!< 1 : Internal pullup resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
} PORTD_PCR3_PS_Enum;

/* ==============================================  PORTD PORTD_PCR3 PE [1..1]  =============================================== */
typedef enum {                                  /*!< PORTD_PCR3_PE                                                             */
  PORTD_PCR3_PE_0                      = 0,     /*!< 0 : Internal pullup or pulldown resistor is not enabled on the
                                                     corresponding pin.                                                        */
  PORTD_PCR3_PE_1                      = 1,     /*!< 1 : Internal pullup or pulldown resistor is enabled on the corresponding
                                                     pin, if the pin is configured as a digital input.                         */
} PORTD_PCR3_PE_Enum;

/* ==============================================  PORTD PORTD_PCR3 PFE [4..4]  ============================================== */
typedef enum {                                  /*!< PORTD_PCR3_PFE                                                            */
  PORTD_PCR3_PFE_0                     = 0,     /*!< 0 : Passive input filter is disabled on the corresponding pin.            */
  PORTD_PCR3_PFE_1                     = 1,     /*!< 1 : Passive input filter is enabled on the corresponding pin,
                                                     if the pin is configured as a digital input. Refer to the
                                                     device data sheet for filter characteristics.                             */
} PORTD_PCR3_PFE_Enum;

/* =============================================  PORTD PORTD_PCR3 MUX [8..10]  ============================================== */
typedef enum {                                  /*!< PORTD_PCR3_MUX                                                            */
  PORTD_PCR3_MUX_000                   = 0,     /*!< 000 : Pin disabled (Alternative 0) (analog).                              */
  PORTD_PCR3_MUX_001                   = 1,     /*!< 001 : Alternative 1 (GPIO).                                               */
  PORTD_PCR3_MUX_010                   = 2,     /*!< 010 : Alternative 2 (chip-specific).                                      */
  PORTD_PCR3_MUX_011                   = 3,     /*!< 011 : Alternative 3 (chip-specific).                                      */
  PORTD_PCR3_MUX_100                   = 4,     /*!< 100 : Alternative 4 (chip-specific).                                      */
  PORTD_PCR3_MUX_101                   = 5,     /*!< 101 : Alternative 5 (chip-specific).                                      */
  PORTD_PCR3_MUX_110                   = 6,     /*!< 110 : Alternative 6 (chip-specific).                                      */
  PORTD_PCR3_MUX_111                   = 7,     /*!< 111 : Alternative 7 (chip-specific).                                      */
} PORTD_PCR3_MUX_Enum;

