nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  PORTE PORTE_PCR9 PE [1..1]  =============================================== */
typedef enum {                                  /*!< PORTE_PCR9_PE                                                             */
  PORTE_PCR9_PE_0                      = 0,     /*!< 0 : Internal pullup or pulldown resistor is not enabled on the
                                                     corresponding pin.                                                        */
  PORTE_PCR9_PE_1                      = 1,     /*!< 1 : Internal pullup or pulldown resistor is enabled on the corresponding
                                                     pin, if the pin is configured as a digital input.                         */
} PORTE_PCR9_PE_Enum;

/* =============================================  PORTE PORTE_PCR9 MUX [8..10]  ============================================== */
typedef enum {                                  /*!< PORTE_PCR9_MUX                                                            */
  PORTE_PCR9_MUX_000                   = 0,     /*!< 000 : Pin disabled (Alternative 0) (analog).                              */
  PORTE_PCR9_MUX_001                   = 1,     /*!< 001 : Alternative 1 (GPIO).                                               */
  PORTE_PCR9_MUX_010                   = 2,     /*!< 010 : Alternative 2 (chip-specific).                                      */
  PORTE_PCR9_MUX_011                   = 3,     /*!< 011 : Alternative 3 (chip-specific).                                      */
  PORTE_PCR9_MUX_100                   = 4,     /*!< 100 : Alternative 4 (chip-specific).                                      */
  PORTE_PCR9_MUX_101                   = 5,     /*!< 101 : Alternative 5 (chip-specific).                                      */
  PORTE_PCR9_MUX_110                   = 6,     /*!< 110 : Alternative 6 (chip-specific).                                      */
  PORTE_PCR9_MUX_111                   = 7,     /*!< 111 : Alternative 7 (chip-specific).                                      */
} PORTE_PCR9_MUX_Enum;

/* =============================================  PORTE PORTE_PCR9 LK [15..15]  ============================================== */
typedef enum {                                  /*!< PORTE_PCR9_LK                                                             */
  PORTE_PCR9_LK_0                      = 0,     /*!< 0 : Pin Control Register fields [15:0] are not locked.                    */
  PORTE_PCR9_LK_1                      = 1,     /*!< 1 : Pin Control Register fields [15:0] are locked and cannot
                                                     be updated until the next system reset.                                   */
} PORTE_PCR9_LK_Enum;

/* ============================================  PORTE PORTE_PCR9 IRQC [16..19]  ============================================= */
typedef enum {                                  /*!< PORTE_PCR9_IRQC                                                           */
  PORTE_PCR9_IRQC_0000                 = 0,     /*!< 0000 : Interrupt Status Flag (ISF) is disabled.                           */
  PORTE_PCR9_IRQC_0001                 = 1,     /*!< 0001 : ISF flag and DMA request on rising edge.                           */
  PORTE_PCR9_IRQC_0010                 = 2,     /*!< 0010 : ISF flag and DMA request on falling edge.                          */
  PORTE_PCR9_IRQC_0011                 = 3,     /*!< 0011 : ISF flag and DMA request on either edge.                           */
  PORTE_PCR9_IRQC_1000                 = 8,     /*!< 1000 : ISF flag and Interrupt when logic 0.                               */
  PORTE_PCR9_IRQC_1001                 = 9,     /*!< 1001 : ISF flag and Interrupt on rising-edge.                             */
  PORTE_PCR9_IRQC_1010                 = 10,    /*!< 1010 : ISF flag and Interrupt on falling-edge.                            */
  PORTE_PCR9_IRQC_1011                 = 11,    /*!< 1011 : ISF flag and Interrupt on either edge.                             */
  PORTE_PCR9_IRQC_1100                 = 12,    /*!< 1100 : ISF flag and Interrupt when logic 1.                               */
} PORTE_PCR9_IRQC_Enum;

/* =============================================  PORTE PORTE_PCR9 ISF [24..24]  ============================================= */
typedef enum {                                  /*!< PORTE_PCR9_ISF                                                            */
  PORTE_PCR9_ISF_0                     = 0,     /*!< 0 : Configured interrupt is not detected.                                 */
  PORTE_PCR9_ISF_1                     = 1,     /*!< 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */
} PORTE_PCR9_ISF_Enum;

/* ======================================================  PORTE_PCR10  ====================================================== */
/* ==============================================  PORTE PORTE_PCR10 PS [0..0]  ============================================== */
typedef enum {                                  /*!< PORTE_PCR10_PS                                                            */
  PORTE_PCR10_PS_0                     = 0,     /*!< 0 : Internal pulldown resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
  PORTE_PCR10_PS_1                     = 1,     /*!< 1 : Internal pullup resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
} PORTE_PCR10_PS_Enum;

/* ==============================================  PORTE PORTE_PCR10 PE [1..1]  ============================================== */
typedef enum {                                  /*!< PORTE_PCR10_PE                                                            */
  PORTE_PCR10_PE_0                     = 0,     /*!< 0 : Internal pullup or pulldown resistor is not enabled on the
                                                     corresponding pin.                                                        */
  PORTE_PCR10_PE_1                     = 1,     /*!< 1 : Internal pullup or pulldown resistor is enabled on the corresponding
                                                     pin, if the pin is configured as a digital input.                         */
} PORTE_PCR10_PE_Enum;

/* =============================================  PORTE PORTE_PCR10 MUX [8..10]  ============================================= */
typedef enum {                                  /*!< PORTE_PCR10_MUX                                                           */
  PORTE_PCR10_MUX_000                  = 0,     /*!< 000 : Pin disabled (Alternative 0) (analog).                              */
  PORTE_PCR10_MUX_001                  = 1,     /*!< 001 : Alternative 1 (GPIO).                                               */
  PORTE_PCR10_MUX_010                  = 2,     /*!< 010 : Alternative 2 (chip-specific).                                      */
  PORTE_PCR10_MUX_011                  = 3,     /*!< 011 : Alternative 3 (chip-specific).                                      */
  PORTE_PCR10_MUX_100                  = 4,     /*!< 100 : Alternative 4 (chip-specific).                                      */
  PORTE_PCR10_MUX_101                  = 5,     /*!< 101 : Alternative 5 (chip-specific).                                      */
  PORTE_PCR10_MUX_110                  = 6,     /*!< 110 : Alternative 6 (chip-specific).                                      */
  PORTE_PCR10_MUX_111                  = 7,     /*!< 111 : Alternative 7 (chip-specific).                                      */
} PORTE_PCR10_MUX_Enum;

/* =============================================  PORTE PORTE_PCR10 LK [15..15]  ============================================= */
typedef enum {                                  /*!< PORTE_PCR10_LK                                                            */
  PORTE_PCR10_LK_0                     = 0,     /*!< 0 : Pin Control Register fields [15:0] are not locked.                    */
  PORTE_PCR10_LK_1                     = 1,     /*!< 1 : Pin Control Register fields [15:0] are locked and cannot
                                                     be updated until the next system reset.                                   */
} PORTE_PCR10_LK_Enum;

