nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  PORTE_DFCR  ======================================================= */
/* ==============================================  PORTE PORTE_DFCR CS [0..0]  =============================================== */
typedef enum {                                  /*!< PORTE_DFCR_CS                                                             */
  PORTE_DFCR_CS_0                      = 0,     /*!< 0 : Digital filters are clocked by the bus clock.                         */
  PORTE_DFCR_CS_1                      = 1,     /*!< 1 : Digital filters are clocked by the LPO clock.                         */
} PORTE_DFCR_CS_Enum;

/* ======================================================  PORTE_DFWR  ======================================================= */


/* =========================================================================================================================== */
/* ================                                           WDOG                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  WDOG_CS  ======================================================== */
/* ===============================================  WDOG WDOG_CS STOP [0..0]  ================================================ */
typedef enum {                                  /*!< WDOG_CS_STOP                                                              */
  WDOG_CS_STOP_0                       = 0,     /*!< 0 : Watchdog disabled in chip stop mode.                                  */
  WDOG_CS_STOP_1                       = 1,     /*!< 1 : Watchdog enabled in chip stop mode.                                   */
} WDOG_CS_STOP_Enum;

/* ===============================================  WDOG WDOG_CS WAIT [1..1]  ================================================ */
typedef enum {                                  /*!< WDOG_CS_WAIT                                                              */
  WDOG_CS_WAIT_0                       = 0,     /*!< 0 : Watchdog disabled in chip wait mode.                                  */
  WDOG_CS_WAIT_1                       = 1,     /*!< 1 : Watchdog enabled in chip wait mode.                                   */
} WDOG_CS_WAIT_Enum;

/* ================================================  WDOG WDOG_CS DBG [2..2]  ================================================ */
typedef enum {                                  /*!< WDOG_CS_DBG                                                               */
  WDOG_CS_DBG_0                        = 0,     /*!< 0 : Watchdog disabled in chip debug mode.                                 */
  WDOG_CS_DBG_1                        = 1,     /*!< 1 : Watchdog enabled in chip debug mode.                                  */
} WDOG_CS_DBG_Enum;

/* ================================================  WDOG WDOG_CS TST [3..4]  ================================================ */
typedef enum {                                  /*!< WDOG_CS_TST                                                               */
  WDOG_CS_TST_00                       = 0,     /*!< 00 : Watchdog test mode disabled.                                         */
  WDOG_CS_TST_01                       = 1,     /*!< 01 : Watchdog user mode enabled. (Watchdog test mode disabled.)
                                                     After testing the watchdog, software should use this setting
                                                     to indicate that the watchdog is functioning normally in
                                                     user mode.                                                                */
  WDOG_CS_TST_10                       = 2,     /*!< 10 : Watchdog test mode enabled, only the low byte is used.
                                                     CNT[CNTLOW] is compared with TOVAL[TOVALLOW].                             */
  WDOG_CS_TST_11                       = 3,     /*!< 11 : Watchdog test mode enabled, only the high byte is used.
                                                     CNT[CNTHIGH] is compared with TOVAL[TOVALHIGH].                           */
} WDOG_CS_TST_Enum;

/* ==============================================  WDOG WDOG_CS UPDATE [5..5]  =============================================== */
typedef enum {                                  /*!< WDOG_CS_UPDATE                                                            */
  WDOG_CS_UPDATE_0                     = 0,     /*!< 0 : Updates not allowed. After the initial configuration, the
                                                     watchdog cannot be later modified without forcing a reset.                */
  WDOG_CS_UPDATE_1                     = 1,     /*!< 1 : Updates allowed. Software can modify the watchdog configuration
                                                     registers within 8d128 bus clocks after performing the
                                                     unlock write sequence.                                                    */
} WDOG_CS_UPDATE_Enum;

/* ================================================  WDOG WDOG_CS INT [6..6]  ================================================ */
typedef enum {                                  /*!< WDOG_CS_INT                                                               */
  WDOG_CS_INT_0                        = 0,     /*!< 0 : Watchdog interrupts are disabled. Watchdog resets are not
                                                     delayed.                                                                  */
  WDOG_CS_INT_1                        = 1,     /*!< 1 : Watchdog interrupts are enabled. Watchdog resets are delayed
                                                     by 8d128 bus clocks from the interrupt vector fetch.                      */
} WDOG_CS_INT_Enum;

/* ================================================  WDOG WDOG_CS EN [7..7]  ================================================= */
typedef enum {                                  /*!< WDOG_CS_EN                                                                */
  WDOG_CS_EN_0                         = 0,     /*!< 0 : Watchdog disabled.                                                    */
  WDOG_CS_EN_1                         = 1,     /*!< 1 : Watchdog enabled.                                                     */
} WDOG_CS_EN_Enum;

/* ================================================  WDOG WDOG_CS CLK [8..9]  ================================================ */
typedef enum {                                  /*!< WDOG_CS_CLK                                                               */
  WDOG_CS_CLK_00                       = 0,     /*!< 00 : Bus clock                                                            */
  WDOG_CS_CLK_01                       = 1,     /*!< 01 : LPO clock                                                            */
  WDOG_CS_CLK_10                       = 2,     /*!< 10 : INTCLK (internal clock)                                              */
  WDOG_CS_CLK_11                       = 3,     /*!< 11 : ERCLK (external reference clock)                                     */
} WDOG_CS_CLK_Enum;

/* ===============================================  WDOG WDOG_CS RCS [10..10]  =============================================== */
typedef enum {                                  /*!< WDOG_CS_RCS                                                               */
  WDOG_CS_RCS_0                        = 0,     /*!< 0 : Reconfiguring WDOG.                                                   */
  WDOG_CS_RCS_1                        = 1,     /*!< 1 : Reconfiguration is successful.                                        */
} WDOG_CS_RCS_Enum;

/* ===============================================  WDOG WDOG_CS ULK [11..11]  =============================================== */
typedef enum {                                  /*!< WDOG_CS_ULK                                                               */
  WDOG_CS_ULK_0                        = 0,     /*!< 0 : WDOG is locked.                                                       */
  WDOG_CS_ULK_1                        = 1,     /*!< 1 : WDOG is unlocked.                                                     */
} WDOG_CS_ULK_Enum;

/* ==============================================  WDOG WDOG_CS PRES [12..12]  =============================================== */
typedef enum {                                  /*!< WDOG_CS_PRES                                                              */
  WDOG_CS_PRES_0                       = 0,     /*!< 0 : 256 prescaler disabled.                                               */
  WDOG_CS_PRES_1                       = 1,     /*!< 1 : 256 prescaler enabled.                                                */
} WDOG_CS_PRES_Enum;

