nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =========================================  FLEXIO FLEXIO_TIMCFG3 TIMDIS [12..14]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCFG3_TIMDIS                                                     */
  FLEXIO_TIMCFG3_TIMDIS_0              = 0,     /*!< 0 : Timer never disabled                                                  */
  FLEXIO_TIMCFG3_TIMDIS_1              = 1,     /*!< 1 : Timer disabled on Timer N-1 disable                                   */
  FLEXIO_TIMCFG3_TIMDIS_10             = 2,     /*!< 10 : Timer disabled on Timer compare                                      */
  FLEXIO_TIMCFG3_TIMDIS_11             = 3,     /*!< 11 : Timer disabled on Timer compare and Trigger Low                      */
  FLEXIO_TIMCFG3_TIMDIS_100            = 4,     /*!< 100 : Timer disabled on Pin rising or falling edge                        */
  FLEXIO_TIMCFG3_TIMDIS_101            = 5,     /*!< 101 : Timer disabled on Pin rising or falling edge provided
                                                     Trigger is high                                                           */
  FLEXIO_TIMCFG3_TIMDIS_110            = 6,     /*!< 110 : Timer disabled on Trigger falling edge                              */
} FLEXIO_TIMCFG3_TIMDIS_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCFG3 TIMRST [16..18]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCFG3_TIMRST                                                     */
  FLEXIO_TIMCFG3_TIMRST_0              = 0,     /*!< 0 : Timer never reset                                                     */
  FLEXIO_TIMCFG3_TIMRST_10             = 2,     /*!< 10 : Timer reset on Timer Pin equal to Timer Output                       */
  FLEXIO_TIMCFG3_TIMRST_11             = 3,     /*!< 11 : Timer reset on Timer Trigger equal to Timer Output                   */
  FLEXIO_TIMCFG3_TIMRST_100            = 4,     /*!< 100 : Timer reset on Timer Pin rising edge                                */
  FLEXIO_TIMCFG3_TIMRST_110            = 6,     /*!< 110 : Timer reset on Trigger rising edge                                  */
  FLEXIO_TIMCFG3_TIMRST_111            = 7,     /*!< 111 : Timer reset on Trigger rising or falling edge                       */
} FLEXIO_TIMCFG3_TIMRST_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCFG3 TIMDEC [20..21]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCFG3_TIMDEC                                                     */
  FLEXIO_TIMCFG3_TIMDEC_0              = 0,     /*!< 0 : Decrement counter on FlexIO clock, Shift clock equals Timer
                                                     output.                                                                   */
  FLEXIO_TIMCFG3_TIMDEC_1              = 1,     /*!< 1 : Decrement counter on Trigger input (both edges), Shift clock
                                                     equals Timer output.                                                      */
  FLEXIO_TIMCFG3_TIMDEC_10             = 2,     /*!< 10 : Decrement counter on Pin input (both edges), Shift clock
                                                     equals Pin input.                                                         */
  FLEXIO_TIMCFG3_TIMDEC_11             = 3,     /*!< 11 : Decrement counter on Trigger input (both edges), Shift
                                                     clock equals Trigger input.                                               */
} FLEXIO_TIMCFG3_TIMDEC_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCFG3 TIMOUT [24..25]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCFG3_TIMOUT                                                     */
  FLEXIO_TIMCFG3_TIMOUT_0              = 0,     /*!< 0 : Timer output is logic one when enabled and is not affected
                                                     by timer reset                                                            */
  FLEXIO_TIMCFG3_TIMOUT_1              = 1,     /*!< 1 : Timer output is logic zero when enabled and is not affected
                                                     by timer reset                                                            */
  FLEXIO_TIMCFG3_TIMOUT_10             = 2,     /*!< 10 : Timer output is logic one when enabled and on timer reset            */
  FLEXIO_TIMCFG3_TIMOUT_11             = 3,     /*!< 11 : Timer output is logic zero when enabled and on timer reset           */
} FLEXIO_TIMCFG3_TIMOUT_Enum;

/* ====================================================  FLEXIO_TIMCMP0  ===================================================== */
/* ====================================================  FLEXIO_TIMCMP1  ===================================================== */
/* ====================================================  FLEXIO_TIMCMP2  ===================================================== */
/* ====================================================  FLEXIO_TIMCMP3  ===================================================== */


/* =========================================================================================================================== */
/* ================                                          TRGMUX                                           ================ */
/* =========================================================================================================================== */

/* ====================================================  TRGMUX_DMAMUX0  ===================================================== */
/* ===========================================  TRGMUX TRGMUX_DMAMUX0 LK [31..31]  =========================================== */
typedef enum {                                  /*!< TRGMUX_TRGMUX_DMAMUX0_LK                                                  */
  TRGMUX_TRGMUX_DMAMUX0_LK_0           = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_DMAMUX0_LK_1           = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_DMAMUX0_LK_Enum;

