nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =====================================================  TRGMUX_LPSPI0  ===================================================== */
/* ===========================================  TRGMUX TRGMUX_LPSPI0 LK [31..31]  ============================================ */
typedef enum {                                  /*!< TRGMUX_TRGMUX_LPSPI0_LK                                                   */
  TRGMUX_TRGMUX_LPSPI0_LK_0            = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_LPSPI0_LK_1            = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_LPSPI0_LK_Enum;

/* =====================================================  TRGMUX_LPSPI1  ===================================================== */
/* ===========================================  TRGMUX TRGMUX_LPSPI1 LK [31..31]  ============================================ */
typedef enum {                                  /*!< TRGMUX_TRGMUX_LPSPI1_LK                                                   */
  TRGMUX_TRGMUX_LPSPI1_LK_0            = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_LPSPI1_LK_1            = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_LPSPI1_LK_Enum;

/* =====================================================  TRGMUX_LPTMR0  ===================================================== */
/* ===========================================  TRGMUX TRGMUX_LPTMR0 LK [31..31]  ============================================ */
typedef enum {                                  /*!< TRGMUX_TRGMUX_LPTMR0_LK                                                   */
  TRGMUX_TRGMUX_LPTMR0_LK_0            = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_LPTMR0_LK_1            = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_LPTMR0_LK_Enum;



/* =========================================================================================================================== */
/* ================                                            SCG                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  SCG_VERID  ======================================================= */
/* =======================================================  SCG_PARAM  ======================================================= */
/* ========================================================  SCG_CSR  ======================================================== */
/* ==============================================  SCG SCG_CSR DIVSLOW [0..3]  =============================================== */
typedef enum {                                  /*!< SCG_CSR_DIVSLOW                                                           */
  SCG_CSR_DIVSLOW_0000                 = 0,     /*!< 0000 : Divide-by-1                                                        */
  SCG_CSR_DIVSLOW_0001                 = 1,     /*!< 0001 : Divide-by-2                                                        */
  SCG_CSR_DIVSLOW_0010                 = 2,     /*!< 0010 : Divide-by-3                                                        */
  SCG_CSR_DIVSLOW_0011                 = 3,     /*!< 0011 : Divide-by-4                                                        */
  SCG_CSR_DIVSLOW_0100                 = 4,     /*!< 0100 : Divide-by-5                                                        */
  SCG_CSR_DIVSLOW_0101                 = 5,     /*!< 0101 : Divide-by-6                                                        */
  SCG_CSR_DIVSLOW_0110                 = 6,     /*!< 0110 : Divide-by-7                                                        */
  SCG_CSR_DIVSLOW_0111                 = 7,     /*!< 0111 : Divide-by-8                                                        */
} SCG_CSR_DIVSLOW_Enum;

/* ===============================================  SCG SCG_CSR DIVBUS [4..7]  =============================================== */
typedef enum {                                  /*!< SCG_CSR_DIVBUS                                                            */
  SCG_CSR_DIVBUS_0000                  = 0,     /*!< 0000 : Divide-by-1                                                        */
  SCG_CSR_DIVBUS_0001                  = 1,     /*!< 0001 : Divide-by-2                                                        */
  SCG_CSR_DIVBUS_0010                  = 2,     /*!< 0010 : Divide-by-3                                                        */
  SCG_CSR_DIVBUS_0011                  = 3,     /*!< 0011 : Divide-by-4                                                        */
  SCG_CSR_DIVBUS_0100                  = 4,     /*!< 0100 : Divide-by-5                                                        */
  SCG_CSR_DIVBUS_0101                  = 5,     /*!< 0101 : Divide-by-6                                                        */
  SCG_CSR_DIVBUS_0110                  = 6,     /*!< 0110 : Divide-by-7                                                        */
  SCG_CSR_DIVBUS_0111                  = 7,     /*!< 0111 : Divide-by-8                                                        */
  SCG_CSR_DIVBUS_1000                  = 8,     /*!< 1000 : Divide-by-9                                                        */
  SCG_CSR_DIVBUS_1001                  = 9,     /*!< 1001 : Divide-by-10                                                       */
  SCG_CSR_DIVBUS_1010                  = 10,    /*!< 1010 : Divide-by-11                                                       */
  SCG_CSR_DIVBUS_1011                  = 11,    /*!< 1011 : Divide-by-12                                                       */
  SCG_CSR_DIVBUS_1100                  = 12,    /*!< 1100 : Divide-by-13                                                       */
  SCG_CSR_DIVBUS_1101                  = 13,    /*!< 1101 : Divide-by-14                                                       */
  SCG_CSR_DIVBUS_1110                  = 14,    /*!< 1110 : Divide-by-15                                                       */
  SCG_CSR_DIVBUS_1111                  = 15,    /*!< 1111 : Divide-by-16                                                       */
} SCG_CSR_DIVBUS_Enum;

/* =============================================  SCG SCG_CSR DIVCORE [16..19]  ============================================== */
typedef enum {                                  /*!< SCG_CSR_DIVCORE                                                           */
  SCG_CSR_DIVCORE_0000                 = 0,     /*!< 0000 : Divide-by-1                                                        */
  SCG_CSR_DIVCORE_0001                 = 1,     /*!< 0001 : Divide-by-2                                                        */
  SCG_CSR_DIVCORE_0010                 = 2,     /*!< 0010 : Divide-by-3                                                        */
  SCG_CSR_DIVCORE_0011                 = 3,     /*!< 0011 : Divide-by-4                                                        */
  SCG_CSR_DIVCORE_0100                 = 4,     /*!< 0100 : Divide-by-5                                                        */
  SCG_CSR_DIVCORE_0101                 = 5,     /*!< 0101 : Divide-by-6                                                        */
  SCG_CSR_DIVCORE_0110                 = 6,     /*!< 0110 : Divide-by-7                                                        */
  SCG_CSR_DIVCORE_0111                 = 7,     /*!< 0111 : Divide-by-8                                                        */
  SCG_CSR_DIVCORE_1000                 = 8,     /*!< 1000 : Divide-by-9                                                        */
  SCG_CSR_DIVCORE_1001                 = 9,     /*!< 1001 : Divide-by-10                                                       */
  SCG_CSR_DIVCORE_1010                 = 10,    /*!< 1010 : Divide-by-11                                                       */
  SCG_CSR_DIVCORE_1011                 = 11,    /*!< 1011 : Divide-by-12                                                       */
  SCG_CSR_DIVCORE_1100                 = 12,    /*!< 1100 : Divide-by-13                                                       */
  SCG_CSR_DIVCORE_1101                 = 13,    /*!< 1101 : Divide-by-14                                                       */
  SCG_CSR_DIVCORE_1110                 = 14,    /*!< 1110 : Divide-by-15                                                       */
  SCG_CSR_DIVCORE_1111                 = 15,    /*!< 1111 : Divide-by-16                                                       */
} SCG_CSR_DIVCORE_Enum;

/* ===============================================  SCG SCG_CSR SCS [24..27]  ================================================ */
typedef enum {                                  /*!< SCG_CSR_SCS                                                               */
  SCG_CSR_SCS_0001                     = 1,     /*!< 0001 : System OSC (SOSC_CLK)                                              */
  SCG_CSR_SCS_0010                     = 2,     /*!< 0010 : Slow IRC (SIRC_CLK)                                                */
  SCG_CSR_SCS_0011                     = 3,     /*!< 0011 : Fast IRC (FIRC_CLK)                                                */
} SCG_CSR_SCS_Enum;

/* =======================================================  SCG_RCCR  ======================================================== */
/* ==============================================  SCG SCG_RCCR DIVSLOW [0..3]  ============================================== */
typedef enum {                                  /*!< SCG_RCCR_DIVSLOW                                                          */
  SCG_RCCR_DIVSLOW_0000                = 0,     /*!< 0000 : Divide-by-1                                                        */
  SCG_RCCR_DIVSLOW_0001                = 1,     /*!< 0001 : Divide-by-2                                                        */
  SCG_RCCR_DIVSLOW_0010                = 2,     /*!< 0010 : Divide-by-3                                                        */
  SCG_RCCR_DIVSLOW_0011                = 3,     /*!< 0011 : Divide-by-4                                                        */
  SCG_RCCR_DIVSLOW_0100                = 4,     /*!< 0100 : Divide-by-5                                                        */
  SCG_RCCR_DIVSLOW_0101                = 5,     /*!< 0101 : Divide-by-6                                                        */
  SCG_RCCR_DIVSLOW_0110                = 6,     /*!< 0110 : Divide-by-7                                                        */
  SCG_RCCR_DIVSLOW_0111                = 7,     /*!< 0111 : Divide-by-8                                                        */
} SCG_RCCR_DIVSLOW_Enum;

/* ==============================================  SCG SCG_RCCR DIVBUS [4..7]  =============================================== */
typedef enum {                                  /*!< SCG_RCCR_DIVBUS                                                           */
  SCG_RCCR_DIVBUS_0000                 = 0,     /*!< 0000 : Divide-by-1                                                        */
  SCG_RCCR_DIVBUS_0001                 = 1,     /*!< 0001 : Divide-by-2                                                        */
  SCG_RCCR_DIVBUS_0010                 = 2,     /*!< 0010 : Divide-by-3                                                        */
  SCG_RCCR_DIVBUS_0011                 = 3,     /*!< 0011 : Divide-by-4                                                        */
  SCG_RCCR_DIVBUS_0100                 = 4,     /*!< 0100 : Divide-by-5                                                        */
  SCG_RCCR_DIVBUS_0101                 = 5,     /*!< 0101 : Divide-by-6                                                        */
  SCG_RCCR_DIVBUS_0110                 = 6,     /*!< 0110 : Divide-by-7                                                        */
  SCG_RCCR_DIVBUS_0111                 = 7,     /*!< 0111 : Divide-by-8                                                        */
  SCG_RCCR_DIVBUS_1000                 = 8,     /*!< 1000 : Divide-by-9                                                        */
  SCG_RCCR_DIVBUS_1001                 = 9,     /*!< 1001 : Divide-by-10                                                       */
  SCG_RCCR_DIVBUS_1010                 = 10,    /*!< 1010 : Divide-by-11                                                       */
  SCG_RCCR_DIVBUS_1011                 = 11,    /*!< 1011 : Divide-by-12                                                       */
  SCG_RCCR_DIVBUS_1100                 = 12,    /*!< 1100 : Divide-by-13                                                       */
  SCG_RCCR_DIVBUS_1101                 = 13,    /*!< 1101 : Divide-by-14                                                       */
  SCG_RCCR_DIVBUS_1110                 = 14,    /*!< 1110 : Divide-by-15                                                       */
  SCG_RCCR_DIVBUS_1111                 = 15,    /*!< 1111 : Divide-by-16                                                       */
} SCG_RCCR_DIVBUS_Enum;

/* =============================================  SCG SCG_RCCR DIVCORE [16..19]  ============================================= */
typedef enum {                                  /*!< SCG_RCCR_DIVCORE                                                          */
  SCG_RCCR_DIVCORE_0000                = 0,     /*!< 0000 : Divide-by-1                                                        */
  SCG_RCCR_DIVCORE_0001                = 1,     /*!< 0001 : Divide-by-2                                                        */
  SCG_RCCR_DIVCORE_0010                = 2,     /*!< 0010 : Divide-by-3                                                        */
  SCG_RCCR_DIVCORE_0011                = 3,     /*!< 0011 : Divide-by-4                                                        */
  SCG_RCCR_DIVCORE_0100                = 4,     /*!< 0100 : Divide-by-5                                                        */
  SCG_RCCR_DIVCORE_0101                = 5,     /*!< 0101 : Divide-by-6                                                        */
  SCG_RCCR_DIVCORE_0110                = 6,     /*!< 0110 : Divide-by-7                                                        */
  SCG_RCCR_DIVCORE_0111                = 7,     /*!< 0111 : Divide-by-8                                                        */
  SCG_RCCR_DIVCORE_1000                = 8,     /*!< 1000 : Divide-by-9                                                        */
  SCG_RCCR_DIVCORE_1001                = 9,     /*!< 1001 : Divide-by-10                                                       */
  SCG_RCCR_DIVCORE_1010                = 10,    /*!< 1010 : Divide-by-11                                                       */
  SCG_RCCR_DIVCORE_1011                = 11,    /*!< 1011 : Divide-by-12                                                       */
  SCG_RCCR_DIVCORE_1100                = 12,    /*!< 1100 : Divide-by-13                                                       */
  SCG_RCCR_DIVCORE_1101                = 13,    /*!< 1101 : Divide-by-14                                                       */
  SCG_RCCR_DIVCORE_1110                = 14,    /*!< 1110 : Divide-by-15                                                       */
  SCG_RCCR_DIVCORE_1111                = 15,    /*!< 1111 : Divide-by-16                                                       */
} SCG_RCCR_DIVCORE_Enum;

/* ===============================================  SCG SCG_RCCR SCS [24..27]  =============================================== */
typedef enum {                                  /*!< SCG_RCCR_SCS                                                              */
  SCG_RCCR_SCS_0001                    = 1,     /*!< 0001 : System OSC (SOSC_CLK)                                              */
  SCG_RCCR_SCS_0010                    = 2,     /*!< 0010 : Slow IRC (SIRC_CLK)                                                */
  SCG_RCCR_SCS_0011                    = 3,     /*!< 0011 : Fast IRC (FIRC_CLK)                                                */
} SCG_RCCR_SCS_Enum;

