nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =======================================================  SCG_VCCR  ======================================================== */
/* ==============================================  SCG SCG_VCCR DIVSLOW [0..3]  ============================================== */
typedef enum {                                  /*!< SCG_VCCR_DIVSLOW                                                          */
  SCG_VCCR_DIVSLOW_0000                = 0,     /*!< 0000 : Divide-by-1                                                        */
  SCG_VCCR_DIVSLOW_0001                = 1,     /*!< 0001 : Divide-by-2                                                        */
  SCG_VCCR_DIVSLOW_0010                = 2,     /*!< 0010 : Divide-by-3                                                        */
  SCG_VCCR_DIVSLOW_0011                = 3,     /*!< 0011 : Divide-by-4                                                        */
  SCG_VCCR_DIVSLOW_0100                = 4,     /*!< 0100 : Divide-by-5                                                        */
  SCG_VCCR_DIVSLOW_0101                = 5,     /*!< 0101 : Divide-by-6                                                        */
  SCG_VCCR_DIVSLOW_0110                = 6,     /*!< 0110 : Divide-by-7                                                        */
  SCG_VCCR_DIVSLOW_0111                = 7,     /*!< 0111 : Divide-by-8                                                        */
} SCG_VCCR_DIVSLOW_Enum;

/* ==============================================  SCG SCG_VCCR DIVBUS [4..7]  =============================================== */
typedef enum {                                  /*!< SCG_VCCR_DIVBUS                                                           */
  SCG_VCCR_DIVBUS_0000                 = 0,     /*!< 0000 : Divide-by-1                                                        */
  SCG_VCCR_DIVBUS_0001                 = 1,     /*!< 0001 : Divide-by-2                                                        */
  SCG_VCCR_DIVBUS_0010                 = 2,     /*!< 0010 : Divide-by-3                                                        */
  SCG_VCCR_DIVBUS_0011                 = 3,     /*!< 0011 : Divide-by-4                                                        */
  SCG_VCCR_DIVBUS_0100                 = 4,     /*!< 0100 : Divide-by-5                                                        */
  SCG_VCCR_DIVBUS_0101                 = 5,     /*!< 0101 : Divide-by-6                                                        */
  SCG_VCCR_DIVBUS_0110                 = 6,     /*!< 0110 : Divide-by-7                                                        */
  SCG_VCCR_DIVBUS_0111                 = 7,     /*!< 0111 : Divide-by-8                                                        */
  SCG_VCCR_DIVBUS_1000                 = 8,     /*!< 1000 : Divide-by-9                                                        */
  SCG_VCCR_DIVBUS_1001                 = 9,     /*!< 1001 : Divide-by-10                                                       */
  SCG_VCCR_DIVBUS_1010                 = 10,    /*!< 1010 : Divide-by-11                                                       */
  SCG_VCCR_DIVBUS_1011                 = 11,    /*!< 1011 : Divide-by-12                                                       */
  SCG_VCCR_DIVBUS_1100                 = 12,    /*!< 1100 : Divide-by-13                                                       */
  SCG_VCCR_DIVBUS_1101                 = 13,    /*!< 1101 : Divide-by-14                                                       */
  SCG_VCCR_DIVBUS_1110                 = 14,    /*!< 1110 : Divide-by-15                                                       */
  SCG_VCCR_DIVBUS_1111                 = 15,    /*!< 1111 : Divide-by-16                                                       */
} SCG_VCCR_DIVBUS_Enum;

/* =============================================  SCG SCG_VCCR DIVCORE [16..19]  ============================================= */
typedef enum {                                  /*!< SCG_VCCR_DIVCORE                                                          */
  SCG_VCCR_DIVCORE_0000                = 0,     /*!< 0000 : Divide-by-1                                                        */
  SCG_VCCR_DIVCORE_0001                = 1,     /*!< 0001 : Divide-by-2                                                        */
  SCG_VCCR_DIVCORE_0010                = 2,     /*!< 0010 : Divide-by-3                                                        */
  SCG_VCCR_DIVCORE_0011                = 3,     /*!< 0011 : Divide-by-4                                                        */
  SCG_VCCR_DIVCORE_0100                = 4,     /*!< 0100 : Divide-by-5                                                        */
  SCG_VCCR_DIVCORE_0101                = 5,     /*!< 0101 : Divide-by-6                                                        */
  SCG_VCCR_DIVCORE_0110                = 6,     /*!< 0110 : Divide-by-7                                                        */
  SCG_VCCR_DIVCORE_0111                = 7,     /*!< 0111 : Divide-by-8                                                        */
  SCG_VCCR_DIVCORE_1000                = 8,     /*!< 1000 : Divide-by-9                                                        */
  SCG_VCCR_DIVCORE_1001                = 9,     /*!< 1001 : Divide-by-10                                                       */
  SCG_VCCR_DIVCORE_1010                = 10,    /*!< 1010 : Divide-by-11                                                       */
  SCG_VCCR_DIVCORE_1011                = 11,    /*!< 1011 : Divide-by-12                                                       */
  SCG_VCCR_DIVCORE_1100                = 12,    /*!< 1100 : Divide-by-13                                                       */
  SCG_VCCR_DIVCORE_1101                = 13,    /*!< 1101 : Divide-by-14                                                       */
  SCG_VCCR_DIVCORE_1110                = 14,    /*!< 1110 : Divide-by-15                                                       */
  SCG_VCCR_DIVCORE_1111                = 15,    /*!< 1111 : Divide-by-16                                                       */
} SCG_VCCR_DIVCORE_Enum;

/* ===============================================  SCG SCG_VCCR SCS [24..27]  =============================================== */
typedef enum {                                  /*!< SCG_VCCR_SCS                                                              */
  SCG_VCCR_SCS_0010                    = 2,     /*!< 0010 : Slow IRC (SIRC_CLK)                                                */
} SCG_VCCR_SCS_Enum;

/* ====================================================  SCG_CLKOUTCNFG  ===================================================== */
/* =========================================  SCG SCG_CLKOUTCNFG CLKOUTSEL [24..27]  ========================================= */
typedef enum {                                  /*!< SCG_CLKOUTCNFG_CLKOUTSEL                                                  */
  SCG_CLKOUTCNFG_CLKOUTSEL_0000        = 0,     /*!< 0000 : SCG SLOW Clock                                                     */
  SCG_CLKOUTCNFG_CLKOUTSEL_0001        = 1,     /*!< 0001 : System OSC (SOSC_CLK)                                              */
  SCG_CLKOUTCNFG_CLKOUTSEL_0010        = 2,     /*!< 0010 : Slow IRC (SIRC_CLK)                                                */
  SCG_CLKOUTCNFG_CLKOUTSEL_0011        = 3,     /*!< 0011 : Fast IRC (FIRC_CLK)                                                */
} SCG_CLKOUTCNFG_CLKOUTSEL_Enum;

