nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =======================================================  PCC_PDB0  ======================================================== */
/* ===============================================  PCC PCC_PDB0 CGC [30..30]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_PDB0_CGC                                                          */
  PCC_PCC_PDB0_CGC_0                   = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_PDB0_CGC_1                   = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_PDB0_CGC_Enum;

/* ===============================================  PCC PCC_PDB0 PR [31..31]  ================================================ */
typedef enum {                                  /*!< PCC_PCC_PDB0_PR                                                           */
  PCC_PCC_PDB0_PR_0                    = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_PDB0_PR_1                    = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_PDB0_PR_Enum;

/* =======================================================  PCC_LPIT  ======================================================== */
/* ===============================================  PCC PCC_LPIT PCS [24..26]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_LPIT_PCS                                                          */
  PCC_PCC_LPIT_PCS_000                 = 0,     /*!< 000 : Clock is off.                                                       */
  PCC_PCC_LPIT_PCS_001                 = 1,     /*!< 001 : Clock option 1                                                      */
  PCC_PCC_LPIT_PCS_010                 = 2,     /*!< 010 : Clock option 2                                                      */
  PCC_PCC_LPIT_PCS_011                 = 3,     /*!< 011 : Clock option 3                                                      */
  PCC_PCC_LPIT_PCS_100                 = 4,     /*!< 100 : Clock option 4                                                      */
  PCC_PCC_LPIT_PCS_101                 = 5,     /*!< 101 : Clock option 5                                                      */
  PCC_PCC_LPIT_PCS_110                 = 6,     /*!< 110 : Clock option 6                                                      */
  PCC_PCC_LPIT_PCS_111                 = 7,     /*!< 111 : Clock option 7                                                      */
} PCC_PCC_LPIT_PCS_Enum;

/* ===============================================  PCC PCC_LPIT CGC [30..30]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_LPIT_CGC                                                          */
  PCC_PCC_LPIT_CGC_0                   = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_LPIT_CGC_1                   = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_LPIT_CGC_Enum;

/* ===============================================  PCC PCC_LPIT PR [31..31]  ================================================ */
typedef enum {                                  /*!< PCC_PCC_LPIT_PR                                                           */
  PCC_PCC_LPIT_PR_0                    = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_LPIT_PR_1                    = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_LPIT_PR_Enum;

/* =======================================================  PCC_FTM0  ======================================================== */
/* ===============================================  PCC PCC_FTM0 PCS [24..26]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_FTM0_PCS                                                          */
  PCC_PCC_FTM0_PCS_000                 = 0,     /*!< 000 : Clock is off. An external clock can be enabled for this
                                                     peripheral.                                                               */
  PCC_PCC_FTM0_PCS_001                 = 1,     /*!< 001 : Clock option 1                                                      */
  PCC_PCC_FTM0_PCS_010                 = 2,     /*!< 010 : Clock option 2                                                      */
  PCC_PCC_FTM0_PCS_011                 = 3,     /*!< 011 : Clock option 3                                                      */
  PCC_PCC_FTM0_PCS_100                 = 4,     /*!< 100 : Clock option 4                                                      */
  PCC_PCC_FTM0_PCS_101                 = 5,     /*!< 101 : Clock option 5                                                      */
  PCC_PCC_FTM0_PCS_110                 = 6,     /*!< 110 : Clock option 6                                                      */
  PCC_PCC_FTM0_PCS_111                 = 7,     /*!< 111 : Clock option 7                                                      */
} PCC_PCC_FTM0_PCS_Enum;

/* ===============================================  PCC PCC_FTM0 CGC [30..30]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_FTM0_CGC                                                          */
  PCC_PCC_FTM0_CGC_0                   = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_FTM0_CGC_1                   = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_FTM0_CGC_Enum;

/* ===============================================  PCC PCC_FTM0 PR [31..31]  ================================================ */
typedef enum {                                  /*!< PCC_PCC_FTM0_PR                                                           */
  PCC_PCC_FTM0_PR_0                    = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_FTM0_PR_1                    = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_FTM0_PR_Enum;

