nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  PCC_LPTMR0  ======================================================= */
/* ===============================================  PCC PCC_LPTMR0 PCD [0..3]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_LPTMR0_PCD                                                        */
  PCC_PCC_LPTMR0_PCD_0000              = 0,     /*!< 0000 : Divide by 1.                                                       */
  PCC_PCC_LPTMR0_PCD_0001              = 1,     /*!< 0001 : Divide by 2.                                                       */
  PCC_PCC_LPTMR0_PCD_0010              = 2,     /*!< 0010 : Divide by 3.                                                       */
  PCC_PCC_LPTMR0_PCD_0011              = 3,     /*!< 0011 : Divide by 4.                                                       */
  PCC_PCC_LPTMR0_PCD_0100              = 4,     /*!< 0100 : Divide by 5.                                                       */
  PCC_PCC_LPTMR0_PCD_0101              = 5,     /*!< 0101 : Divide by 6.                                                       */
  PCC_PCC_LPTMR0_PCD_0110              = 6,     /*!< 0110 : Divide by 7.                                                       */
  PCC_PCC_LPTMR0_PCD_0111              = 7,     /*!< 0111 : Divide by 8.                                                       */
} PCC_PCC_LPTMR0_PCD_Enum;

/* ==============================================  PCC PCC_LPTMR0 FRAC [4..4]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_LPTMR0_FRAC                                                       */
  PCC_PCC_LPTMR0_FRAC_0                = 0,     /*!< 0 : Fractional value is 0.                                                */
  PCC_PCC_LPTMR0_FRAC_1                = 1,     /*!< 1 : Fractional value is 1.                                                */
} PCC_PCC_LPTMR0_FRAC_Enum;

/* ==============================================  PCC PCC_LPTMR0 PCS [24..26]  ============================================== */
typedef enum {                                  /*!< PCC_PCC_LPTMR0_PCS                                                        */
  PCC_PCC_LPTMR0_PCS_000               = 0,     /*!< 000 : Clock is off.                                                       */
  PCC_PCC_LPTMR0_PCS_001               = 1,     /*!< 001 : Clock option 1                                                      */
  PCC_PCC_LPTMR0_PCS_010               = 2,     /*!< 010 : Clock option 2                                                      */
  PCC_PCC_LPTMR0_PCS_011               = 3,     /*!< 011 : Clock option 3                                                      */
  PCC_PCC_LPTMR0_PCS_100               = 4,     /*!< 100 : Clock option 4                                                      */
  PCC_PCC_LPTMR0_PCS_101               = 5,     /*!< 101 : Clock option 5                                                      */
  PCC_PCC_LPTMR0_PCS_110               = 6,     /*!< 110 : Clock option 6                                                      */
  PCC_PCC_LPTMR0_PCS_111               = 7,     /*!< 111 : Clock option 7                                                      */
} PCC_PCC_LPTMR0_PCS_Enum;

/* ==============================================  PCC PCC_LPTMR0 CGC [30..30]  ============================================== */
typedef enum {                                  /*!< PCC_PCC_LPTMR0_CGC                                                        */
  PCC_PCC_LPTMR0_CGC_0                 = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_LPTMR0_CGC_1                 = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_LPTMR0_CGC_Enum;

/* ==============================================  PCC PCC_LPTMR0 PR [31..31]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_LPTMR0_PR                                                         */
  PCC_PCC_LPTMR0_PR_0                  = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_LPTMR0_PR_1                  = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_LPTMR0_PR_Enum;

/* =======================================================  PCC_PORTA  ======================================================= */
/* ==============================================  PCC PCC_PORTA CGC [30..30]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_PORTA_CGC                                                         */
  PCC_PCC_PORTA_CGC_0                  = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_PORTA_CGC_1                  = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_PORTA_CGC_Enum;

/* ===============================================  PCC PCC_PORTA PR [31..31]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_PORTA_PR                                                          */
  PCC_PCC_PORTA_PR_0                   = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_PORTA_PR_1                   = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_PORTA_PR_Enum;

/* =======================================================  PCC_PORTB  ======================================================= */
/* ==============================================  PCC PCC_PORTB CGC [30..30]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_PORTB_CGC                                                         */
  PCC_PCC_PORTB_CGC_0                  = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_PORTB_CGC_1                  = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_PORTB_CGC_Enum;

/* ===============================================  PCC PCC_PORTB PR [31..31]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_PORTB_PR                                                          */
  PCC_PCC_PORTB_PR_0                   = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_PORTB_PR_1                   = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_PORTB_PR_Enum;

