nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =======================================================  PCC_PORTC  ======================================================= */
/* ==============================================  PCC PCC_PORTC CGC [30..30]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_PORTC_CGC                                                         */
  PCC_PCC_PORTC_CGC_0                  = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_PORTC_CGC_1                  = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_PORTC_CGC_Enum;

/* ===============================================  PCC PCC_PORTC PR [31..31]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_PORTC_PR                                                          */
  PCC_PCC_PORTC_PR_0                   = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_PORTC_PR_1                   = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_PORTC_PR_Enum;

/* =======================================================  PCC_PORTD  ======================================================= */
/* ==============================================  PCC PCC_PORTD CGC [30..30]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_PORTD_CGC                                                         */
  PCC_PCC_PORTD_CGC_0                  = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_PORTD_CGC_1                  = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_PORTD_CGC_Enum;

/* ===============================================  PCC PCC_PORTD PR [31..31]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_PORTD_PR                                                          */
  PCC_PCC_PORTD_PR_0                   = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_PORTD_PR_1                   = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_PORTD_PR_Enum;

/* =======================================================  PCC_PORTE  ======================================================= */
/* ==============================================  PCC PCC_PORTE CGC [30..30]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_PORTE_CGC                                                         */
  PCC_PCC_PORTE_CGC_0                  = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_PORTE_CGC_1                  = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_PORTE_CGC_Enum;

/* ===============================================  PCC PCC_PORTE PR [31..31]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_PORTE_PR                                                          */
  PCC_PCC_PORTE_PR_0                   = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_PORTE_PR_1                   = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_PORTE_PR_Enum;

/* ======================================================  PCC_FlexIO  ======================================================= */
/* ==============================================  PCC PCC_FlexIO PCS [24..26]  ============================================== */
typedef enum {                                  /*!< PCC_PCC_FlexIO_PCS                                                        */
  PCC_PCC_FlexIO_PCS_000               = 0,     /*!< 000 : Clock is off.                                                       */
  PCC_PCC_FlexIO_PCS_001               = 1,     /*!< 001 : Clock option 1                                                      */
  PCC_PCC_FlexIO_PCS_010               = 2,     /*!< 010 : Clock option 2                                                      */
  PCC_PCC_FlexIO_PCS_011               = 3,     /*!< 011 : Clock option 3                                                      */
  PCC_PCC_FlexIO_PCS_100               = 4,     /*!< 100 : Clock option 4                                                      */
  PCC_PCC_FlexIO_PCS_101               = 5,     /*!< 101 : Clock option 5                                                      */
  PCC_PCC_FlexIO_PCS_110               = 6,     /*!< 110 : Clock option 6                                                      */
  PCC_PCC_FlexIO_PCS_111               = 7,     /*!< 111 : Clock option 7                                                      */
} PCC_PCC_FlexIO_PCS_Enum;

/* ==============================================  PCC PCC_FlexIO CGC [30..30]  ============================================== */
typedef enum {                                  /*!< PCC_PCC_FlexIO_CGC                                                        */
  PCC_PCC_FlexIO_CGC_0                 = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_FlexIO_CGC_1                 = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_FlexIO_CGC_Enum;

/* ==============================================  PCC PCC_FlexIO PR [31..31]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_FlexIO_PR                                                         */
  PCC_PCC_FlexIO_PR_0                  = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_FlexIO_PR_1                  = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_FlexIO_PR_Enum;

/* ======================================================  PCC_LPI2C0  ======================================================= */
/* ==============================================  PCC PCC_LPI2C0 PCS [24..26]  ============================================== */
typedef enum {                                  /*!< PCC_PCC_LPI2C0_PCS                                                        */
  PCC_PCC_LPI2C0_PCS_000               = 0,     /*!< 000 : Clock is off.                                                       */
  PCC_PCC_LPI2C0_PCS_001               = 1,     /*!< 001 : Clock option 1                                                      */
  PCC_PCC_LPI2C0_PCS_010               = 2,     /*!< 010 : Clock option 2                                                      */
  PCC_PCC_LPI2C0_PCS_011               = 3,     /*!< 011 : Clock option 3                                                      */
  PCC_PCC_LPI2C0_PCS_100               = 4,     /*!< 100 : Clock option 4                                                      */
  PCC_PCC_LPI2C0_PCS_101               = 5,     /*!< 101 : Clock option 5                                                      */
  PCC_PCC_LPI2C0_PCS_110               = 6,     /*!< 110 : Clock option 6                                                      */
  PCC_PCC_LPI2C0_PCS_111               = 7,     /*!< 111 : Clock option 7                                                      */
} PCC_PCC_LPI2C0_PCS_Enum;

/* ==============================================  PCC PCC_LPI2C0 CGC [30..30]  ============================================== */
typedef enum {                                  /*!< PCC_PCC_LPI2C0_CGC                                                        */
  PCC_PCC_LPI2C0_CGC_0                 = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_LPI2C0_CGC_1                 = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_LPI2C0_CGC_Enum;

/* ==============================================  PCC PCC_LPI2C0 PR [31..31]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_LPI2C0_PR                                                         */
  PCC_PCC_LPI2C0_PR_0                  = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_LPI2C0_PR_1                  = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_LPI2C0_PR_Enum;

