nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===========================================  LPI2C0 LPI2C0_MIER NDIE [10..10]  ============================================ */
typedef enum {                                  /*!< LPI2C0_MIER_NDIE                                                          */
  LPI2C0_MIER_NDIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_MIER_NDIE_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_MIER_NDIE_Enum;

/* ===========================================  LPI2C0 LPI2C0_MIER ALIE [11..11]  ============================================ */
typedef enum {                                  /*!< LPI2C0_MIER_ALIE                                                          */
  LPI2C0_MIER_ALIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_MIER_ALIE_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_MIER_ALIE_Enum;

/* ===========================================  LPI2C0 LPI2C0_MIER FEIE [12..12]  ============================================ */
typedef enum {                                  /*!< LPI2C0_MIER_FEIE                                                          */
  LPI2C0_MIER_FEIE_0                   = 0,     /*!< 0 : Interrupt enabled.                                                    */
  LPI2C0_MIER_FEIE_1                   = 1,     /*!< 1 : Interrupt disabled.                                                   */
} LPI2C0_MIER_FEIE_Enum;

/* ===========================================  LPI2C0 LPI2C0_MIER PLTIE [13..13]  =========================================== */
typedef enum {                                  /*!< LPI2C0_MIER_PLTIE                                                         */
  LPI2C0_MIER_PLTIE_0                  = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_MIER_PLTIE_1                  = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_MIER_PLTIE_Enum;

/* ===========================================  LPI2C0 LPI2C0_MIER DMIE [14..14]  ============================================ */
typedef enum {                                  /*!< LPI2C0_MIER_DMIE                                                          */
  LPI2C0_MIER_DMIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_MIER_DMIE_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_MIER_DMIE_Enum;

/* ======================================================  LPI2C0_MDER  ====================================================== */
/* ============================================  LPI2C0 LPI2C0_MDER TDDE [0..0]  ============================================= */
typedef enum {                                  /*!< LPI2C0_MDER_TDDE                                                          */
  LPI2C0_MDER_TDDE_0                   = 0,     /*!< 0 : DMA request disabled.                                                 */
  LPI2C0_MDER_TDDE_1                   = 1,     /*!< 1 : DMA request enabled                                                   */
} LPI2C0_MDER_TDDE_Enum;

/* ============================================  LPI2C0 LPI2C0_MDER RDDE [1..1]  ============================================= */
typedef enum {                                  /*!< LPI2C0_MDER_RDDE                                                          */
  LPI2C0_MDER_RDDE_0                   = 0,     /*!< 0 : DMA request disabled.                                                 */
  LPI2C0_MDER_RDDE_1                   = 1,     /*!< 1 : DMA request enabled.                                                  */
} LPI2C0_MDER_RDDE_Enum;

/* =====================================================  LPI2C0_MCFGR0  ===================================================== */
/* ===========================================  LPI2C0 LPI2C0_MCFGR0 HREN [0..0]  ============================================ */
typedef enum {                                  /*!< LPI2C0_MCFGR0_HREN                                                        */
  LPI2C0_MCFGR0_HREN_0                 = 0,     /*!< 0 : Host request input is disabled.                                       */
  LPI2C0_MCFGR0_HREN_1                 = 1,     /*!< 1 : Host request input is enabled.                                        */
} LPI2C0_MCFGR0_HREN_Enum;

/* ===========================================  LPI2C0 LPI2C0_MCFGR0 HRPOL [1..1]  =========================================== */
typedef enum {                                  /*!< LPI2C0_MCFGR0_HRPOL                                                       */
  LPI2C0_MCFGR0_HRPOL_0                = 0,     /*!< 0 : Active low.                                                           */
  LPI2C0_MCFGR0_HRPOL_1                = 1,     /*!< 1 : Active high.                                                          */
} LPI2C0_MCFGR0_HRPOL_Enum;

/* ===========================================  LPI2C0 LPI2C0_MCFGR0 HRSEL [2..2]  =========================================== */
typedef enum {                                  /*!< LPI2C0_MCFGR0_HRSEL                                                       */
  LPI2C0_MCFGR0_HRSEL_0                = 0,     /*!< 0 : Host request input is pin HREQ.                                       */
  LPI2C0_MCFGR0_HRSEL_1                = 1,     /*!< 1 : Host request input is input trigger.                                  */
} LPI2C0_MCFGR0_HRSEL_Enum;

/* ==========================================  LPI2C0 LPI2C0_MCFGR0 CIRFIFO [8..8]  ========================================== */
typedef enum {                                  /*!< LPI2C0_MCFGR0_CIRFIFO                                                     */
  LPI2C0_MCFGR0_CIRFIFO_0              = 0,     /*!< 0 : Circular FIFO is disabled.                                            */
  LPI2C0_MCFGR0_CIRFIFO_1              = 1,     /*!< 1 : Circular FIFO is enabled.                                             */
} LPI2C0_MCFGR0_CIRFIFO_Enum;

/* ===========================================  LPI2C0 LPI2C0_MCFGR0 RDMO [9..9]  ============================================ */
typedef enum {                                  /*!< LPI2C0_MCFGR0_RDMO                                                        */
  LPI2C0_MCFGR0_RDMO_0                 = 0,     /*!< 0 : Received data is stored in the receive FIFO as normal.                */
  LPI2C0_MCFGR0_RDMO_1                 = 1,     /*!< 1 : Received data is discarded unless the RMF is set.                     */
} LPI2C0_MCFGR0_RDMO_Enum;

/* =====================================================  LPI2C0_MCFGR1  ===================================================== */
/* =========================================  LPI2C0 LPI2C0_MCFGR1 PRESCALE [0..2]  ========================================== */
typedef enum {                                  /*!< LPI2C0_MCFGR1_PRESCALE                                                    */
  LPI2C0_MCFGR1_PRESCALE_000           = 0,     /*!< 000 : Divide by 1.                                                        */
  LPI2C0_MCFGR1_PRESCALE_001           = 1,     /*!< 001 : Divide by 2.                                                        */
  LPI2C0_MCFGR1_PRESCALE_010           = 2,     /*!< 010 : Divide by 4.                                                        */
  LPI2C0_MCFGR1_PRESCALE_011           = 3,     /*!< 011 : Divide by 8.                                                        */
  LPI2C0_MCFGR1_PRESCALE_100           = 4,     /*!< 100 : Divide by 16.                                                       */
  LPI2C0_MCFGR1_PRESCALE_101           = 5,     /*!< 101 : Divide by 32.                                                       */
  LPI2C0_MCFGR1_PRESCALE_110           = 6,     /*!< 110 : Divide by 64.                                                       */
  LPI2C0_MCFGR1_PRESCALE_111           = 7,     /*!< 111 : Divide by 128.                                                      */
} LPI2C0_MCFGR1_PRESCALE_Enum;

/* =========================================  LPI2C0 LPI2C0_MCFGR1 AUTOSTOP [8..8]  ========================================== */
typedef enum {                                  /*!< LPI2C0_MCFGR1_AUTOSTOP                                                    */
  LPI2C0_MCFGR1_AUTOSTOP_0             = 0,     /*!< 0 : No effect.                                                            */
  LPI2C0_MCFGR1_AUTOSTOP_1             = 1,     /*!< 1 : STOP condition is automatically generated whenever the transmit
                                                     FIFO is empty and LPI2C master is busy.                                   */
} LPI2C0_MCFGR1_AUTOSTOP_Enum;

