nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  LPI2C0 LPI2C0_SSR GCF [14..14]  ============================================= */
typedef enum {                                  /*!< LPI2C0_SSR_GCF                                                            */
  LPI2C0_SSR_GCF_0                     = 0,     /*!< 0 : Slave has not detected the General Call Address or General
                                                     Call Address disabled.                                                    */
  LPI2C0_SSR_GCF_1                     = 1,     /*!< 1 : Slave has detected the General Call Address.                          */
} LPI2C0_SSR_GCF_Enum;

/* ============================================  LPI2C0 LPI2C0_SSR SARF [15..15]  ============================================ */
typedef enum {                                  /*!< LPI2C0_SSR_SARF                                                           */
  LPI2C0_SSR_SARF_0                    = 0,     /*!< 0 : SMBus Alert Response disabled or not detected.                        */
  LPI2C0_SSR_SARF_1                    = 1,     /*!< 1 : SMBus Alert Response enabled and detected.                            */
} LPI2C0_SSR_SARF_Enum;

/* ============================================  LPI2C0 LPI2C0_SSR SBF [24..24]  ============================================= */
typedef enum {                                  /*!< LPI2C0_SSR_SBF                                                            */
  LPI2C0_SSR_SBF_0                     = 0,     /*!< 0 : I2C Slave is idle.                                                    */
  LPI2C0_SSR_SBF_1                     = 1,     /*!< 1 : I2C Slave is busy.                                                    */
} LPI2C0_SSR_SBF_Enum;

/* ============================================  LPI2C0 LPI2C0_SSR BBF [25..25]  ============================================= */
typedef enum {                                  /*!< LPI2C0_SSR_BBF                                                            */
  LPI2C0_SSR_BBF_0                     = 0,     /*!< 0 : I2C Bus is idle.                                                      */
  LPI2C0_SSR_BBF_1                     = 1,     /*!< 1 : I2C Bus is busy.                                                      */
} LPI2C0_SSR_BBF_Enum;

/* ======================================================  LPI2C0_SIER  ====================================================== */
/* ============================================  LPI2C0 LPI2C0_SIER TDIE [0..0]  ============================================= */
typedef enum {                                  /*!< LPI2C0_SIER_TDIE                                                          */
  LPI2C0_SIER_TDIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_SIER_TDIE_1                   = 1,     /*!< 1 : Interrupt enabled                                                     */
} LPI2C0_SIER_TDIE_Enum;

/* ============================================  LPI2C0 LPI2C0_SIER RDIE [1..1]  ============================================= */
typedef enum {                                  /*!< LPI2C0_SIER_RDIE                                                          */
  LPI2C0_SIER_RDIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_SIER_RDIE_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_SIER_RDIE_Enum;

/* ============================================  LPI2C0 LPI2C0_SIER AVIE [2..2]  ============================================= */
typedef enum {                                  /*!< LPI2C0_SIER_AVIE                                                          */
  LPI2C0_SIER_AVIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_SIER_AVIE_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_SIER_AVIE_Enum;

/* ============================================  LPI2C0 LPI2C0_SIER TAIE [3..3]  ============================================= */
typedef enum {                                  /*!< LPI2C0_SIER_TAIE                                                          */
  LPI2C0_SIER_TAIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_SIER_TAIE_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_SIER_TAIE_Enum;

/* ============================================  LPI2C0 LPI2C0_SIER RSIE [8..8]  ============================================= */
typedef enum {                                  /*!< LPI2C0_SIER_RSIE                                                          */
  LPI2C0_SIER_RSIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_SIER_RSIE_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_SIER_RSIE_Enum;

/* ============================================  LPI2C0 LPI2C0_SIER SDIE [9..9]  ============================================= */
typedef enum {                                  /*!< LPI2C0_SIER_SDIE                                                          */
  LPI2C0_SIER_SDIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_SIER_SDIE_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_SIER_SDIE_Enum;

/* ===========================================  LPI2C0 LPI2C0_SIER BEIE [10..10]  ============================================ */
typedef enum {                                  /*!< LPI2C0_SIER_BEIE                                                          */
  LPI2C0_SIER_BEIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_SIER_BEIE_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_SIER_BEIE_Enum;

/* ===========================================  LPI2C0 LPI2C0_SIER FEIE [11..11]  ============================================ */
typedef enum {                                  /*!< LPI2C0_SIER_FEIE                                                          */
  LPI2C0_SIER_FEIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_SIER_FEIE_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_SIER_FEIE_Enum;

/* ===========================================  LPI2C0 LPI2C0_SIER AM0IE [12..12]  =========================================== */
typedef enum {                                  /*!< LPI2C0_SIER_AM0IE                                                         */
  LPI2C0_SIER_AM0IE_0                  = 0,     /*!< 0 : Interrupt enabled.                                                    */
  LPI2C0_SIER_AM0IE_1                  = 1,     /*!< 1 : Interrupt disabled.                                                   */
} LPI2C0_SIER_AM0IE_Enum;

/* ===========================================  LPI2C0 LPI2C0_SIER AM1F [13..13]  ============================================ */
typedef enum {                                  /*!< LPI2C0_SIER_AM1F                                                          */
  LPI2C0_SIER_AM1F_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_SIER_AM1F_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_SIER_AM1F_Enum;

