nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===========================================  LPI2C0 LPI2C0_SIER GCIE [14..14]  ============================================ */
typedef enum {                                  /*!< LPI2C0_SIER_GCIE                                                          */
  LPI2C0_SIER_GCIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_SIER_GCIE_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_SIER_GCIE_Enum;

/* ===========================================  LPI2C0 LPI2C0_SIER SARIE [15..15]  =========================================== */
typedef enum {                                  /*!< LPI2C0_SIER_SARIE                                                         */
  LPI2C0_SIER_SARIE_0                  = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_SIER_SARIE_1                  = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_SIER_SARIE_Enum;

/* ======================================================  LPI2C0_SDER  ====================================================== */
/* ============================================  LPI2C0 LPI2C0_SDER TDDE [0..0]  ============================================= */
typedef enum {                                  /*!< LPI2C0_SDER_TDDE                                                          */
  LPI2C0_SDER_TDDE_0                   = 0,     /*!< 0 : DMA request disabled.                                                 */
  LPI2C0_SDER_TDDE_1                   = 1,     /*!< 1 : DMA request enabled                                                   */
} LPI2C0_SDER_TDDE_Enum;

/* ============================================  LPI2C0 LPI2C0_SDER RDDE [1..1]  ============================================= */
typedef enum {                                  /*!< LPI2C0_SDER_RDDE                                                          */
  LPI2C0_SDER_RDDE_0                   = 0,     /*!< 0 : DMA request disabled.                                                 */
  LPI2C0_SDER_RDDE_1                   = 1,     /*!< 1 : DMA request enabled.                                                  */
} LPI2C0_SDER_RDDE_Enum;

/* ============================================  LPI2C0 LPI2C0_SDER AVDE [2..2]  ============================================= */
typedef enum {                                  /*!< LPI2C0_SDER_AVDE                                                          */
  LPI2C0_SDER_AVDE_0                   = 0,     /*!< 0 : DMA request disabled.                                                 */
  LPI2C0_SDER_AVDE_1                   = 1,     /*!< 1 : DMA request enabled.                                                  */
} LPI2C0_SDER_AVDE_Enum;

/* =====================================================  LPI2C0_SCFGR1  ===================================================== */
/* =========================================  LPI2C0 LPI2C0_SCFGR1 ADRSTALL [0..0]  ========================================== */
typedef enum {                                  /*!< LPI2C0_SCFGR1_ADRSTALL                                                    */
  LPI2C0_SCFGR1_ADRSTALL_0             = 0,     /*!< 0 : Clock stretching disabled.                                            */
  LPI2C0_SCFGR1_ADRSTALL_1             = 1,     /*!< 1 : Clock stretching enabled.                                             */
} LPI2C0_SCFGR1_ADRSTALL_Enum;

/* ==========================================  LPI2C0 LPI2C0_SCFGR1 RXSTALL [1..1]  ========================================== */
typedef enum {                                  /*!< LPI2C0_SCFGR1_RXSTALL                                                     */
  LPI2C0_SCFGR1_RXSTALL_0              = 0,     /*!< 0 : Clock stretching disabled.                                            */
  LPI2C0_SCFGR1_RXSTALL_1              = 1,     /*!< 1 : Clock stretching enabled.                                             */
} LPI2C0_SCFGR1_RXSTALL_Enum;

/* =========================================  LPI2C0 LPI2C0_SCFGR1 TXDSTALL [2..2]  ========================================== */
typedef enum {                                  /*!< LPI2C0_SCFGR1_TXDSTALL                                                    */
  LPI2C0_SCFGR1_TXDSTALL_0             = 0,     /*!< 0 : Clock stretching disabled.                                            */
  LPI2C0_SCFGR1_TXDSTALL_1             = 1,     /*!< 1 : Clock stretching enabled.                                             */
} LPI2C0_SCFGR1_TXDSTALL_Enum;

/* =========================================  LPI2C0 LPI2C0_SCFGR1 ACKSTALL [3..3]  ========================================== */
typedef enum {                                  /*!< LPI2C0_SCFGR1_ACKSTALL                                                    */
  LPI2C0_SCFGR1_ACKSTALL_0             = 0,     /*!< 0 : Clock stretching disabled.                                            */
  LPI2C0_SCFGR1_ACKSTALL_1             = 1,     /*!< 1 : Clock stretching enabled.                                             */
} LPI2C0_SCFGR1_ACKSTALL_Enum;

/* ===========================================  LPI2C0 LPI2C0_SCFGR1 GCEN [8..8]  ============================================ */
typedef enum {                                  /*!< LPI2C0_SCFGR1_GCEN                                                        */
  LPI2C0_SCFGR1_GCEN_0                 = 0,     /*!< 0 : General Call address is disabled.                                     */
  LPI2C0_SCFGR1_GCEN_1                 = 1,     /*!< 1 : General call address is enabled.                                      */
} LPI2C0_SCFGR1_GCEN_Enum;

/* ===========================================  LPI2C0 LPI2C0_SCFGR1 SAEN [9..9]  ============================================ */
typedef enum {                                  /*!< LPI2C0_SCFGR1_SAEN                                                        */
  LPI2C0_SCFGR1_SAEN_0                 = 0,     /*!< 0 : Disables match on SMBus Alert.                                        */
  LPI2C0_SCFGR1_SAEN_1                 = 1,     /*!< 1 : Enables match on SMBus Alert.                                         */
} LPI2C0_SCFGR1_SAEN_Enum;

/* ==========================================  LPI2C0 LPI2C0_SCFGR1 TXCFG [10..10]  ========================================== */
typedef enum {                                  /*!< LPI2C0_SCFGR1_TXCFG                                                       */
  LPI2C0_SCFGR1_TXCFG_0                = 0,     /*!< 0 : Transmit Data Flag will only assert during a slave-transmit
                                                     transfer when the transmit data register is empty.                        */
  LPI2C0_SCFGR1_TXCFG_1                = 1,     /*!< 1 : Transmit Data Flag will assert whenever the transmit data
                                                     register is empty.                                                        */
} LPI2C0_SCFGR1_TXCFG_Enum;

/* ==========================================  LPI2C0 LPI2C0_SCFGR1 RXCFG [11..11]  ========================================== */
typedef enum {                                  /*!< LPI2C0_SCFGR1_RXCFG                                                       */
  LPI2C0_SCFGR1_RXCFG_0                = 0,     /*!< 0 : Reading the receive data register will return receive data
                                                     and clear the receive data flag.                                          */
  LPI2C0_SCFGR1_RXCFG_1                = 1,     /*!< 1 : Reading the Receive Data register when the Address Valid
                                                     flag (SSR[AVF])is set, will return the Address Status register
                                                     and clear the Address Valid flag. Reading the Receive Data
                                                     register when the Address Valid flag is clear, will return
                                                     received data and clear the Receive Data flag (MSR[RDF]).                 */
} LPI2C0_SCFGR1_RXCFG_Enum;

