nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==========================================  LPUART0 LPUART0_CTRL DOZEEN [6..6]  =========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_DOZEEN                                                       */
  LPUART0_CTRL_DOZEEN_0                = 0,     /*!< 0 : LPUART is enabled in Doze mode.                                       */
  LPUART0_CTRL_DOZEEN_1                = 1,     /*!< 1 : LPUART is disabled in Doze mode.                                      */
} LPUART0_CTRL_DOZEEN_Enum;

/* ===========================================  LPUART0 LPUART0_CTRL LOOPS [7..7]  =========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_LOOPS                                                        */
  LPUART0_CTRL_LOOPS_0                 = 0,     /*!< 0 : Normal operation - RXD and TXD use separate pins.                     */
  LPUART0_CTRL_LOOPS_1                 = 1,     /*!< 1 : Loop mode or single-wire mode where transmitter outputs
                                                     are internally connected to receiver input (see RSRC bit).                */
} LPUART0_CTRL_LOOPS_Enum;

/* =========================================  LPUART0 LPUART0_CTRL IDLECFG [8..10]  ========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_IDLECFG                                                      */
  LPUART0_CTRL_IDLECFG_000             = 0,     /*!< 000 : 1 idle character                                                    */
  LPUART0_CTRL_IDLECFG_001             = 1,     /*!< 001 : 2 idle characters                                                   */
  LPUART0_CTRL_IDLECFG_010             = 2,     /*!< 010 : 4 idle characters                                                   */
  LPUART0_CTRL_IDLECFG_011             = 3,     /*!< 011 : 8 idle characters                                                   */
  LPUART0_CTRL_IDLECFG_100             = 4,     /*!< 100 : 16 idle characters                                                  */
  LPUART0_CTRL_IDLECFG_101             = 5,     /*!< 101 : 32 idle characters                                                  */
  LPUART0_CTRL_IDLECFG_110             = 6,     /*!< 110 : 64 idle characters                                                  */
  LPUART0_CTRL_IDLECFG_111             = 7,     /*!< 111 : 128 idle characters                                                 */
} LPUART0_CTRL_IDLECFG_Enum;

/* ===========================================  LPUART0 LPUART0_CTRL M7 [11..11]  ============================================ */
typedef enum {                                  /*!< LPUART0_CTRL_M7                                                           */
  LPUART0_CTRL_M7_0                    = 0,     /*!< 0 : Receiver and transmitter use 8-bit to 10-bit data characters.         */
  LPUART0_CTRL_M7_1                    = 1,     /*!< 1 : Receiver and transmitter use 7-bit data characters.                   */
} LPUART0_CTRL_M7_Enum;

/* ==========================================  LPUART0 LPUART0_CTRL MA2IE [14..14]  ========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_MA2IE                                                        */
  LPUART0_CTRL_MA2IE_0                 = 0,     /*!< 0 : MA2F interrupt disabled                                               */
  LPUART0_CTRL_MA2IE_1                 = 1,     /*!< 1 : MA2F interrupt enabled                                                */
} LPUART0_CTRL_MA2IE_Enum;

/* ==========================================  LPUART0 LPUART0_CTRL MA1IE [15..15]  ========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_MA1IE                                                        */
  LPUART0_CTRL_MA1IE_0                 = 0,     /*!< 0 : MA1F interrupt disabled                                               */
  LPUART0_CTRL_MA1IE_1                 = 1,     /*!< 1 : MA1F interrupt enabled                                                */
} LPUART0_CTRL_MA1IE_Enum;

/* ===========================================  LPUART0 LPUART0_CTRL SBK [16..16]  =========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_SBK                                                          */
  LPUART0_CTRL_SBK_0                   = 0,     /*!< 0 : Normal transmitter operation.                                         */
  LPUART0_CTRL_SBK_1                   = 1,     /*!< 1 : Queue break character(s) to be sent.                                  */
} LPUART0_CTRL_SBK_Enum;

/* ===========================================  LPUART0 LPUART0_CTRL RWU [17..17]  =========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_RWU                                                          */
  LPUART0_CTRL_RWU_0                   = 0,     /*!< 0 : Normal receiver operation.                                            */
  LPUART0_CTRL_RWU_1                   = 1,     /*!< 1 : LPUART receiver in standby waiting for wakeup condition.              */
} LPUART0_CTRL_RWU_Enum;

/* ===========================================  LPUART0 LPUART0_CTRL RE [18..18]  ============================================ */
typedef enum {                                  /*!< LPUART0_CTRL_RE                                                           */
  LPUART0_CTRL_RE_0                    = 0,     /*!< 0 : Receiver disabled.                                                    */
  LPUART0_CTRL_RE_1                    = 1,     /*!< 1 : Receiver enabled.                                                     */
} LPUART0_CTRL_RE_Enum;

/* ===========================================  LPUART0 LPUART0_CTRL TE [19..19]  ============================================ */
typedef enum {                                  /*!< LPUART0_CTRL_TE                                                           */
  LPUART0_CTRL_TE_0                    = 0,     /*!< 0 : Transmitter disabled.                                                 */
  LPUART0_CTRL_TE_1                    = 1,     /*!< 1 : Transmitter enabled.                                                  */
} LPUART0_CTRL_TE_Enum;

