nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==========================================  LPUART1 LPUART1_STAT RWUID [27..27]  ========================================== */
typedef enum {                                  /*!< LPUART1_STAT_RWUID                                                        */
  LPUART1_STAT_RWUID_0                 = 0,     /*!< 0 : During receive standby state (RWU = 1), the IDLE bit does
                                                     not get set upon detection of an idle character. During
                                                     address match wakeup, the IDLE bit does not set when an
                                                     address does not match.                                                   */
  LPUART1_STAT_RWUID_1                 = 1,     /*!< 1 : During receive standby state (RWU = 1), the IDLE bit gets
                                                     set upon detection of an idle character. During address
                                                     match wakeup, the IDLE bit does set when an address does
                                                     not match.                                                                */
} LPUART1_STAT_RWUID_Enum;

/* ==========================================  LPUART1 LPUART1_STAT RXINV [28..28]  ========================================== */
typedef enum {                                  /*!< LPUART1_STAT_RXINV                                                        */
  LPUART1_STAT_RXINV_0                 = 0,     /*!< 0 : Receive data not inverted.                                            */
  LPUART1_STAT_RXINV_1                 = 1,     /*!< 1 : Receive data inverted.                                                */
} LPUART1_STAT_RXINV_Enum;

/* ==========================================  LPUART1 LPUART1_STAT MSBF [29..29]  =========================================== */
typedef enum {                                  /*!< LPUART1_STAT_MSBF                                                         */
  LPUART1_STAT_MSBF_0                  = 0,     /*!< 0 : LSB (bit0) is the first bit that is transmitted following
                                                     the start bit. Further, the first bit received after the
                                                     start bit is identified as bit0.                                          */
  LPUART1_STAT_MSBF_1                  = 1,     /*!< 1 : MSB (bit9, bit8, bit7 or bit6) is the first bit that is
                                                     transmitted following the start bit depending on the setting
                                                     of CTRL[M], CTRL[PE] and BAUD[M10]. Further, the first
                                                     bit received after the start bit is identified as bit9,
                                                     bit8, bit7 or bit6 depending on the setting of CTRL[M]
                                                     and CTRL[PE].                                                             */
} LPUART1_STAT_MSBF_Enum;

/* =========================================  LPUART1 LPUART1_STAT RXEDGIF [30..30]  ========================================= */
typedef enum {                                  /*!< LPUART1_STAT_RXEDGIF                                                      */
  LPUART1_STAT_RXEDGIF_0               = 0,     /*!< 0 : No active edge on the receive pin has occurred.                       */
  LPUART1_STAT_RXEDGIF_1               = 1,     /*!< 1 : An active edge on the receive pin has occurred.                       */
} LPUART1_STAT_RXEDGIF_Enum;

/* =========================================  LPUART1 LPUART1_STAT LBKDIF [31..31]  ========================================== */
typedef enum {                                  /*!< LPUART1_STAT_LBKDIF                                                       */
  LPUART1_STAT_LBKDIF_0                = 0,     /*!< 0 : No LIN break character has been detected.                             */
  LPUART1_STAT_LBKDIF_1                = 1,     /*!< 1 : LIN break character has been detected.                                */
} LPUART1_STAT_LBKDIF_Enum;

/* =====================================================  LPUART1_CTRL  ====================================================== */
/* ============================================  LPUART1 LPUART1_CTRL PT [0..0]  ============================================= */
typedef enum {                                  /*!< LPUART1_CTRL_PT                                                           */
  LPUART1_CTRL_PT_0                    = 0,     /*!< 0 : Even parity.                                                          */
  LPUART1_CTRL_PT_1                    = 1,     /*!< 1 : Odd parity.                                                           */
} LPUART1_CTRL_PT_Enum;

/* ============================================  LPUART1 LPUART1_CTRL PE [1..1]  ============================================= */
typedef enum {                                  /*!< LPUART1_CTRL_PE                                                           */
  LPUART1_CTRL_PE_0                    = 0,     /*!< 0 : No hardware parity generation or checking.                            */
  LPUART1_CTRL_PE_1                    = 1,     /*!< 1 : Parity enabled.                                                       */
} LPUART1_CTRL_PE_Enum;

/* ============================================  LPUART1 LPUART1_CTRL ILT [2..2]  ============================================ */
typedef enum {                                  /*!< LPUART1_CTRL_ILT                                                          */
  LPUART1_CTRL_ILT_0                   = 0,     /*!< 0 : Idle character bit count starts after start bit.                      */
  LPUART1_CTRL_ILT_1                   = 1,     /*!< 1 : Idle character bit count starts after stop bit.                       */
} LPUART1_CTRL_ILT_Enum;

/* ===========================================  LPUART1 LPUART1_CTRL WAKE [3..3]  ============================================ */
typedef enum {                                  /*!< LPUART1_CTRL_WAKE                                                         */
  LPUART1_CTRL_WAKE_0                  = 0,     /*!< 0 : Configures RWU for idle-line wakeup.                                  */
  LPUART1_CTRL_WAKE_1                  = 1,     /*!< 1 : Configures RWU with address-mark wakeup.                              */
} LPUART1_CTRL_WAKE_Enum;

/* =============================================  LPUART1 LPUART1_CTRL M [4..4]  ============================================= */
typedef enum {                                  /*!< LPUART1_CTRL_M                                                            */
  LPUART1_CTRL_M_0                     = 0,     /*!< 0 : Receiver and transmitter use 8-bit data characters.                   */
  LPUART1_CTRL_M_1                     = 1,     /*!< 1 : Receiver and transmitter use 9-bit data characters.                   */
} LPUART1_CTRL_M_Enum;

/* ===========================================  LPUART1 LPUART1_CTRL RSRC [5..5]  ============================================ */
typedef enum {                                  /*!< LPUART1_CTRL_RSRC                                                         */
  LPUART1_CTRL_RSRC_0                  = 0,     /*!< 0 : Provided LOOPS is set, RSRC is cleared, selects internal
                                                     loop back mode and the LPUART does not use the RXD pin.                   */
  LPUART1_CTRL_RSRC_1                  = 1,     /*!< 1 : Single-wire LPUART mode where the TXD pin is connected to
                                                     the transmitter output and receiver input.                                */
} LPUART1_CTRL_RSRC_Enum;

