nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  CMP0 CMP0_C0 DMAEN [30..30]  ============================================== */
typedef enum {                                  /*!< CMP0_C0_DMAEN                                                             */
  CMP0_C0_DMAEN_0                      = 0,     /*!< 0 : DMA is disabled.                                                      */
  CMP0_C0_DMAEN_1                      = 1,     /*!< 1 : DMA is enabled.                                                       */
} CMP0_C0_DMAEN_Enum;

/* ========================================================  CMP0_C1  ======================================================== */
/* ===============================================  CMP0 CMP0_C1 MSEL [8..10]  =============================================== */
typedef enum {                                  /*!< CMP0_C1_MSEL                                                              */
  CMP0_C1_MSEL_000                     = 0,     /*!< 000 : IN0                                                                 */
  CMP0_C1_MSEL_001                     = 1,     /*!< 001 : IN1                                                                 */
  CMP0_C1_MSEL_010                     = 2,     /*!< 010 : IN2                                                                 */
  CMP0_C1_MSEL_011                     = 3,     /*!< 011 : IN3                                                                 */
  CMP0_C1_MSEL_100                     = 4,     /*!< 100 : IN4                                                                 */
  CMP0_C1_MSEL_101                     = 5,     /*!< 101 : IN5                                                                 */
  CMP0_C1_MSEL_110                     = 6,     /*!< 110 : IN6                                                                 */
  CMP0_C1_MSEL_111                     = 7,     /*!< 111 : IN7                                                                 */
} CMP0_C1_MSEL_Enum;

/* ==============================================  CMP0 CMP0_C1 PSEL [11..13]  =============================================== */
typedef enum {                                  /*!< CMP0_C1_PSEL                                                              */
  CMP0_C1_PSEL_000                     = 0,     /*!< 000 : IN0                                                                 */
  CMP0_C1_PSEL_001                     = 1,     /*!< 001 : IN1                                                                 */
  CMP0_C1_PSEL_010                     = 2,     /*!< 010 : IN2                                                                 */
  CMP0_C1_PSEL_011                     = 3,     /*!< 011 : IN3                                                                 */
  CMP0_C1_PSEL_100                     = 4,     /*!< 100 : IN4                                                                 */
  CMP0_C1_PSEL_101                     = 5,     /*!< 101 : IN5                                                                 */
  CMP0_C1_PSEL_110                     = 6,     /*!< 110 : IN6                                                                 */
  CMP0_C1_PSEL_111                     = 7,     /*!< 111 : IN7                                                                 */
} CMP0_C1_PSEL_Enum;

/* ==============================================  CMP0 CMP0_C1 VRSEL [14..14]  ============================================== */
typedef enum {                                  /*!< CMP0_C1_VRSEL                                                             */
  CMP0_C1_VRSEL_0                      = 0,     /*!< 0 : Vin1 is selected as resistor ladder network supply reference
                                                     Vin.                                                                      */
  CMP0_C1_VRSEL_1                      = 1,     /*!< 1 : Vin2 is selected as resistor ladder network supply reference
                                                     Vin.                                                                      */
} CMP0_C1_VRSEL_Enum;

/* ==============================================  CMP0 CMP0_C1 DACEN [15..15]  ============================================== */
typedef enum {                                  /*!< CMP0_C1_DACEN                                                             */
  CMP0_C1_DACEN_0                      = 0,     /*!< 0 : DAC is disabled.                                                      */
  CMP0_C1_DACEN_1                      = 1,     /*!< 1 : DAC is enabled.                                                       */
} CMP0_C1_DACEN_Enum;

/* =============================================  CMP0 CMP0_C1 INNSEL [24..25]  ============================================== */
typedef enum {                                  /*!< CMP0_C1_INNSEL                                                            */
  CMP0_C1_INNSEL_00                    = 0,     /*!< 00 : IN0, from the 8-bit DAC output                                       */
  CMP0_C1_INNSEL_01                    = 1,     /*!< 01 : IN1, from the analog 8-1 mux                                         */
} CMP0_C1_INNSEL_Enum;

/* =============================================  CMP0 CMP0_C1 INPSEL [27..28]  ============================================== */
typedef enum {                                  /*!< CMP0_C1_INPSEL                                                            */
  CMP0_C1_INPSEL_00                    = 0,     /*!< 00 : IN0, from the 8-bit DAC output                                       */
  CMP0_C1_INPSEL_01                    = 1,     /*!< 01 : IN1, from the analog 8-1 mux                                         */
} CMP0_C1_INPSEL_Enum;

/* ========================================================  CMP0_C2  ======================================================== */
/* =============================================  CMP0 CMP0_C2 INITMOD [8..13]  ============================================== */
typedef enum {                                  /*!< CMP0_C2_INITMOD                                                           */
  CMP0_C2_INITMOD_000000               = 0,     /*!< 000000 : The modulus is set to 64 (same with 111111).                     */
} CMP0_C2_INITMOD_Enum;

