nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===============================================  RCM RCM_SSRS SPOR [7..7]  ================================================ */
typedef enum {                                  /*!< RCM_SSRS_SPOR                                                             */
  RCM_SSRS_SPOR_0                      = 0,     /*!< 0 : Reset not caused by POR                                               */
  RCM_SSRS_SPOR_1                      = 1,     /*!< 1 : Reset caused by POR                                                   */
} RCM_SSRS_SPOR_Enum;

/* ===============================================  RCM RCM_SSRS SJTAG [8..8]  =============================================== */
typedef enum {                                  /*!< RCM_SSRS_SJTAG                                                            */
  RCM_SSRS_SJTAG_0                     = 0,     /*!< 0 : Reset not caused by JTAG                                              */
  RCM_SSRS_SJTAG_1                     = 1,     /*!< 1 : Reset caused by JTAG                                                  */
} RCM_SSRS_SJTAG_Enum;

/* ==============================================  RCM RCM_SSRS SLOCKUP [9..9]  ============================================== */
typedef enum {                                  /*!< RCM_SSRS_SLOCKUP                                                          */
  RCM_SSRS_SLOCKUP_0                   = 0,     /*!< 0 : Reset not caused by core LOCKUP event                                 */
  RCM_SSRS_SLOCKUP_1                   = 1,     /*!< 1 : Reset caused by core LOCKUP event                                     */
} RCM_SSRS_SLOCKUP_Enum;

/* ===============================================  RCM RCM_SSRS SSW [10..10]  =============================================== */
typedef enum {                                  /*!< RCM_SSRS_SSW                                                              */
  RCM_SSRS_SSW_0                       = 0,     /*!< 0 : Reset not caused by software setting of SYSRESETREQ bit               */
  RCM_SSRS_SSW_1                       = 1,     /*!< 1 : Reset caused by software setting of SYSRESETREQ bit                   */
} RCM_SSRS_SSW_Enum;

/* =============================================  RCM RCM_SSRS SMDM_AP [11..11]  ============================================= */
typedef enum {                                  /*!< RCM_SSRS_SMDM_AP                                                          */
  RCM_SSRS_SMDM_AP_0                   = 0,     /*!< 0 : Reset was not caused by host debugger system setting of
                                                     the System Reset Request bit                                              */
  RCM_SSRS_SMDM_AP_1                   = 1,     /*!< 1 : Reset was caused by host debugger system setting of the
                                                     System Reset Request bit                                                  */
} RCM_SSRS_SMDM_AP_Enum;

/* ============================================  RCM RCM_SSRS SSACKERR [13..13]  ============================================= */
typedef enum {                                  /*!< RCM_SSRS_SSACKERR                                                         */
  RCM_SSRS_SSACKERR_0                  = 0,     /*!< 0 : Reset not caused by peripheral failure to acknowledge attempt
                                                     to enter stop mode                                                        */
  RCM_SSRS_SSACKERR_1                  = 1,     /*!< 1 : Reset caused by peripheral failure to acknowledge attempt
                                                     to enter stop mode                                                        */
} RCM_SSRS_SSACKERR_Enum;

/* =======================================================  RCM_SRIE  ======================================================== */
/* ===============================================  RCM RCM_SRIE DELAY [0..1]  =============================================== */
typedef enum {                                  /*!< RCM_SRIE_DELAY                                                            */
  RCM_SRIE_DELAY_00                    = 0,     /*!< 00 : 10 LPO cycles                                                        */
  RCM_SRIE_DELAY_01                    = 1,     /*!< 01 : 34 LPO cycles                                                        */
  RCM_SRIE_DELAY_10                    = 2,     /*!< 10 : 130 LPO cycles                                                       */
  RCM_SRIE_DELAY_11                    = 3,     /*!< 11 : 514 LPO cycles                                                       */
} RCM_SRIE_DELAY_Enum;

/* ================================================  RCM RCM_SRIE LOC [2..2]  ================================================ */
typedef enum {                                  /*!< RCM_SRIE_LOC                                                              */
  RCM_SRIE_LOC_0                       = 0,     /*!< 0 : Interrupt disabled.                                                   */
  RCM_SRIE_LOC_1                       = 1,     /*!< 1 : Interrupt enabled.                                                    */
} RCM_SRIE_LOC_Enum;

/* ================================================  RCM RCM_SRIE LOL [3..3]  ================================================ */
typedef enum {                                  /*!< RCM_SRIE_LOL                                                              */
  RCM_SRIE_LOL_0                       = 0,     /*!< 0 : Interrupt disabled.                                                   */
  RCM_SRIE_LOL_1                       = 1,     /*!< 1 : Interrupt enabled.                                                    */
} RCM_SRIE_LOL_Enum;

/* ==============================================  RCM RCM_SRIE CMU_LOC [4..4]  ============================================== */
typedef enum {                                  /*!< RCM_SRIE_CMU_LOC                                                          */
  RCM_SRIE_CMU_LOC_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  RCM_SRIE_CMU_LOC_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} RCM_SRIE_CMU_LOC_Enum;

