nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  S32_SCB SCB_DFSR VCATCH [3..3]  ============================================= */
typedef enum {                                  /*!< S32_SCB_DFSR_VCATCH                                                       */
  S32_SCB_DFSR_VCATCH_0                = 0,     /*!< 0 : No Vector catch triggered                                             */
  S32_SCB_DFSR_VCATCH_1                = 1,     /*!< 1 : Vector catch triggered                                                */
} S32_SCB_DFSR_VCATCH_Enum;

/* ===========================================  S32_SCB SCB_DFSR EXTERNAL [4..4]  ============================================ */
typedef enum {                                  /*!< S32_SCB_DFSR_EXTERNAL                                                     */
  S32_SCB_DFSR_EXTERNAL_0              = 0,     /*!< 0 : No EDBGRQ debug event                                                 */
  S32_SCB_DFSR_EXTERNAL_1              = 1,     /*!< 1 : EDBGRQ debug event                                                    */
} S32_SCB_DFSR_EXTERNAL_Enum;



/* =========================================================================================================================== */
/* ================                                        S32_SysTick                                        ================ */
/* =========================================================================================================================== */

/* =======================================================  SYST_CSR  ======================================================== */
/* ==========================================  S32_SysTick SYST_CSR ENABLE [0..0]  =========================================== */
typedef enum {                                  /*!< S32_SysTick_CSR_ENABLE                                                    */
  S32_SysTick_CSR_ENABLE_0             = 0,     /*!< 0 : counter disabled                                                      */
  S32_SysTick_CSR_ENABLE_1             = 1,     /*!< 1 : counter enabled                                                       */
} S32_SysTick_CSR_ENABLE_Enum;

/* ==========================================  S32_SysTick SYST_CSR TICKINT [1..1]  ========================================== */
typedef enum {                                  /*!< S32_SysTick_CSR_TICKINT                                                   */
  S32_SysTick_CSR_TICKINT_0            = 0,     /*!< 0 : counting down to 0 does not assert the SysTick exception
                                                     request                                                                   */
  S32_SysTick_CSR_TICKINT_1            = 1,     /*!< 1 : counting down to 0 asserts the SysTick exception request              */
} S32_SysTick_CSR_TICKINT_Enum;

/* =========================================  S32_SysTick SYST_CSR CLKSOURCE [2..2]  ========================================= */
typedef enum {                                  /*!< S32_SysTick_CSR_CLKSOURCE                                                 */
  S32_SysTick_CSR_CLKSOURCE_0          = 0,     /*!< 0 : external clock                                                        */
  S32_SysTick_CSR_CLKSOURCE_1          = 1,     /*!< 1 : processor clock                                                       */
} S32_SysTick_CSR_CLKSOURCE_Enum;

/* =======================================================  SYST_RVR  ======================================================== */
/* =======================================================  SYST_CVR  ======================================================== */
/* ======================================================  SYST_CALIB  ======================================================= */
/* =========================================  S32_SysTick SYST_CALIB SKEW [30..30]  ========================================== */
typedef enum {                                  /*!< S32_SysTick_CALIB_SKEW                                                    */
  S32_SysTick_CALIB_SKEW_0             = 0,     /*!< 0 : TENMS value is exact                                                  */
  S32_SysTick_CALIB_SKEW_1             = 1,     /*!< 1 : TENMS value is inexact, or not given                                  */
} S32_SysTick_CALIB_SKEW_Enum;

/* =========================================  S32_SysTick SYST_CALIB NOREF [31..31]  ========================================= */
typedef enum {                                  /*!< S32_SysTick_CALIB_NOREF                                                   */
  S32_SysTick_CALIB_NOREF_0            = 0,     /*!< 0 : The reference clock is provided                                       */
  S32_SysTick_CALIB_NOREF_1            = 1,     /*!< 1 : The reference clock is not provided                                   */
} S32_SysTick_CALIB_NOREF_Enum;



/* =========================================================================================================================== */
/* ================                                         S32_NVIC                                          ================ */
/* =========================================================================================================================== */

/* =====================================================  S32_NVIC_ISER  ===================================================== */
/* =====================================================  S32_NVIC_ICER  ===================================================== */
/* =====================================================  S32_NVIC_ISPR  ===================================================== */
/* =====================================================  S32_NVIC_ICPR  ===================================================== */
/* =====================================================  S32_NVIC_IPR0  ===================================================== */
/* =====================================================  S32_NVIC_IPR1  ===================================================== */
/* =====================================================  S32_NVIC_IPR2  ===================================================== */
/* =====================================================  S32_NVIC_IPR3  ===================================================== */
/* =====================================================  S32_NVIC_IPR4  ===================================================== */
/* =====================================================  S32_NVIC_IPR5  ===================================================== */
/* =====================================================  S32_NVIC_IPR6  ===================================================== */
/* =====================================================  S32_NVIC_IPR7  ===================================================== */


/* =========================================================================================================================== */
/* ================                                           LMEM                                            ================ */
/* =========================================================================================================================== */

