nxp-auto-support/s32k118_cookbook/S32K118_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ====================================================  LMEM_LMEM_PCCCR  ==================================================== */
/* ==========================================  LMEM LMEM_LMEM_PCCCR ENCACHE [0..0]  ========================================== */
typedef enum {                                  /*!< LMEM_LMEM_PCCCR_ENCACHE                                                   */
  LMEM_LMEM_PCCCR_ENCACHE_0            = 0,     /*!< 0 : Cache disabled                                                        */
  LMEM_LMEM_PCCCR_ENCACHE_1            = 1,     /*!< 1 : Cache enabled                                                         */
} LMEM_LMEM_PCCCR_ENCACHE_Enum;

/* ==========================================  LMEM LMEM_LMEM_PCCCR INVW0 [24..24]  ========================================== */
typedef enum {                                  /*!< LMEM_LMEM_PCCCR_INVW0                                                     */
  LMEM_LMEM_PCCCR_INVW0_0              = 0,     /*!< 0 : No operation                                                          */
  LMEM_LMEM_PCCCR_INVW0_1              = 1,     /*!< 1 : When setting the GO bit, invalidate all lines in way 0.               */
} LMEM_LMEM_PCCCR_INVW0_Enum;

/* =========================================  LMEM LMEM_LMEM_PCCCR PUSHW0 [25..25]  ========================================== */
typedef enum {                                  /*!< LMEM_LMEM_PCCCR_PUSHW0                                                    */
  LMEM_LMEM_PCCCR_PUSHW0_0             = 0,     /*!< 0 : No operation                                                          */
  LMEM_LMEM_PCCCR_PUSHW0_1             = 1,     /*!< 1 : When setting the GO bit, push all modified lines in way
                                                     0                                                                         */
} LMEM_LMEM_PCCCR_PUSHW0_Enum;

/* ==========================================  LMEM LMEM_LMEM_PCCCR INVW1 [26..26]  ========================================== */
typedef enum {                                  /*!< LMEM_LMEM_PCCCR_INVW1                                                     */
  LMEM_LMEM_PCCCR_INVW1_0              = 0,     /*!< 0 : No operation                                                          */
  LMEM_LMEM_PCCCR_INVW1_1              = 1,     /*!< 1 : When setting the GO bit, invalidate all lines in way 1                */
} LMEM_LMEM_PCCCR_INVW1_Enum;

/* =========================================  LMEM LMEM_LMEM_PCCCR PUSHW1 [27..27]  ========================================== */
typedef enum {                                  /*!< LMEM_LMEM_PCCCR_PUSHW1                                                    */
  LMEM_LMEM_PCCCR_PUSHW1_0             = 0,     /*!< 0 : No operation                                                          */
  LMEM_LMEM_PCCCR_PUSHW1_1             = 1,     /*!< 1 : When setting the GO bit, push all modified lines in way
                                                     1                                                                         */
} LMEM_LMEM_PCCCR_PUSHW1_Enum;

/* ===========================================  LMEM LMEM_LMEM_PCCCR GO [31..31]  ============================================ */
typedef enum {                                  /*!< LMEM_LMEM_PCCCR_GO                                                        */
  LMEM_LMEM_PCCCR_GO_0                 = 0,     /*!< 0 : Write: no effect. Read: no cache command active.                      */
  LMEM_LMEM_PCCCR_GO_1                 = 1,     /*!< 1 : Write: initiate command indicated by bits 27-24. Read: cache
                                                     command active.                                                           */
} LMEM_LMEM_PCCCR_GO_Enum;

/* ===================================================  LMEM_LMEM_PCCLCR  ==================================================== */
/* ===========================================  LMEM LMEM_LMEM_PCCLCR LGO [0..0]  ============================================ */
typedef enum {                                  /*!< LMEM_LMEM_PCCLCR_LGO                                                      */
  LMEM_LMEM_PCCLCR_LGO_0               = 0,     /*!< 0 : Write: no effect. Read: no line command active.                       */
  LMEM_LMEM_PCCLCR_LGO_1               = 1,     /*!< 1 : Write: initiate line command indicated by bits 27-24. Read:
                                                     line command active.                                                      */
} LMEM_LMEM_PCCLCR_LGO_Enum;

/* ==========================================  LMEM LMEM_LMEM_PCCLCR WSEL [14..14]  ========================================== */
typedef enum {                                  /*!< LMEM_LMEM_PCCLCR_WSEL                                                     */
  LMEM_LMEM_PCCLCR_WSEL_0              = 0,     /*!< 0 : Way 0                                                                 */
  LMEM_LMEM_PCCLCR_WSEL_1              = 1,     /*!< 1 : Way 1                                                                 */
} LMEM_LMEM_PCCLCR_WSEL_Enum;

/* =========================================  LMEM LMEM_LMEM_PCCLCR TDSEL [16..16]  ========================================== */
typedef enum {                                  /*!< LMEM_LMEM_PCCLCR_TDSEL                                                    */
  LMEM_LMEM_PCCLCR_TDSEL_0             = 0,     /*!< 0 : Data                                                                  */
  LMEM_LMEM_PCCLCR_TDSEL_1             = 1,     /*!< 1 : Tag                                                                   */
} LMEM_LMEM_PCCLCR_TDSEL_Enum;

/* ==========================================  LMEM LMEM_LMEM_PCCLCR LCMD [24..25]  ========================================== */
typedef enum {                                  /*!< LMEM_LMEM_PCCLCR_LCMD                                                     */
  LMEM_LMEM_PCCLCR_LCMD_00             = 0,     /*!< 00 : Search and read or write                                             */
  LMEM_LMEM_PCCLCR_LCMD_01             = 1,     /*!< 01 : Invalidate                                                           */
  LMEM_LMEM_PCCLCR_LCMD_10             = 2,     /*!< 10 : Push                                                                 */
  LMEM_LMEM_PCCLCR_LCMD_11             = 3,     /*!< 11 : Clear                                                                */
} LMEM_LMEM_PCCLCR_LCMD_Enum;

/* =========================================  LMEM LMEM_LMEM_PCCLCR LADSEL [26..26]  ========================================= */
typedef enum {                                  /*!< LMEM_LMEM_PCCLCR_LADSEL                                                   */
  LMEM_LMEM_PCCLCR_LADSEL_0            = 0,     /*!< 0 : Cache address                                                         */
  LMEM_LMEM_PCCLCR_LADSEL_1            = 1,     /*!< 1 : Physical address                                                      */
} LMEM_LMEM_PCCLCR_LADSEL_Enum;

/* ==========================================  LMEM LMEM_LMEM_PCCLCR LACC [27..27]  ========================================== */
typedef enum {                                  /*!< LMEM_LMEM_PCCLCR_LACC                                                     */
  LMEM_LMEM_PCCLCR_LACC_0              = 0,     /*!< 0 : Read                                                                  */
  LMEM_LMEM_PCCLCR_LACC_1              = 1,     /*!< 1 : Write                                                                 */
} LMEM_LMEM_PCCLCR_LACC_Enum;

/* ===================================================  LMEM_LMEM_PCCSAR  ==================================================== */
/* ===========================================  LMEM LMEM_LMEM_PCCSAR LGO [0..0]  ============================================ */
typedef enum {                                  /*!< LMEM_LMEM_PCCSAR_LGO                                                      */
  LMEM_LMEM_PCCSAR_LGO_0               = 0,     /*!< 0 : Write: no effect. Read: no line command active.                       */
  LMEM_LMEM_PCCSAR_LGO_1               = 1,     /*!< 1 : Write: initiate line command indicated by bits CLCR[27:24].
                                                     Read: line command active.                                                */
} LMEM_LMEM_PCCSAR_LGO_Enum;

/* ===================================================  LMEM_LMEM_PCCCVR  ==================================================== */
/* ======================================================  LMEM_PCCRMR  ====================================================== */
/* ==============================================  LMEM LMEM_PCCRMR R15 [0..1]  ============================================== */
typedef enum {                                  /*!< LMEM_PCCRMR_R15                                                           */
  LMEM_PCCRMR_R15_00                   = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R15_01                   = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R15_10                   = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R15_11                   = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R15_Enum;

/* ==============================================  LMEM LMEM_PCCRMR R14 [2..3]  ============================================== */
typedef enum {                                  /*!< LMEM_PCCRMR_R14                                                           */
  LMEM_PCCRMR_R14_00                   = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R14_01                   = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R14_10                   = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R14_11                   = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R14_Enum;

/* ==============================================  LMEM LMEM_PCCRMR R13 [4..5]  ============================================== */
typedef enum {                                  /*!< LMEM_PCCRMR_R13                                                           */
  LMEM_PCCRMR_R13_00                   = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R13_01                   = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R13_10                   = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R13_11                   = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R13_Enum;

/* ==============================================  LMEM LMEM_PCCRMR R12 [6..7]  ============================================== */
typedef enum {                                  /*!< LMEM_PCCRMR_R12                                                           */
  LMEM_PCCRMR_R12_00                   = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R12_01                   = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R12_10                   = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R12_11                   = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R12_Enum;

/* ==============================================  LMEM LMEM_PCCRMR R11 [8..9]  ============================================== */
typedef enum {                                  /*!< LMEM_PCCRMR_R11                                                           */
  LMEM_PCCRMR_R11_00                   = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R11_01                   = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R11_10                   = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R11_11                   = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R11_Enum;

/* =============================================  LMEM LMEM_PCCRMR R10 [10..11]  ============================================= */
typedef enum {                                  /*!< LMEM_PCCRMR_R10                                                           */
  LMEM_PCCRMR_R10_00                   = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R10_01                   = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R10_10                   = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R10_11                   = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R10_Enum;

/* =============================================  LMEM LMEM_PCCRMR R9 [12..13]  ============================================== */
typedef enum {                                  /*!< LMEM_PCCRMR_R9                                                            */
  LMEM_PCCRMR_R9_00                    = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R9_01                    = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R9_10                    = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R9_11                    = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R9_Enum;

/* =============================================  LMEM LMEM_PCCRMR R8 [14..15]  ============================================== */
typedef enum {                                  /*!< LMEM_PCCRMR_R8                                                            */
  LMEM_PCCRMR_R8_00                    = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R8_01                    = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R8_10                    = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R8_11                    = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R8_Enum;

/* =============================================  LMEM LMEM_PCCRMR R7 [16..17]  ============================================== */
typedef enum {                                  /*!< LMEM_PCCRMR_R7                                                            */
  LMEM_PCCRMR_R7_00                    = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R7_01                    = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R7_10                    = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R7_11                    = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R7_Enum;

